#pragma once
#include "common.h"
namespace SDK
{


    struct FAKWaapiJsonObject //ScriptStruct AkAudio.AKWaapiJsonObject
    {
    public:


    };

    struct FDefault__ScriptStruct //ScriptStruct CoreUObject.Default__ScriptStruct
    {
    public:


    };

    struct FAkWaapiSubscriptionId //ScriptStruct AkAudio.AkWaapiSubscriptionId
    {
    public:


    };

    struct FJoinabilitySettings //ScriptStruct CoreUObject.JoinabilitySettings
    {
    //Children Prop Count (Fields): 7
    public:

        struct FName SessionName; // 0x0
        bool bPublicSearchable; // 0x8
        bool bAllowInvites; // 0x9
        bool bJoinViaPresence; // 0xa
        bool bJoinViaPresenceFriendsOnly; // 0xb
        int32_t MaxPlayers; // 0xc
        int32_t MaxPartySize; // 0x10

    };

    struct FUniqueNetIdWrapper //ScriptStruct CoreUObject.UniqueNetIdWrapper
    {
    public:


    };

    struct FGuid //ScriptStruct CoreUObject.Guid
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t A; // 0x0
        int32_t B; // 0x4
        int32_t C; // 0x8
        int32_t D; // 0xc

    };

    struct FVector //ScriptStruct CoreUObject.Vector
    {
    //Children Prop Count (Fields): 3
    public:

        float X; // 0x0
        float Y; // 0x4
        float Z; // 0x8

    };

    struct FVector4 //ScriptStruct CoreUObject.Vector4
    {
    //Children Prop Count (Fields): 4
    public:

        float X; // 0x0
        float Y; // 0x4
        float Z; // 0x8
        float W; // 0xc

    };

    struct FVector2D //ScriptStruct CoreUObject.Vector2D
    {
    //Children Prop Count (Fields): 2
    public:

        float X; // 0x0
        float Y; // 0x4

    };

    struct FTwoVectors //ScriptStruct CoreUObject.TwoVectors
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector v1; // 0x0
        struct FVector v2; // 0xc

    };

    struct FPlane : FVector //ScriptStruct CoreUObject.Plane
    {
    //Children Prop Count (Fields): 1
    public:

        float W; // 0xc

    };

    struct FRotator //ScriptStruct CoreUObject.Rotator
    {
    //Children Prop Count (Fields): 3
    public:

        float Pitch; // 0x0
        float Yaw; // 0x4
        float Roll; // 0x8

    };

    struct FQuat //ScriptStruct CoreUObject.Quat
    {
    //Children Prop Count (Fields): 4
    public:

        float X; // 0x0
        float Y; // 0x4
        float Z; // 0x8
        float W; // 0xc

    };

    struct FPackedNormal //ScriptStruct CoreUObject.PackedNormal
    {
    //Children Prop Count (Fields): 4
    public:

        char X; // 0x0
        char Y; // 0x1
        char Z; // 0x2
        char W; // 0x3

    };

    struct FPackedRGB10A2N //ScriptStruct CoreUObject.PackedRGB10A2N
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Packed; // 0x0

    };

    struct FPackedRGBA16N //ScriptStruct CoreUObject.PackedRGBA16N
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t XY; // 0x0
        int32_t ZW; // 0x4

    };

    struct FIntPoint //ScriptStruct CoreUObject.IntPoint
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t X; // 0x0
        int32_t Y; // 0x4

    };

    struct FIntVector //ScriptStruct CoreUObject.IntVector
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t X; // 0x0
        int32_t Y; // 0x4
        int32_t Z; // 0x8

    };

    struct FColor //ScriptStruct CoreUObject.Color
    {
    //Children Prop Count (Fields): 4
    public:

        char B; // 0x0
        char G; // 0x1
        char R; // 0x2
        char A; // 0x3

    };

    struct FLinearColor //ScriptStruct CoreUObject.LinearColor
    {
    //Children Prop Count (Fields): 4
    public:

        float R; // 0x0
        float G; // 0x4
        float B; // 0x8
        float A; // 0xc

    };

    struct FBox //ScriptStruct CoreUObject.Box
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Min; // 0x0
        struct FVector Max; // 0xc
        char IsValid; // 0x18

    };

    struct FBox2D //ScriptStruct CoreUObject.Box2D
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector2D Min; // 0x0
        struct FVector2D Max; // 0x8
        char bIsValid; // 0x10

    };

    struct FBoxSphereBounds //ScriptStruct CoreUObject.BoxSphereBounds
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Origin; // 0x0
        struct FVector BoxExtent; // 0xc
        float SphereRadius; // 0x18

    };

    struct FOrientedBox //ScriptStruct CoreUObject.OrientedBox
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector Center; // 0x0
        struct FVector AxisX; // 0xc
        struct FVector AxisY; // 0x18
        struct FVector AxisZ; // 0x24
        float ExtentX; // 0x30
        float ExtentY; // 0x34
        float ExtentZ; // 0x38

    };

    struct FMatrix //ScriptStruct CoreUObject.Matrix
    {
    //Children Prop Count (Fields): 4
    public:

        struct FPlane XPlane; // 0x0
        struct FPlane YPlane; // 0x10
        struct FPlane ZPlane; // 0x20
        struct FPlane WPlane; // 0x30

    };

    struct FInterpCurvePointFloat //ScriptStruct CoreUObject.InterpCurvePointFloat
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        float OutVal; // 0x4
        float ArriveTangent; // 0x8
        float LeaveTangent; // 0xc
        enum class EInterpCurveMode InterpMode; // 0x10

    };

    struct FInterpCurveFloat //ScriptStruct CoreUObject.InterpCurveFloat
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointFloat> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointVector2D //ScriptStruct CoreUObject.InterpCurvePointVector2D
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FVector2D OutVal; // 0x4
        struct FVector2D ArriveTangent; // 0xc
        struct FVector2D LeaveTangent; // 0x14
        enum class EInterpCurveMode InterpMode; // 0x1c

    };

    struct FInterpCurveVector2D //ScriptStruct CoreUObject.InterpCurveVector2D
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointVector2D> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointVector //ScriptStruct CoreUObject.InterpCurvePointVector
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FVector OutVal; // 0x4
        struct FVector ArriveTangent; // 0x10
        struct FVector LeaveTangent; // 0x1c
        enum class EInterpCurveMode InterpMode; // 0x28

    };

    struct FInterpCurveVector //ScriptStruct CoreUObject.InterpCurveVector
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointVector> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointQuat //ScriptStruct CoreUObject.InterpCurvePointQuat
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FQuat OutVal; // 0x10
        struct FQuat ArriveTangent; // 0x20
        struct FQuat LeaveTangent; // 0x30
        enum class EInterpCurveMode InterpMode; // 0x40

    };

    struct FInterpCurveQuat //ScriptStruct CoreUObject.InterpCurveQuat
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointQuat> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointTwoVectors //ScriptStruct CoreUObject.InterpCurvePointTwoVectors
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FTwoVectors OutVal; // 0x4
        struct FTwoVectors ArriveTangent; // 0x1c
        struct FTwoVectors LeaveTangent; // 0x34
        enum class EInterpCurveMode InterpMode; // 0x4c

    };

    struct FInterpCurveTwoVectors //ScriptStruct CoreUObject.InterpCurveTwoVectors
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointTwoVectors> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FInterpCurvePointLinearColor //ScriptStruct CoreUObject.InterpCurvePointLinearColor
    {
    //Children Prop Count (Fields): 5
    public:

        float InVal; // 0x0
        struct FLinearColor OutVal; // 0x4
        struct FLinearColor ArriveTangent; // 0x14
        struct FLinearColor LeaveTangent; // 0x24
        enum class EInterpCurveMode InterpMode; // 0x34

    };

    struct FInterpCurveLinearColor //ScriptStruct CoreUObject.InterpCurveLinearColor
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FInterpCurvePointLinearColor> Points; // 0x0
        bool bIsLooped; // 0x10
        float LoopKeyOffset; // 0x14

    };

    struct FTransform //ScriptStruct CoreUObject.Transform
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat Rotation; // 0x0
        struct FVector Translation; // 0x10
        struct FVector Scale3D; // 0x20

    };

    struct FRandomStream //ScriptStruct CoreUObject.RandomStream
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t InitialSeed; // 0x0
        int32_t Seed; // 0x4

    };

    struct FDateTime //ScriptStruct CoreUObject.DateTime
    {
    public:


    };

    struct FFrameNumber //ScriptStruct CoreUObject.FrameNumber
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Value; // 0x0

    };

    struct FFrameRate //ScriptStruct CoreUObject.FrameRate
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Numerator; // 0x0
        int32_t Denominator; // 0x4

    };

    struct FFrameTime //ScriptStruct CoreUObject.FrameTime
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumber FrameNumber; // 0x0
        float SubFrame; // 0x4

    };

    struct FQualifiedFrameTime //ScriptStruct CoreUObject.QualifiedFrameTime
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameTime Time; // 0x0
        struct FFrameRate Rate; // 0x8

    };

    struct FTimecode //ScriptStruct CoreUObject.Timecode
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t Hours; // 0x0
        int32_t Minutes; // 0x4
        int32_t Seconds; // 0x8
        int32_t Frames; // 0xc
        bool bDropFrameFormat; // 0x10

    };

    struct FTimespan //ScriptStruct CoreUObject.Timespan
    {
    public:


    };

    struct FSoftObjectPath //ScriptStruct CoreUObject.SoftObjectPath
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName AssetPathName; // 0x0
        struct FString SubPathString; // 0x8

    };

    struct FSoftClassPath : FSoftObjectPath //ScriptStruct CoreUObject.SoftClassPath
    {
    public:


    };

    struct FPrimaryAssetType //ScriptStruct CoreUObject.PrimaryAssetType
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Name; // 0x0

    };

    struct FPrimaryAssetId //ScriptStruct CoreUObject.PrimaryAssetId
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPrimaryAssetType PrimaryAssetType; // 0x0
        struct FName PrimaryAssetName; // 0x8

    };

    struct FFallbackStruct //ScriptStruct CoreUObject.FallbackStruct
    {
    public:


    };

    struct FFloatRangeBound //ScriptStruct CoreUObject.FloatRangeBound
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ERangeBoundTypes Type; // 0x0
        float Value; // 0x4

    };

    struct FFloatRange //ScriptStruct CoreUObject.FloatRange
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFloatRangeBound LowerBound; // 0x0
        struct FFloatRangeBound UpperBound; // 0x8

    };

    struct FInt32RangeBound //ScriptStruct CoreUObject.Int32RangeBound
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ERangeBoundTypes Type; // 0x0
        int32_t Value; // 0x4

    };

    struct FInt32Range //ScriptStruct CoreUObject.Int32Range
    {
    //Children Prop Count (Fields): 2
    public:

        struct FInt32RangeBound LowerBound; // 0x0
        struct FInt32RangeBound UpperBound; // 0x8

    };

    struct FFrameNumberRangeBound //ScriptStruct CoreUObject.FrameNumberRangeBound
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ERangeBoundTypes Type; // 0x0
        struct FFrameNumber Value; // 0x4

    };

    struct FFrameNumberRange //ScriptStruct CoreUObject.FrameNumberRange
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumberRangeBound LowerBound; // 0x0
        struct FFrameNumberRangeBound UpperBound; // 0x8

    };

    struct FFloatInterval //ScriptStruct CoreUObject.FloatInterval
    {
    //Children Prop Count (Fields): 2
    public:

        float Min; // 0x0
        float Max; // 0x4

    };

    struct FInt32Interval //ScriptStruct CoreUObject.Int32Interval
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Min; // 0x0
        int32_t Max; // 0x4

    };

    struct FPolyglotTextData //ScriptStruct CoreUObject.PolyglotTextData
    {
    //Children Prop Count (Fields): 8
    public:

        enum class ELocalizedTextSourceCategory Category; // 0x0
        struct FString NativeCulture; // 0x8
        struct FString Namespace; // 0x18
        struct FString Key; // 0x28
        struct FString NativeString; // 0x38
        struct TMap<struct FString, struct FString> LocalizedStrings; // 0x48
        bool bIsMinimalPatch; // 0x98
        struct FText CachedText; // 0xa0

    };

    struct FAutomationEvent //ScriptStruct CoreUObject.AutomationEvent
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EAutomationEventType Type; // 0x0
        struct FString Message; // 0x8
        struct FString Context; // 0x18
        struct FGuid Artifact; // 0x28

    };

    struct FAutomationExecutionEntry //ScriptStruct CoreUObject.AutomationExecutionEntry
    {
    //Children Prop Count (Fields): 4
    public:

        struct FAutomationEvent Event; // 0x0
        struct FString Filename; // 0x38
        int32_t LineNumber; // 0x48
        struct FDateTime Timestamp; // 0x50

    };

    struct FARFilter //ScriptStruct CoreUObject.ARFilter
    {
    //Children Prop Count (Fields): 8
    public:

        struct TArray<struct FName> PackageNames; // 0x0
        struct TArray<struct FName> PackagePaths; // 0x10
        struct TArray<struct FName> ObjectPaths; // 0x20
        struct TArray<struct FName> ClassNames; // 0x30
        struct TSet<struct FName> RecursiveClassesExclusionSet; // 0x90
        bool bRecursivePaths; // 0xe0
        bool bRecursiveClasses; // 0xe1
        bool bIncludeOnlyOnDiskAssets; // 0xe2

    };

    struct FAssetBundleEntry //ScriptStruct CoreUObject.AssetBundleEntry
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPrimaryAssetId BundleScope; // 0x0
        struct FName BundleName; // 0x10
        struct TArray<struct FSoftObjectPath> BundleAssets; // 0x18

    };

    struct FAssetBundleData //ScriptStruct CoreUObject.AssetBundleData
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FAssetBundleEntry> Bundles; // 0x0

    };

    struct FAssetData //ScriptStruct CoreUObject.AssetData
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName ObjectPath; // 0x0
        struct FName PackageName; // 0x8
        struct FName PackagePath; // 0x10
        struct FName AssetName; // 0x18
        struct FName AssetClass; // 0x20

    };

    struct FGameplayTag //ScriptStruct GameplayTags.GameplayTag
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName TagName; // 0x0

    };

    struct FDistributionLookupTable //ScriptStruct Engine.DistributionLookupTable
    {
    //Children Prop Count (Fields): 8
    public:

        float TimeScale; // 0x0
        float TimeBias; // 0x4
        struct TArray<float> Values; // 0x8
        char Op; // 0x18
        char EntryCount; // 0x19
        char EntryStride; // 0x1a
        char SubEntryStride; // 0x1b
        char LockFlag; // 0x1c

    };

    struct FRawDistribution //ScriptStruct Engine.RawDistribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FFloatDistribution //ScriptStruct Engine.FloatDistribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FVectorDistribution //ScriptStruct Engine.VectorDistribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FVector4Distribution //ScriptStruct Engine.Vector4Distribution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FDistributionLookupTable Table; // 0x0

    };

    struct FFloatRK4SpringInterpolator //ScriptStruct Engine.FloatRK4SpringInterpolator
    {
    //Children Prop Count (Fields): 2
    public:

        float StiffnessConstant; // 0x0
        float DampeningRatio; // 0x4

    };

    struct FVectorRK4SpringInterpolator //ScriptStruct Engine.VectorRK4SpringInterpolator
    {
    //Children Prop Count (Fields): 2
    public:

        float StiffnessConstant; // 0x0
        float DampeningRatio; // 0x4

    };

    struct FFormatArgumentData //ScriptStruct Engine.FormatArgumentData
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString ArgumentName; // 0x0
        enum class EFormatArgumentType ArgumentValueType; // 0x10
        struct FText ArgumentValue; // 0x18
        int32_t ArgumentValueInt; // 0x30
        float ArgumentValueFloat; // 0x34
        enum class ETextGender ArgumentValueGender; // 0x38

    };

    struct FExpressionInput //ScriptStruct Engine.ExpressionInput
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t OutputIndex; // 0x0
        struct FName ExpressionName; // 0x4

    };

    struct FMaterialAttributesInput : FExpressionInput //ScriptStruct Engine.MaterialAttributesInput
    {
    //Children Prop Count (Fields): 1
    public:

        uint64_t PropertyConnectedBitmask; // 0x10

    };

    struct FExpressionOutput //ScriptStruct Engine.ExpressionOutput
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName OutputName; // 0x0

    };

    struct FMaterialInput //ScriptStruct Engine.MaterialInput
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t OutputIndex; // 0x0
        struct FName ExpressionName; // 0x4

    };

    struct FColorMaterialInput : FMaterialInput //ScriptStruct Engine.ColorMaterialInput
    {
    public:


    };

    struct FScalarMaterialInput : FMaterialInput //ScriptStruct Engine.ScalarMaterialInput
    {
    public:


    };

    struct FShadingModelMaterialInput : FMaterialInput //ScriptStruct Engine.ShadingModelMaterialInput
    {
    public:


    };

    struct FVectorMaterialInput : FMaterialInput //ScriptStruct Engine.VectorMaterialInput
    {
    public:


    };

    struct FVector2MaterialInput : FMaterialInput //ScriptStruct Engine.Vector2MaterialInput
    {
    public:


    };

    struct FHitResult //ScriptStruct Engine.HitResult
    {
    //Children Prop Count (Fields): 19
    public:

        char bBlockingHit; // 0x0
        char bStartPenetrating; // 0x0
        int32_t FaceIndex; // 0x4
        float Time; // 0x8
        float Distance; // 0xc
        struct FVector_NetQuantize Location; // 0x10
        struct FVector_NetQuantize ImpactPoint; // 0x1c
        struct FVector_NetQuantizeNormal Normal; // 0x28
        struct FVector_NetQuantizeNormal ImpactNormal; // 0x34
        struct FVector_NetQuantize TraceStart; // 0x40
        struct FVector_NetQuantize TraceEnd; // 0x4c
        float PenetrationDepth; // 0x58
        int32_t item; // 0x5c
        char ElementIndex; // 0x60
        struct TWeakObjectPtr<struct UPhysicalMaterial> PhysMaterial; // 0x64
        struct TWeakObjectPtr<struct AActor> Actor; // 0x6c
        struct TWeakObjectPtr<struct UPrimitiveComponent> Component; // 0x74
        struct FName BoneName; // 0x7c
        struct FName MyBoneName; // 0x84

    };

    struct FVector_NetQuantize : FVector //ScriptStruct Engine.Vector_NetQuantize
    {
    public:


    };

    struct FVector_NetQuantizeNormal : FVector //ScriptStruct Engine.Vector_NetQuantizeNormal
    {
    public:


    };

    struct FKey //ScriptStruct InputCore.Key
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName KeyName; // 0x0

    };

    struct FBranchingPointNotifyPayload //ScriptStruct Engine.BranchingPointNotifyPayload
    {
    public:


    };

    struct FSimpleMemberReference //ScriptStruct Engine.SimpleMemberReference
    {
    //Children Prop Count (Fields): 3
    public:

        class UObject* MemberParent; // 0x0
        struct FName MemberName; // 0x8
        struct FGuid MemberGuid; // 0x10

    };

    struct FTickFunction //ScriptStruct Engine.TickFunction
    {
    //Children Prop Count (Fields): 9
    public:

        enum class ETickingGroup TickGroup; // 0x8
        enum class ETickingGroup EndTickGroup; // 0x9
        enum class ESkippableTickMode TickMode; // 0x14
        char bTickEvenWhenPaused; // 0x15
        char bCanEverTick; // 0x15
        char bEnableTickOpt; // 0x15
        char bStartWithTickEnabled; // 0x15
        char bAllowTickOnDedicatedServer; // 0x15
        float TickInterval; // 0x18

    };

    struct FActorComponentTickFunction : FTickFunction //ScriptStruct Engine.ActorComponentTickFunction
    {
    public:


    };

    struct FSubtitleCue //ScriptStruct Engine.SubtitleCue
    {
    //Children Prop Count (Fields): 2
    public:

        struct FText Text; // 0x0
        float Time; // 0x18

    };

    struct FInterpControlPoint //ScriptStruct Engine.InterpControlPoint
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector PositionControlPoint; // 0x0
        bool bPositionIsRelative; // 0xc

    };

    struct FPlatformInterfaceDelegateResult //ScriptStruct Engine.PlatformInterfaceDelegateResult
    {
    //Children Prop Count (Fields): 2
    public:

        bool bSuccessful; // 0x0
        struct FPlatformInterfaceData Data; // 0x8

    };

    struct FPlatformInterfaceData //ScriptStruct Engine.PlatformInterfaceData
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName DataName; // 0x0
        enum class EPlatformInterfaceDataType Type; // 0x8
        int32_t IntValue; // 0xc
        float FloatValue; // 0x10
        struct FString StringValue; // 0x18
        class UObject* ObjectValue; // 0x28

    };

    struct FDebugFloatHistory //ScriptStruct Engine.DebugFloatHistory
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<float> Samples; // 0x0
        float MaxSamples; // 0x10
        float MinValue; // 0x14
        float MaxValue; // 0x18
        bool bAutoAdjustMinMax; // 0x1c

    };

    struct FLatentActionInfo //ScriptStruct Engine.LatentActionInfo
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Linkage; // 0x0
        int32_t UUID; // 0x4
        struct FName ExecutionFunction; // 0x8
        class UObject* CallbackTarget; // 0x10

    };

    struct FTimerHandle //ScriptStruct Engine.TimerHandle
    {
    //Children Prop Count (Fields): 1
    public:

        uint64_t Handle; // 0x0

    };

    struct FCollisionProfileName //ScriptStruct Engine.CollisionProfileName
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Name; // 0x0

    };

    struct FGenericStruct //ScriptStruct Engine.GenericStruct
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Data; // 0x0

    };

    struct FUserActivity //ScriptStruct Engine.UserActivity
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ActionName; // 0x0

    };

    struct FFastArraySerializerItem //ScriptStruct Engine.FastArraySerializerItem
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t ReplicationID; // 0x0
        int32_t ReplicationKey; // 0x4
        int32_t MostRecentArrayReplicationKey; // 0x8

    };

    struct FActiveGameplayEffect : FFastArraySerializerItem //ScriptStruct GameplayAbilities.ActiveGameplayEffect
    {
    //Children Prop Count (Fields): 6
    public:

        struct FGameplayEffectSpec Spec; // 0x18
        struct FPredictionKey PredictionKey; // 0x2b0
        float StartServerWorldTime; // 0x2c0
        float CachedStartServerWorldTime; // 0x2c4
        float StartWorldTime; // 0x2c8
        bool bIsInhibited; // 0x2cc

    };

    struct FPredictionKey //ScriptStruct GameplayAbilities.PredictionKey
    {
    //Children Prop Count (Fields): 5
    public:

        class UPackageMap* PredictiveConnection; // 0x0
        int16_t Current; // 0x8
        int16_t Base; // 0xa
        bool bIsStale; // 0xc
        bool bIsServerInitiated; // 0xd

    };

    struct FGameplayEffectSpec //ScriptStruct GameplayAbilities.GameplayEffectSpec
    {
    //Children Prop Count (Fields): 18
    public:

        class UGameplayEffect* Def; // 0x0
        struct TArray<struct FGameplayEffectModifiedAttribute> ModifiedAttributes; // 0x8
        struct FGameplayEffectAttributeCaptureSpecContainer CapturedRelevantAttributes; // 0x18
        float Duration; // 0x50
        float Period; // 0x54
        float ChanceToApplyToTarget; // 0x58
        struct FTagContainerAggregator CapturedSourceTags; // 0x60
        struct FTagContainerAggregator CapturedTargetTags; // 0xe8
        struct FGameplayTagContainer DynamicGrantedTags; // 0x170
        struct FGameplayTagContainer DynamicAssetTags; // 0x190
        struct TArray<struct FModifierSpec> Modifiers; // 0x1b0
        int32_t StackCount; // 0x1c0
        char bCompletedSourceAttributeCapture; // 0x1c4
        char bCompletedTargetAttributeCapture; // 0x1c4
        char bDurationLocked; // 0x1c4
        struct TArray<struct FGameplayAbilitySpecDef> GrantedAbilitySpecs; // 0x1c8
        struct FGameplayEffectContextHandle EffectContext; // 0x278
        float Level; // 0x290

    };

    struct FGameplayEffectContextHandle //ScriptStruct GameplayAbilities.GameplayEffectContextHandle
    {
    public:


    };

    struct FGameplayAbilitySpecDef //ScriptStruct GameplayAbilities.GameplayAbilitySpecDef
    {
    //Children Prop Count (Fields): 6
    public:

        class UGameplayAbility* Ability; // 0x0
        struct FScalableFloat LevelScalableFloat; // 0x8
        int32_t InputID; // 0x28
        enum class EGameplayEffectGrantedAbilityRemovePolicy RemovalPolicy; // 0x2c
        class UObject* SourceObject; // 0x30
        struct FGameplayAbilitySpecHandle AssignedHandle; // 0x88

    };

    struct FGameplayAbilitySpecHandle //ScriptStruct GameplayAbilities.GameplayAbilitySpecHandle
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Handle; // 0x0

    };

    struct FScalableFloat //ScriptStruct GameplayAbilities.ScalableFloat
    {
    //Children Prop Count (Fields): 2
    public:

        float Value; // 0x0
        struct FCurveTableRowHandle Curve; // 0x8

    };

    struct FCurveTableRowHandle //ScriptStruct Engine.CurveTableRowHandle
    {
    //Children Prop Count (Fields): 2
    public:

        class UCurveTable* CurveTable; // 0x0
        struct FName RowName; // 0x8

    };

    struct FModifierSpec //ScriptStruct GameplayAbilities.ModifierSpec
    {
    //Children Prop Count (Fields): 3
    public:

        float EvaluatedMagnitude; // 0x0
        char Priority; // 0x4
        enum class EGameplayModsSelector ModsSelector; // 0x5

    };

    struct FGameplayTagContainer //ScriptStruct GameplayTags.GameplayTagContainer
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FGameplayTag> GameplayTags; // 0x0
        struct TArray<struct FGameplayTag> ParentTags; // 0x10

    };

    struct FTagContainerAggregator //ScriptStruct GameplayAbilities.TagContainerAggregator
    {
    //Children Prop Count (Fields): 3
    public:

        struct FGameplayTagContainer CapturedActorTags; // 0x0
        struct FGameplayTagContainer CapturedSpecTags; // 0x20
        struct FGameplayTagContainer ScopedTags; // 0x40

    };

    struct FGameplayEffectAttributeCaptureSpecContainer //ScriptStruct GameplayAbilities.GameplayEffectAttributeCaptureSpecContainer
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FGameplayEffectAttributeCaptureSpec> SourceAttributes; // 0x0
        struct TArray<struct FGameplayEffectAttributeCaptureSpec> TargetAttributes; // 0x10
        bool bHasNonSnapshottedAttributes; // 0x20

    };

    struct FGameplayEffectAttributeCaptureSpec //ScriptStruct GameplayAbilities.GameplayEffectAttributeCaptureSpec
    {
    //Children Prop Count (Fields): 1
    public:

        struct FGameplayEffectAttributeCaptureDefinition BackingDefinition; // 0x0

    };

    struct FGameplayEffectAttributeCaptureDefinition //ScriptStruct GameplayAbilities.GameplayEffectAttributeCaptureDefinition
    {
    //Children Prop Count (Fields): 3
    public:

        struct FGameplayAttribute AttributeToCapture; // 0x0
        enum class EGameplayEffectAttributeCaptureSource AttributeSource; // 0x38
        bool bSnapshot; // 0x39

    };

    struct FGameplayAttribute //ScriptStruct GameplayAbilities.GameplayAttribute
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString AttributeName; // 0x0
        struct TFieldPath<FProperty> Attribute; // 0x10
        class UStruct* AttributeOwner; // 0x30

    };

    struct FGameplayEffectModifiedAttribute //ScriptStruct GameplayAbilities.GameplayEffectModifiedAttribute
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGameplayAttribute Attribute; // 0x0
        float TotalMagnitude; // 0x38

    };

    struct FActiveGameplayEffectHandle //ScriptStruct GameplayAbilities.ActiveGameplayEffectHandle
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Handle; // 0x0
        bool bPassedFiltersAndWasExecuted; // 0x4

    };

    struct FGameplayEffectSpecHandle //ScriptStruct GameplayAbilities.GameplayEffectSpecHandle
    {
    public:


    };

    struct FGameplayEffectRemovalInfo //ScriptStruct GameplayAbilities.GameplayEffectRemovalInfo
    {
    //Children Prop Count (Fields): 3
    public:

        bool bPrematureRemoval; // 0x0
        int32_t StackCount; // 0x4
        struct FGameplayEffectContextHandle EffectContext; // 0x8

    };

    struct FGameplayEventData //ScriptStruct GameplayAbilities.GameplayEventData
    {
    //Children Prop Count (Fields): 10
    public:

        struct FGameplayTag EventTag; // 0x0
        class AActor* Instigator; // 0x8
        class AActor* Target; // 0x10
        class UObject* OptionalObject; // 0x18
        class UObject* OptionalObject2; // 0x20
        struct FGameplayEffectContextHandle ContextHandle; // 0x28
        struct FGameplayTagContainer InstigatorTags; // 0x40
        struct FGameplayTagContainer TargetTags; // 0x60
        float EventMagnitude; // 0x80
        struct FGameplayAbilityTargetDataHandle TargetData; // 0x88

    };

    struct FGameplayAbilityTargetDataHandle //ScriptStruct GameplayAbilities.GameplayAbilityTargetDataHandle
    {
    public:


    };

    struct FGameplayResourceSet //ScriptStruct GameplayTasks.GameplayResourceSet
    {
    public:


    };

    struct FGameplayAbilityActivationInfo //ScriptStruct GameplayAbilities.GameplayAbilityActivationInfo
    {
    //Children Prop Count (Fields): 3
    public:

        enum class EGameplayAbilityActivationMode ActivationMode; // 0x0
        char bCanBeEndedByOtherInstance; // 0x1
        struct FPredictionKey PredictionKeyWhenActivated; // 0x8

    };

    struct FGameplayEffectQuery //ScriptStruct GameplayAbilities.GameplayEffectQuery
    {
    //Children Prop Count (Fields): 7
    public:

        struct FDelegate CustomMatchDelegate_BP; // 0x10
        struct FGameplayTagQuery OwningTagQuery; // 0x20
        struct FGameplayTagQuery EffectTagQuery; // 0x68
        struct FGameplayTagQuery SourceTagQuery; // 0xb0
        struct FGameplayAttribute ModifyingAttribute; // 0xf8
        class UObject* EffectSource; // 0x130
        class UGameplayEffect* EffectDefinition; // 0x138

    };

    struct FGameplayTagQuery //ScriptStruct GameplayTags.GameplayTagQuery
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t TokenStreamVersion; // 0x0
        struct TArray<struct FGameplayTag> TagDictionary; // 0x8
        struct TArray<char> QueryTokenStream; // 0x18
        struct FString UserDescription; // 0x28
        struct FString AutoDescription; // 0x38

    };

    struct FGameplayCueParameters //ScriptStruct GameplayAbilities.GameplayCueParameters
    {
    //Children Prop Count (Fields): 16
    public:

        float NormalizedMagnitude; // 0x0
        float RawMagnitude; // 0x4
        struct FGameplayEffectContextHandle EffectContext; // 0x8
        struct FGameplayTag MatchedTagName; // 0x20
        struct FGameplayTag OriginalTag; // 0x28
        struct FGameplayTagContainer AggregatedSourceTags; // 0x30
        struct FGameplayTagContainer AggregatedTargetTags; // 0x50
        struct FVector_NetQuantize10 Location; // 0x70
        struct FVector_NetQuantizeNormal Normal; // 0x7c
        struct TWeakObjectPtr<struct AActor> Instigator; // 0x88
        struct TWeakObjectPtr<struct AActor> EffectCauser; // 0x90
        struct TWeakObjectPtr<struct UObject> SourceObject; // 0x98
        struct TWeakObjectPtr<struct UPhysicalMaterial> PhysicalMaterial; // 0xa0
        int32_t GameplayEffectLevel; // 0xa8
        int32_t AbilityLevel; // 0xac
        struct TWeakObjectPtr<struct USceneComponent> TargetAttachComponent; // 0xb0

    };

    struct FVector_NetQuantize10 : FVector //ScriptStruct Engine.Vector_NetQuantize10
    {
    public:


    };

    struct FGameplayEffectSpecForRPC //ScriptStruct GameplayAbilities.GameplayEffectSpecForRPC
    {
    //Children Prop Count (Fields): 7
    public:

        class UGameplayEffect* Def; // 0x0
        struct TArray<struct FGameplayEffectModifiedAttribute> ModifiedAttributes; // 0x8
        struct FGameplayEffectContextHandle EffectContext; // 0x18
        struct FGameplayTagContainer AggregatedSourceTags; // 0x30
        struct FGameplayTagContainer AggregatedTargetTags; // 0x50
        float Level; // 0x70
        float AbilityLevel; // 0x74

    };

    struct FServerAbilityRPCBatch //ScriptStruct GameplayAbilities.ServerAbilityRPCBatch
    {
    //Children Prop Count (Fields): 6
    public:

        struct FGameplayAbilitySpecHandle AbilitySpecHandle; // 0x0
        struct FPredictionKey PredictionKey; // 0x8
        struct FGameplayAbilityTargetDataHandle TargetData; // 0x18
        bool InputPressed; // 0x40
        bool Ended; // 0x41
        bool Started; // 0x42

    };

    struct FVector_NetQuantize100 : FVector //ScriptStruct Engine.Vector_NetQuantize100
    {
    public:


    };

    struct FFastArraySerializer //ScriptStruct Engine.FastArraySerializer
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t ArrayReplicationKey; // 0x5c
        enum class EFastArraySerializerDeltaFlags DeltaFlags; // 0x108

    };

    struct FReplicatedPredictionKeyMap : FFastArraySerializer //ScriptStruct GameplayAbilities.ReplicatedPredictionKeyMap
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FReplicatedPredictionKeyItem> PredictionKeys; // 0x118

    };

    struct FReplicatedPredictionKeyItem : FFastArraySerializerItem //ScriptStruct GameplayAbilities.ReplicatedPredictionKeyItem
    {
    //Children Prop Count (Fields): 1
    public:

        struct FPredictionKey PredictionKey; // 0x10

    };

    struct FMinimalReplicationTagCountMap //ScriptStruct GameplayAbilities.MinimalReplicationTagCountMap
    {
    //Children Prop Count (Fields): 1
    public:

        class UAbilitySystemComponent* Owner; // 0x50

    };

    struct FActiveGameplayCueContainer : FFastArraySerializer //ScriptStruct GameplayAbilities.ActiveGameplayCueContainer
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FActiveGameplayCue> GameplayCues; // 0x110
        class UAbilitySystemComponent* Owner; // 0x128

    };

    struct FActiveGameplayCue : FFastArraySerializerItem //ScriptStruct GameplayAbilities.ActiveGameplayCue
    {
    //Children Prop Count (Fields): 4
    public:

        struct FGameplayTag GameplayCueTag; // 0xc
        struct FPredictionKey PredictionKey; // 0x18
        struct FGameplayCueParameters Parameters; // 0x28
        bool bPredictivelyRemoved; // 0xe0

    };

    struct FActiveGameplayEffectsContainer : FFastArraySerializer //ScriptStruct GameplayAbilities.ActiveGameplayEffectsContainer
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FActiveGameplayEffect> GameplayEffects_Internal; // 0x138
        struct TArray<class UGameplayEffect*> ApplicationImmunityQueryEffects; // 0x4a8

    };

    struct FGameplayAbilityLocalAnimMontage //ScriptStruct GameplayAbilities.GameplayAbilityLocalAnimMontage
    {
    //Children Prop Count (Fields): 4
    public:

        class UAnimMontage* AnimMontage; // 0x0
        bool PlayBit; // 0x8
        struct FPredictionKey PredictionKey; // 0x10
        class UGameplayAbility* AnimatingAbility; // 0x20

    };

    struct FGameplayAbilityRepAnimMontage //ScriptStruct GameplayAbilities.GameplayAbilityRepAnimMontage
    {
    //Children Prop Count (Fields): 17
    public:

        class UAnimMontage* AnimMontage; // 0x0
        float PlayRate; // 0x8
        float position; // 0xc
        float BlendTime; // 0x10
        char NextSectionID; // 0x14
        char bRepPosition; // 0x15
        char IsStopped; // 0x15
        char ForcePlayBit; // 0x15
        char SkipPositionCorrection; // 0x15
        char bSkipPlayRate; // 0x15
        struct FPredictionKey PredictionKey; // 0x18
        char SectionIdToPlay; // 0x28
        char bStopAllMontages; // 0x29
        struct TArray<struct FName> SectionLoopCountKeys; // 0x30
        struct TArray<int32_t> SectionLoopCountValues; // 0x40
        char bRepStop; // 0x50
        char bRepPendingForWeapon; // 0x50

    };

    struct FGameplayAbilitySpecContainer : FFastArraySerializer //ScriptStruct GameplayAbilities.GameplayAbilitySpecContainer
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FGameplayAbilitySpec> Items; // 0x110
        class UAbilitySystemComponent* Owner; // 0x120

    };

    struct FGameplayAbilitySpec : FFastArraySerializerItem //ScriptStruct GameplayAbilities.GameplayAbilitySpec
    {
    //Children Prop Count (Fields): 17
    public:

        struct FGameplayAbilitySpecHandle Handle; // 0xc
        class UGameplayAbility* Ability; // 0x10
        int32_t Level; // 0x18
        int32_t InputID; // 0x1c
        class UObject* SourceObject; // 0x20
        char ActiveCount; // 0x28
        char InputPressed; // 0x29
        char RemoveAfterActivation; // 0x29
        char PendingRemove; // 0x29
        char bActivateOnce; // 0x29
        struct FGameplayAbilityActivationInfo ActivationInfo; // 0x30
        struct FGameplayTagContainer DynamicAbilityTags; // 0x48
        struct TArray<class UGameplayAbility*> NonReplicatedInstances; // 0x68
        struct TArray<class UGameplayAbility*> ReplicatedInstances; // 0x78
        struct FActiveGameplayEffectHandle GameplayEffectHandle; // 0x88
        char RequestCount; // 0xe0
        char MaxRequestCount; // 0xe1

    };

    struct FAttributeDefaults //ScriptStruct GameplayAbilities.AttributeDefaults
    {
    //Children Prop Count (Fields): 2
    public:

        class UAttributeSet* Attributes; // 0x0
        class UDataTable* DefaultStartingTable; // 0x8

    };

    struct FGeometry //ScriptStruct SlateCore.Geometry
    {
    public:


    };

    struct FSlateBrush //ScriptStruct SlateCore.SlateBrush
    {
    //Children Prop Count (Fields): 14
    public:

        struct FVector2D ImageSize; // 0x8
        struct FMargin Margin; // 0x10
        struct FSlateColor TintColor; // 0x20
        class UObject* ResourceObject; // 0x48
        struct FName ResourceName; // 0x50
        struct FBox2D UVRegion; // 0x58
        enum class ESlateBrushDrawType DrawAs; // 0x6c
        enum class ESlateBrushTileType Tiling; // 0x6d
        enum class ESlateBrushMirrorType Mirroring; // 0x6e
        enum class ESlateBrushImageType ImageType; // 0x6f
        char UseImageUV; // 0x70
        char IsDrawAsCircle; // 0x70
        char bIsDynamicallyLoaded; // 0x88
        char bHasUObject; // 0x88

    };

    struct FSlateColor //ScriptStruct SlateCore.SlateColor
    {
    //Children Prop Count (Fields): 2
    public:

        struct FLinearColor SpecifiedColor; // 0x0
        enum class ESlateColorStylingMode ColorUseRule; // 0x10

    };

    struct FMargin //ScriptStruct SlateCore.Margin
    {
    //Children Prop Count (Fields): 4
    public:

        float Left; // 0x0
        float Top; // 0x4
        float Right; // 0x8
        float Bottom; // 0xc

    };

    struct FEventReply //ScriptStruct UMG.EventReply
    {
    public:


    };

    struct FInputEvent //ScriptStruct SlateCore.InputEvent
    {
    public:


    };

    struct FPointerEvent : FInputEvent //ScriptStruct SlateCore.PointerEvent
    {
    public:


    };

    struct FWidgetTransform //ScriptStruct UMG.WidgetTransform
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector2D Translation; // 0x0
        struct FVector2D Scale; // 0x8
        struct FVector2D Shear; // 0x10
        float Angle; // 0x18

    };

    struct FPaintContext //ScriptStruct UMG.PaintContext
    {
    public:


    };

    struct FCharacterEvent : FInputEvent //ScriptStruct SlateCore.CharacterEvent
    {
    public:


    };

    struct FKeyEvent : FInputEvent //ScriptStruct SlateCore.KeyEvent
    {
    public:


    };

    struct FNavigationEvent : FInputEvent //ScriptStruct SlateCore.NavigationEvent
    {
    public:


    };

    struct FAnalogInputEvent : FKeyEvent //ScriptStruct SlateCore.AnalogInputEvent
    {
    public:


    };

    struct FSlateFontInfo //ScriptStruct SlateCore.SlateFontInfo
    {
    //Children Prop Count (Fields): 7
    public:

        class UObject* FontObject; // 0x0
        class UObject* FontMaterial; // 0x8
        struct FFontOutlineSettings OutlineSettings; // 0x10
        struct FName TypefaceFontName; // 0x40
        int32_t Size; // 0x48
        int32_t Size_Oversea; // 0x4c
        int32_t LetterSpacing; // 0x50

    };

    struct FFontOutlineSettings //ScriptStruct SlateCore.FontOutlineSettings
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t OutlineSize; // 0x0
        bool bSeparateFillAlpha; // 0x4
        bool bApplyOutlineToDropShadows; // 0x5
        class UObject* OutlineMaterial; // 0x8
        struct FLinearColor OutlineColor; // 0x10

    };

    struct FSlateWidgetStyle //ScriptStruct SlateCore.SlateWidgetStyle
    {
    public:


    };

    struct FTableRowStyle : FSlateWidgetStyle //ScriptStruct SlateCore.TableRowStyle
    {
    //Children Prop Count (Fields): 16
    public:

        struct FSlateBrush SelectorFocusedBrush; // 0x8
        struct FSlateBrush ActiveHoveredBrush; // 0x98
        struct FSlateBrush ActiveBrush; // 0x128
        struct FSlateBrush InactiveHoveredBrush; // 0x1b8
        struct FSlateBrush InactiveBrush; // 0x248
        struct FSlateBrush EvenRowBackgroundHoveredBrush; // 0x2d8
        struct FSlateBrush EvenRowBackgroundBrush; // 0x368
        struct FSlateBrush OddRowBackgroundHoveredBrush; // 0x3f8
        struct FSlateBrush OddRowBackgroundBrush; // 0x488
        struct FSlateColor TextColor; // 0x518
        struct FSlateColor SelectedTextColor; // 0x540
        struct FSlateBrush DropIndicator_Above; // 0x568
        struct FSlateBrush DropIndicator_Onto; // 0x5f8
        struct FSlateBrush DropIndicator_Below; // 0x688
        struct FSlateBrush ActiveHighlightedBrush; // 0x718
        struct FSlateBrush InactiveHighlightedBrush; // 0x7a8

    };

    struct FComboBoxStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ComboBoxStyle
    {
    //Children Prop Count (Fields): 3
    public:

        struct FComboButtonStyle ComboButtonStyle; // 0x8
        struct FSlateSound PressedSlateSound; // 0x3f0
        struct FSlateSound SelectionChangeSlateSound; // 0x408

    };

    struct FSlateSound //ScriptStruct SlateCore.SlateSound
    {
    //Children Prop Count (Fields): 1
    public:

        class UObject* ResourceObject; // 0x0

    };

    struct FComboButtonStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ComboButtonStyle
    {
    //Children Prop Count (Fields): 6
    public:

        struct FButtonStyle ButtonStyle; // 0x8
        struct FSlateBrush DownArrowImage; // 0x2a0
        struct FVector2D ShadowOffset; // 0x330
        struct FLinearColor ShadowColorAndOpacity; // 0x338
        struct FSlateBrush MenuBorderBrush; // 0x348
        struct FMargin MenuBorderPadding; // 0x3d8

    };

    struct FButtonStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ButtonStyle
    {
    //Children Prop Count (Fields): 8
    public:

        struct FSlateBrush Normal; // 0x8
        struct FSlateBrush Hovered; // 0x98
        struct FSlateBrush Pressed; // 0x128
        struct FSlateBrush Disabled; // 0x1b8
        struct FMargin NormalPadding; // 0x248
        struct FMargin PressedPadding; // 0x258
        struct FSlateSound PressedSlateSound; // 0x268
        struct FSlateSound HoveredSlateSound; // 0x280

    };

    struct FShapedTextOptions //ScriptStruct UMG.ShapedTextOptions
    {
    //Children Prop Count (Fields): 4
    public:

        char bOverride_TextShapingMethod; // 0x0
        char bOverride_TextFlowDirection; // 0x0
        enum class ETextShapingMethod TextShapingMethod; // 0x1
        enum class ETextFlowDirection TextFlowDirection; // 0x2

    };

    struct FVirtualKeyboardOptions //ScriptStruct Slate.VirtualKeyboardOptions
    {
    //Children Prop Count (Fields): 1
    public:

        bool bEnableAutocorrect; // 0x0

    };

    struct FEditableTextStyle : FSlateWidgetStyle //ScriptStruct SlateCore.EditableTextStyle
    {
    //Children Prop Count (Fields): 5
    public:

        struct FSlateFontInfo Font; // 0x8
        struct FSlateColor ColorAndOpacity; // 0x60
        struct FSlateBrush BackgroundImageSelected; // 0x88
        struct FSlateBrush BackgroundImageComposing; // 0x118
        struct FSlateBrush CaretImage; // 0x1a8

    };

    struct FEditableTextBoxStyle : FSlateWidgetStyle //ScriptStruct SlateCore.EditableTextBoxStyle
    {
    //Children Prop Count (Fields): 12
    public:

        struct FSlateBrush BackgroundImageNormal; // 0x8
        struct FSlateBrush BackgroundImageHovered; // 0x98
        struct FSlateBrush BackgroundImageFocused; // 0x128
        struct FSlateBrush BackgroundImageReadOnly; // 0x1b8
        struct FMargin Padding; // 0x248
        struct FSlateFontInfo Font; // 0x258
        struct FSlateColor ForegroundColor; // 0x2b0
        struct FSlateColor BackgroundColor; // 0x2d8
        struct FSlateColor ReadOnlyForegroundColor; // 0x300
        struct FMargin HScrollBarPadding; // 0x328
        struct FMargin VScrollBarPadding; // 0x338
        struct FScrollBarStyle ScrollBarStyle; // 0x348

    };

    struct FScrollBarStyle : FSlateWidgetStyle //ScriptStruct SlateCore.ScrollBarStyle
    {
    //Children Prop Count (Fields): 9
    public:

        struct FSlateBrush HorizontalBackgroundImage; // 0x8
        struct FSlateBrush VerticalBackgroundImage; // 0x98
        struct FSlateBrush VerticalTopSlotImage; // 0x128
        struct FSlateBrush HorizontalTopSlotImage; // 0x1b8
        struct FSlateBrush VerticalBottomSlotImage; // 0x248
        struct FSlateBrush HorizontalBottomSlotImage; // 0x2d8
        struct FSlateBrush NormalThumbImage; // 0x368
        struct FSlateBrush HoveredThumbImage; // 0x3f8
        struct FSlateBrush DraggedThumbImage; // 0x488

    };

    struct FInputChord //ScriptStruct Slate.InputChord
    {
    //Children Prop Count (Fields): 5
    public:

        struct FKey Key; // 0x0
        char bShift; // 0x18
        char bCtrl; // 0x18
        char bAlt; // 0x18
        char bCmd; // 0x18

    };

    struct FTextBlockStyle : FSlateWidgetStyle //ScriptStruct SlateCore.TextBlockStyle
    {
    //Children Prop Count (Fields): 9
    public:

        struct FSlateFontInfo Font; // 0x8
        struct FSlateColor ColorAndOpacity; // 0x60
        struct FVector2D ShadowOffset; // 0x88
        struct FLinearColor ShadowColorAndOpacity; // 0x90
        struct FSlateColor SelectedBackgroundColor; // 0xa0
        struct FLinearColor HighlightColor; // 0xc8
        struct FSlateBrush HighlightShape; // 0xd8
        struct FSlateBrush StrikeBrush; // 0x168
        struct FSlateBrush UnderlineBrush; // 0x1f8

    };

    struct FSpinBoxStyle : FSlateWidgetStyle //ScriptStruct SlateCore.SpinBoxStyle
    {
    //Children Prop Count (Fields): 7
    public:

        struct FSlateBrush BackgroundBrush; // 0x8
        struct FSlateBrush HoveredBackgroundBrush; // 0x98
        struct FSlateBrush ActiveFillBrush; // 0x128
        struct FSlateBrush InactiveFillBrush; // 0x1b8
        struct FSlateBrush ArrowsImage; // 0x248
        struct FSlateColor ForegroundColor; // 0x2d8
        struct FMargin TextPadding; // 0x300

    };

    struct FAnchors //ScriptStruct Slate.Anchors
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector2D Minimum; // 0x0
        struct FVector2D Maximum; // 0x8

    };

    struct FFocusEvent //ScriptStruct SlateCore.FocusEvent
    {
    public:


    };

    struct FMotionEvent : FInputEvent //ScriptStruct SlateCore.MotionEvent
    {
    public:


    };

    struct FAnimationEventBinding //ScriptStruct UMG.AnimationEventBinding
    {
    //Children Prop Count (Fields): 4
    public:

        class UWidgetAnimation* Animation; // 0x0
        struct FDelegate Delegate; // 0x8
        enum class EWidgetAnimationEvent AnimationEvent; // 0x18
        struct FName UserTag; // 0x1c

    };

    struct FNamedSlotBinding //ScriptStruct UMG.NamedSlotBinding
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Name; // 0x0
        class UWidget* Content; // 0x8

    };

    struct FMSDKNoticeReturnData //ScriptStruct MFPluginWrapper.MSDKNoticeReturnData
    {
    //Children Prop Count (Fields): 8
    public:

        int32_t MethodNameID; // 0x0
        int32_t RetCode; // 0x4
        struct FString RetMsg; // 0x8
        int32_t ThirdCode; // 0x18
        struct FString ThirdMsg; // 0x20
        struct FString extraJson; // 0x30
        struct FString RequestID; // 0x40
        struct TArray<struct FMSDKNoticeInfo> NoticeInfoList; // 0x50

    };

    struct FMSDKNoticeInfo //ScriptStruct MFPluginWrapper.MSDKNoticeInfo
    {
    //Children Prop Count (Fields): 13
    public:

        int32_t NoticeID; // 0x0
        int32_t NoticeType; // 0x4
        struct FString NoticeGroup; // 0x8
        int32_t BeginTime; // 0x18
        int32_t EndTime; // 0x1c
        int32_t UpdateTime; // 0x20
        int32_t Order; // 0x24
        int32_t ContentType; // 0x28
        struct FString Language; // 0x30
        struct FMSDKNoticeTextInfo TextInfo; // 0x40
        struct TArray<struct FMSDKNoticePictureInfo> PicUrlList; // 0x70
        struct FString WebUrl; // 0x80
        struct FString extraJson; // 0x90

    };

    struct FMSDKNoticePictureInfo //ScriptStruct MFPluginWrapper.MSDKNoticePictureInfo
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString NoticePicUrl; // 0x0
        struct FString NoticePicHashcode; // 0x10
        struct FString NoticePicTitle; // 0x20
        struct FString NoticePicSize; // 0x30
        int32_t ScreenDir; // 0x40

    };

    struct FMSDKNoticeTextInfo //ScriptStruct MFPluginWrapper.MSDKNoticeTextInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString NoticeTitle; // 0x0
        struct FString NoticeContent; // 0x10
        struct FString NoticeRedirectUrl; // 0x20

    };

    struct FMFClimateLightningEvent //ScriptStruct MFClimateRuntime.MFClimateLightningEvent
    {
    //Children Prop Count (Fields): 5
    public:

        bool bForceRejectPrevious; // 0x0
        struct FVector StartPosition; // 0x4
        struct FVector EndPosition; // 0x10
        float NormalizedReturnStrikeEnergy; // 0x1c
        int32_t ReStrikeCount; // 0x20

    };

    struct FMFEnvBurnBlockBound //ScriptStruct MFEnvironment.MFEnvBurnBlockBound
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector CenterPos; // 0x0
        int16_t RotYaw; // 0xc
        char Extent; // 0xe

    };

    struct FItemGridInfo //ScriptStruct SGFramework.ItemGridInfo
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Row; // 0x0
        int32_t Column; // 0x4

    };

    struct FInventoryAnimPoseInfo //ScriptStruct SGFramework.InventoryAnimPoseInfo
    {
    //Children Prop Count (Fields): 3
    public:

        bool bHasInitialized; // 0x0
        class UAnimMontage* AnimMontage; // 0x8
        float PositionToStay; // 0x10

    };

    struct FSGSwitchWeaponIntent //ScriptStruct SGFramework.SGSwitchWeaponIntent
    {
    //Children Prop Count (Fields): 6
    public:

        int32_t PredKey; // 0x0
        bool bConfirmedByServer; // 0x4
        bool bTakeUpWeapon; // 0x5
        class ASGWeapon* DestWeap; // 0x8
        float FinishTimeStamp; // 0x10
        enum class ESwitchWeaponIntentRejectReason RejectReason; // 0x14

    };

    struct FDamageEvent //ScriptStruct Engine.DamageEvent
    {
    //Children Prop Count (Fields): 1
    public:

        class UDamageType* DamageTypeClass; // 0x8

    };

    struct FPointDamageEvent : FDamageEvent //ScriptStruct Engine.PointDamageEvent
    {
    //Children Prop Count (Fields): 3
    public:

        float Damage; // 0x10
        struct FVector_NetQuantizeNormal ShotDirection; // 0x14
        struct FHitResult HitInfo; // 0x20

    };

    struct FSGPointDamageEvent : FPointDamageEvent //ScriptStruct SGFramework.SGPointDamageEvent
    {
    //Children Prop Count (Fields): 15
    public:

        enum class EDamageTypeEnum DamageTypeEnum; // 0xb8
        struct FSGBulletID BulletID; // 0xc0
        float Impulse; // 0xd0
        enum class EHitGroupType HitGroup; // 0xd4
        class AActor* AmmoClass; // 0xd8
        enum class EHeadHitSubGroupType HeadHitSubGroup; // 0xe0
        enum class ESGZoomType CaptureWeaponZoomType; // 0xe1
        char FireModeNum; // 0xe2
        char HitFlags; // 0xe3
        bool bIsBestHit; // 0xe4
        struct TArray<struct FVector> ImportantLocations; // 0xe8
        struct FBulletInfo BulletInfo; // 0xf8
        class ASGInventory* HitMovableArmor; // 0x118
        bool bTakerIsCrouch; // 0x120
        bool bTakerIsProne; // 0x121

    };

    struct FBulletInfo //ScriptStruct SGFramework.BulletInfo
    {
    //Children Prop Count (Fields): 6
    public:

        float CurSpeed; // 0x0
        float DropDistance; // 0x4
        struct FVector SpawnLocation; // 0x8
        float FlyDistance; // 0x14
        float FlyTime; // 0x18
        float DamageScale; // 0x1c

    };

    struct FSGBulletID //ScriptStruct SGFramework.SGBulletID
    {
    //Children Prop Count (Fields): 2
    public:

        int64_t FireID; // 0x0
        char ShotIndex; // 0x8

    };

    struct FTakeDamageInfo //ScriptStruct SGFramework.TakeDamageInfo
    {
    //Children Prop Count (Fields): 8
    public:

        class AController* CauserController; // 0x0
        class AController* VictimController; // 0x8
        class APawn* CauserPawn; // 0x10
        class APawn* VictimPawn; // 0x18
        class AActor* CauserWeapon; // 0x20
        float AttemptedDamage; // 0x28
        float ActuralDamage; // 0x2c
        class UDamageEventObject* DamageEventObject; // 0x30

    };

    struct FKillOtherStatis //ScriptStruct SGFramework.KillOtherStatis
    {
    //Children Prop Count (Fields): 4
    public:

        float AllDamage; // 0x0
        int32_t HitCount; // 0x4
        float AllArmorReduceDamage; // 0x8
        int64_t ArmorId; // 0x10

    };

    struct FKillInfo //ScriptStruct SGFramework.KillInfo
    {
    //Children Prop Count (Fields): 15
    public:

        class AController* KillerController; // 0x0
        class AController* KilledController; // 0x8
        class APawn* KillerPawn; // 0x10
        class APawn* KilledPawn; // 0x18
        class AActor* KillerWeapon; // 0x20
        class UDamageEventObject* DamageEventObject; // 0x28
        int64_t KillerWeaponId; // 0x30
        int64_t KilledWeaponId; // 0x38
        int32_t KillerBulletPenetrateFactor; // 0x40
        int32_t KilledBulletPenetrateFactor; // 0x44
        int32_t KillDistance; // 0x48
        bool bDBNO; // 0x4c
        bool bHitArmor; // 0x4d
        bool bPenetrateArmor; // 0x4e
        enum class ECharacterEnduranceType EnduranceType; // 0x4f

    };

    struct FCharacterDeathStatics //ScriptStruct SGFramework.CharacterDeathStatics
    {
    //Children Prop Count (Fields): 57
    public:

        int32_t DeathReason; // 0x0
        int64_t WeaponId; // 0x8
        float Distance; // 0x10
        int32_t EnduranceType; // 0x14
        int32_t SpreadEnduranceType; // 0x18
        int64_t DeathCauserId; // 0x20
        float Damage; // 0x28
        int32_t bPenetrateArmor; // 0x2c
        float PenetrateArmorProbability; // 0x30
        struct FString CauserName; // 0x38
        int64_t DeathTime; // 0x48
        struct FVector HitLocationDireciton; // 0x50
        int64_t HitArmorId; // 0x60
        int32_t TeamTypeId; // 0x68
        int32_t TeamID; // 0x6c
        enum class EFactionType FactionType; // 0x70
        int32_t KillerTeamTypeId; // 0x74
        enum class EFactionType KillerFactionType; // 0x78
        int8_t bHitFace; // 0x79
        int8_t bDiedFromDBNO; // 0x7a
        uint64_t DBNOGID; // 0x80
        int32_t CurrentArmorDurability; // 0x88
        int32_t CurrentArmorDurabilityMax; // 0x8c
        int32_t DetailBodyPart; // 0x90
        float LastHitDamage; // 0x94
        float LastHitArmorDamage; // 0x98
        float Endurance; // 0x9c
        int32_t MainWeapon; // 0xa0
        int32_t AssistWeapon; // 0xa4
        float AliveTime; // 0xa8
        struct FVector DeathPos; // 0xac
        struct FVector KillerPos; // 0xb8
        int32_t KillerLevel; // 0xc4
        int32_t KillerRankLevel; // 0xc8
        uint64_t KillerID; // 0xd0
        int32_t KillerTeamId; // 0xd8
        struct FString SightName; // 0xe0
        class ACharacter* Killer; // 0xf0
        int32_t HitGroup; // 0xf8
        int32_t HitSubHeadPart; // 0xfc
        int64_t LastAimEnemyGID; // 0x100
        int32_t LastAimEnemyCauseDamage; // 0x108
        int32_t LastAimEnemyCauseArmorReduceDamage; // 0x10c
        int64_t DeathVestID; // 0x110
        int64_t DeathHelmetID; // 0x118
        int64_t DeathFaceShieldID; // 0x120
        int64_t KillerVestID; // 0x128
        int64_t KillerHelmetID; // 0x130
        int64_t KillerFaceShieldID; // 0x138
        int32_t KillerWeaponValue; // 0x140
        int32_t CauseDBNOWeaponID; // 0x144
        class USGPlayerItemInfoBase* KillerWeaponItemInfo; // 0x148
        int32_t OnFlash; // 0x150
        int32_t ByHoldGrenade; // 0x154
        int32_t KillerNetGUIDForReplay; // 0x158
        int32_t OnInventoryFlash; // 0x15c
        int32_t OnTinnitus; // 0x160

    };

    struct FTableRowBase //ScriptStruct Engine.TableRowBase
    {
    public:


    };

    struct FContextMenuSlotType : FTableRowBase //ScriptStruct SGFramework.ContextMenuSlotType
    {
    //Children Prop Count (Fields): 1
    public:

        enum class ESlotEnum SlotType; // 0x8

    };

    struct FInventoryGridInfo //ScriptStruct SGFramework.InventoryGridInfo
    {
    //Children Prop Count (Fields): 9
    public:

        class AActor* OwnerActor; // 0x0
        class AActor* ParentActor; // 0x8
        enum class ESGInventoryParentType ParentType; // 0x10
        struct FItemGridInfo GridInfo; // 0x14
        struct FItemGridInfo StartGridPosition; // 0x1c
        int32_t ContainerIndex; // 0x2c
        enum class EAttachPosition AttachPosition; // 0x30
        bool IsRotated; // 0x31
        uint64_t ServerFrameCounter; // 0x38

    };

    struct FAutoAimAntiHackStatis //ScriptStruct SGFramework.AutoAimAntiHackStatis
    {
    //Children Prop Count (Fields): 2
    public:

        float MaxRange; // 0x0
        float MaxAngularSpeed; // 0x4

    };

    struct FSGFireRepInfo //ScriptStruct SGFramework.SGFireRepInfo
    {
    //Children Prop Count (Fields): 12
    public:

        int64_t FireID; // 0x0
        float Timestamp; // 0x8
        struct FSGFireShots Shots; // 0x10
        class AActor* AmmoClass; // 0x38
        char FireMode; // 0x40
        struct FVector AttackerPos; // 0x44
        float ExpiredTimeOnServer; // 0x50
        char CurFOV; // 0x54
        char FireIntervalShotNum; // 0x55
        bool bIsReadyForNextFire; // 0x56
        bool bIsWeaponCollapsed; // 0x57
        class ASGThrowableProjectile* ProjcetileClass; // 0x58

    };

    struct FSGFireShots //ScriptStruct SGFramework.SGFireShots
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector LaunchLocation; // 0x0
        struct FVector ShotLocation; // 0xc
        struct TArray<struct FSGBulletPath> BulletPaths; // 0x18

    };

    struct FSGBulletPath //ScriptStruct SGFramework.SGBulletPath
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector InitDirection; // 0x0
        struct TArray<struct FSGPointDamageEvent> PathPoints; // 0x10

    };

    struct FNavSkeletonGraphFindResult //ScriptStruct MFNPCAI.NavSkeletonGraphFindResult
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EGraphAStarResult status; // 0x0
        struct TArray<struct FNavSkeletonGraphResultNode> Nodes; // 0x8
        struct TArray<int32_t> DesiredNodeIndices; // 0x18
        struct TArray<int32_t> DesiredPointIDs; // 0x28

    };

    struct FNavSkeletonGraphResultNode //ScriptStruct MFNPCAI.NavSkeletonGraphResultNode
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t PointID; // 0x0
        int32_t ParentID; // 0x4
        float PathLength; // 0x8

    };

    struct FNPCAIQueryRoundEnvironmentResult //ScriptStruct MFNPCAI.NPCAIQueryRoundEnvironmentResult
    {
    //Children Prop Count (Fields): 14
    public:

        struct FVector AILocation; // 0x0
        struct FVector EnemyLocation; // 0xc
        bool LCanMove; // 0x18
        struct FVector LMovePoint; // 0x1c
        bool RCanMove; // 0x28
        struct FVector RMovePoint; // 0x2c
        bool FCanMove; // 0x38
        struct FVector FMovePoint; // 0x3c
        bool BCanMove; // 0x48
        struct FVector BMovePoint; // 0x4c
        bool LCanDefense; // 0x58
        bool RCanDefense; // 0x59
        bool LCanAttack; // 0x5a
        bool RCanAttack; // 0x5b

    };

    struct FNPCAIFindAmbushAgainstPointResult //ScriptStruct MFNPCAI.NPCAIFindAmbushAgainstPointResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector AgainstPoint; // 0x0
        bool bCanFind; // 0xc

    };

    struct FNPCAIFindPathByKeyRouteResult //ScriptStruct MFNPCAI.NPCAIFindPathByKeyRouteResult
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FKeyRoutePointData> Path; // 0x0

    };

    struct FActionPointData //ScriptStruct AIActionPointGeneratorRuntime.ActionPointData
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t UniqueIndex; // 0x0
        struct FVector Location; // 0x4

    };

    struct FKeyRoutePointData : FActionPointData //ScriptStruct AIActionPointGeneratorRuntime.KeyRoutePointData
    {
    //Children Prop Count (Fields): 9
    public:

        int32_t PointID; // 0x10
        float Radius; // 0x14
        float MaxNavPathForMultipleOfRadius; // 0x18
        struct TArray<struct FKeyRoutePointLink> LinkPoints; // 0x20
        struct TArray<struct FActionPointRadianSafe> OrientSafetys; // 0x30
        float DangerValue; // 0x40
        float CalculateDangerTime; // 0x44
        int64_t PolyRef; // 0x48
        struct TArray<int64_t> NeighborPolyRefs; // 0x50

    };

    struct FActionPointRadianSafe //ScriptStruct AIActionPointGeneratorRuntime.ActionPointRadianSafe
    {
    //Children Prop Count (Fields): 2
    public:

        float Radian; // 0x0
        float CoverDistance; // 0x4

    };

    struct FKeyRoutePointLink //ScriptStruct AIActionPointGeneratorRuntime.KeyRoutePointLink
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Index; // 0x0
        float NavPathLength; // 0x4

    };

    struct FNPCAIPeekPointResult //ScriptStruct MFNPCAI.NPCAIPeekPointResult
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector PeekPoint; // 0x0
        bool bWillExpose; // 0xc

    };

    struct FCompetitionOBGlobalDataInfo //ScriptStruct SGFramework.CompetitionOBGlobalDataInfo
    {
    //Children Prop Count (Fields): 3
    public:

        uint32_t LeftPMCNumber; // 0x0
        uint32_t LeftScavNumber; // 0x4
        struct TArray<struct FCompetitionTeamDataInfo> AllTeamInfoList; // 0x8

    };

    struct FCompetitionTeamDataInfo //ScriptStruct SGFramework.CompetitionTeamDataInfo
    {
    //Children Prop Count (Fields): 3
    public:

        uint32_t TeamID; // 0x0
        struct FText TeamName; // 0x8
        struct TArray<struct FCompetitionGamePlayerDataInfo> AllPlayerList; // 0x20

    };

    struct FCompetitionGamePlayerDataInfo //ScriptStruct SGFramework.CompetitionGamePlayerDataInfo
    {
    //Children Prop Count (Fields): 13
    public:

        class ASGPlayerController* PC; // 0x0
        class APlayerState* PS; // 0x8
        uint64_t GID; // 0x10
        struct FString PlayerName; // 0x18
        uint32_t PlayerKillNum; // 0x28
        float PlayerCurAllEndurance; // 0x2c
        float PlayerCurAllEnduranceMax; // 0x30
        int64_t PlayerTakeOutAllValue; // 0x38
        enum class ESGPlayerCondition PlayerResult; // 0x40
        struct FVector PlayerPosition; // 0x44
        uint32_t KillPlayerNum; // 0x50
        uint32_t KillScavNum; // 0x54
        uint32_t KillBossNum; // 0x58

    };

    struct FCompetitionPlayerFallReportData //ScriptStruct SGFramework.CompetitionPlayerFallReportData
    {
    //Children Prop Count (Fields): 10
    public:

        int32_t KillerTeamId; // 0x0
        int32_t KillerTeamIndex; // 0x4
        struct FString KillerPlayerName; // 0x8
        uint64_t KillerPlayerWeaponID; // 0x18
        int32_t KilledTeamId; // 0x20
        int32_t KilledTeamIndex; // 0x24
        struct FString KilledPlayerName; // 0x28
        bool BTeamAce; // 0x38
        enum class ECharacterType KilledCharacterType; // 0x39
        enum class ESGPlayerFailCondition FallResult; // 0x3a

    };

    struct FCompetitionEscapeReportData //ScriptStruct SGFramework.CompetitionEscapeReportData
    {
    //Children Prop Count (Fields): 4
    public:

        uint32_t EscapePlayerTeamId; // 0x0
        uint32_t EscapePlayerTeamIndex; // 0x4
        struct FString EscapePlayerName; // 0x8
        int32_t EscapePointID; // 0x18

    };

    struct FAPIPlayerStaticInfo //ScriptStruct SGFramework.APIPlayerStaticInfo
    {
    //Children Prop Count (Fields): 4
    public:

        uint64_t GID; // 0x0
        uint32_t TeamID; // 0x8
        uint32_t TeamIndex; // 0xc
        struct FString TeamName; // 0x10

    };

    struct FAPIReportInfo //ScriptStruct SGFramework.APIReportInfo
    {
    //Children Prop Count (Fields): 4
    public:

        uint64_t GID; // 0x0
        enum class EAPIReportTypes ReportType; // 0x8
        struct FCompetitionKillInfo KillInfo; // 0x10
        uint32_t ItemID; // 0x68

    };

    struct FCompetitionKillInfo //ScriptStruct SGFramework.CompetitionKillInfo
    {
    //Children Prop Count (Fields): 14
    public:

        uint64_t KilledGid; // 0x0
        struct FString KilledName; // 0x8
        enum class EPlayerTeamType KilledPlayerType; // 0x18
        uint32_t RankedLevel; // 0x1c
        uint32_t Score; // 0x20
        uint32_t Level; // 0x24
        uint32_t KilledTime; // 0x28
        uint64_t KillWeaponId; // 0x30
        enum class ECharacterEnduranceType KillPart; // 0x38
        int32_t KillAllDamage; // 0x3c
        int32_t KillAllArmorDamage; // 0x40
        int32_t HitNum; // 0x44
        int64_t ArmorId; // 0x48
        enum class ECharacterType PlayerTypeDetail; // 0x50

    };

    struct FInventoryContainerBase //ScriptStruct SGFramework.InventoryContainerBase
    {
    //Children Prop Count (Fields): 7
    public:

        int32_t RowNum; // 0x0
        int32_t ColumnNum; // 0x4
        int32_t RuleID; // 0x8
        struct TArray<struct FSGBagGridInfo> GridList; // 0x10
        int32_t ContainerIndex; // 0x20
        struct TArray<class AActor*> ChildActorList; // 0x28
        class ASGInventory* Inventory; // 0x38

    };

    struct FSGBagGridInfo //ScriptStruct SGFramework.SGBagGridInfo
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t ItemID; // 0x0
        class AActor* Inventory; // 0x8

    };

    struct FMFMissionReplicateData //ScriptStruct MFMission.MFMissionReplicateData
    {
    //Children Prop Count (Fields): 14
    public:

        class AActor* Instigator; // 0x0
        struct FString MissionName; // 0x8
        struct FString MissionFlowName; // 0x18
        enum class EMissionStatus MissionStatus; // 0x28
        enum class EMissionStatus OldMissionStatus; // 0x29
        int32_t OldProgress; // 0x2c
        int32_t CurProgress; // 0x30
        float RemainTime; // 0x34
        float RemainTimeUpdateServerTime; // 0x38
        bool bFailWhenAchieved; // 0x3c
        bool bNeedReport; // 0x3d
        bool bNeedReportProgress; // 0x3e
        struct TArray<struct FString> AffiliateMissionList; // 0x40
        bool bValid; // 0x50

    };

    struct FMobileInputData //ScriptStruct SGFramework.MobileInputData
    {
    //Children Prop Count (Fields): 15
    public:

        enum class ETouchIndex FingerIndex; // 0x0
        enum class EMobileInputPhase Phase; // 0x1
        struct FVector2D BeginLocation; // 0x4
        struct FVector2D Location; // 0xc
        struct FVector2D LastLocation; // 0x14
        struct FVector2D LastFrameLocation; // 0x1c
        float BeginTime; // 0x24
        float UpdateTime; // 0x28
        float ForceValue; // 0x2c
        struct FVector2D DeltaLocation; // 0x30
        float DeltaLocationX; // 0x38
        float DeltaLocationY; // 0x3c
        int32_t SampleCount; // 0x40
        bool bIgnore; // 0x44
        bool bPendingDelete; // 0x45

    };

    struct FFootStepMakerTriggerEventTlog //ScriptStruct SGFramework.FootStepMakerTriggerEventTlog
    {
    //Children Prop Count (Fields): 7
    public:

        float PosX; // 0x0
        float PosY; // 0x4
        float PosZ; // 0x8
        uint64_t GID; // 0x10
        uint32_t RoleType; // 0x18
        int32_t VestLv; // 0x1c
        int32_t HelmetLv; // 0x20

    };

    struct FForceScoreInfo //ScriptStruct SGFramework.ForceScoreInfo
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t ForceIndex; // 0x0
        struct FString ForceName; // 0x8
        enum class EFactionType FactionType; // 0x18
        int32_t Score; // 0x1c
        struct FForceProgressInfo ProgressInfo; // 0x20

    };

    struct FForceProgressInfo //ScriptStruct SGFramework.ForceProgressInfo
    {
    //Children Prop Count (Fields): 4
    public:

        struct FDateTime ServerStartTimeStamp; // 0x0
        float InitProgress; // 0x8
        float MaxProgress; // 0xc
        float ProgressTime; // 0x10

    };

    struct FSGLoadingInfo //ScriptStruct SGFramework.SGLoadingInfo
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString MapTag; // 0x0
        struct FString PreMapTag; // 0x10
        bool bUsePostLoading; // 0x20
        struct TArray<struct FString> LoadingPathArray; // 0x28
        int32_t CurrentMovieIndex; // 0x38

    };

    struct FURL //ScriptStruct Engine.URL
    {
    //Children Prop Count (Fields): 8
    public:

        struct FString Protocol; // 0x0
        struct FString Host; // 0x10
        int32_t Port; // 0x20
        int32_t Valid; // 0x24
        struct FString Map; // 0x28
        struct FString RedirectURL; // 0x38
        struct TArray<struct FString> Op; // 0x48
        struct FString Portal; // 0x58

    };

    struct FVehicleHitInfo //ScriptStruct SGFramework.VehicleHitInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString HitTypeName; // 0x0
        float HitVelocity; // 0x10
        float DamageValue; // 0x14

    };

    struct FCachedDeadCharacterInfo //ScriptStruct SGFramework.CachedDeadCharacterInfo
    {
    //Children Prop Count (Fields): 14
    public:

        int64_t DeadCharacterGID; // 0x0
        int32_t channelType; // 0x8
        int32_t PlatId; // 0xc
        int32_t PlayerLevel; // 0x10
        int32_t RankLevel; // 0x14
        int32_t CurSeason_ID; // 0x18
        enum class ECharacterType DeadCharacterType; // 0x1c
        int32_t DeadCharacterTeamID; // 0x20
        uint32_t Area_ID; // 0x24
        int32_t TeamType; // 0x28
        int64_t KillerCharacterGID; // 0x30
        enum class ECharacterType KillerCharacterType; // 0x38
        int32_t EnterDsZone; // 0x3c
        int32_t IdealDsZone; // 0x40

    };

    struct FStackableItemSourceInfo //ScriptStruct SGFramework.StackableItemSourceInfo
    {
    //Children Prop Count (Fields): 5
    public:

        int64_t FromPlayerGID; // 0x0
        int32_t FromTeamIndex; // 0x8
        int32_t Count; // 0xc
        enum class ECharacterType FromCharacterType; // 0x10
        enum class ESGInventorySpawnSourceType FromSpawnSourceType; // 0x11

    };

    struct FProgressAbilitySimulationInfo //ScriptStruct SGFramework.ProgressAbilitySimulationInfo
    {
    //Children Prop Count (Fields): 6
    public:

        enum class ESGSimulatedProgressAbilityType Type; // 0x0
        class ASGInventory* TargetInv; // 0x8
        class AActor* OptionalActor1; // 0x10
        float ProgressStartServerTimeStamp; // 0x18
        float Duration; // 0x1c
        float Magnitude; // 0x20

    };

    struct FCharacterLootBoxExternalData //ScriptStruct SGFramework.CharacterLootBoxExternalData
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t LootPointID; // 0x0

    };

    struct FCharacterLootBoxItemExternalData //ScriptStruct SGFramework.CharacterLootBoxItemExternalData
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t LootPointID; // 0x0
        int32_t LootItemID; // 0x4

    };

    struct FKillerStaticData //ScriptStruct SGFramework.KillerStaticData
    {
    //Children Prop Count (Fields): 23
    public:

        struct FString KillerName; // 0x0
        int64_t KillerWeaponId; // 0x10
        struct FSGPlayerIconInfo KillerIconInfo; // 0x18
        uint32_t KillerRankrd; // 0x60
        uint32_t KillerRankScore; // 0x64
        uint32_t KillerRank; // 0x68
        uint32_t KillerRanking; // 0x6c
        uint32_t KillerPranking; // 0x70
        uint64_t KillerGID; // 0x78
        int32_t KillerTeamTypeId; // 0x80
        int32_t KillerTeamId; // 0x84
        struct FVector KillerPos; // 0x88
        struct FString SightName; // 0x98
        int64_t KillerVestID; // 0xa8
        int64_t KillerHelmetID; // 0xb0
        int64_t KillerFaceShieldID; // 0xb8
        int32_t KillerWeaponValue; // 0xc0
        bool bIsAICharacter; // 0xc4
        struct TArray<struct FCharacterHealthStaticsWhenDead> AllHealthStatics; // 0xc8
        class USGPlayerItemInfoBase* PlayerItemInfo; // 0xd8
        struct TArray<struct FSGClientShowItemInfo> KillerWeapon; // 0xe0
        struct FSGPlayerShowInfo PlayerShowInfo; // 0xf0
        int32_t KillerNetGUIDForReplay; // 0x130

    };

    struct FSGPlayerShowInfo //ScriptStruct SGFramework.SGPlayerShowInfo
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FSGClientShowItemInfo> ClientShowItems; // 0x0
        enum class ECharacterSex AvatarGender; // 0x10
        struct TArray<struct FSGAvatarInfo> AvatarItems; // 0x18
        uint32_t bBodyStatus; // 0x28
        struct TArray<struct FSGBadgeInfo> BadgeItems; // 0x30

    };

    struct FSGBadgeInfo //ScriptStruct SGFramework.SGBadgeInfo
    {
    //Children Prop Count (Fields): 2
    public:

        uint64_t ItemID; // 0x0
        uint32_t Index; // 0x8

    };

    struct FSGAvatarInfo //ScriptStruct SGFramework.SGAvatarInfo
    {
    //Children Prop Count (Fields): 3
    public:

        uint64_t ItemID; // 0x0
        bool EnableState; // 0x8
        bool bIsHeadAvatar; // 0x9

    };

    struct FSGClientShowItemInfo //ScriptStruct SGFramework.SGClientShowItemInfo
    {
    //Children Prop Count (Fields): 13
    public:

        uint64_t GID; // 0x0
        uint64_t ItemID; // 0x8
        uint32_t ItemNum; // 0x10
        uint64_t ParentID; // 0x18
        uint32_t Index; // 0x20
        uint32_t PosX; // 0x24
        uint32_t PosY; // 0x28
        bool bRollUp; // 0x2c
        bool bDisable; // 0x2d
        uint32_t PendantID; // 0x30
        uint32_t SprayID; // 0x34
        uint32_t Durability; // 0x38
        uint32_t MaxDurability; // 0x3c

    };

    struct FCharacterHealthStaticsWhenDead //ScriptStruct SGFramework.CharacterHealthStaticsWhenDead
    {
    //Children Prop Count (Fields): 5
    public:

        int64_t PlayerId; // 0x0
        int32_t EnduranceType; // 0x8
        float Health; // 0xc
        float MaxHealth; // 0x10
        struct TArray<int32_t> BuffList; // 0x18

    };

    struct FSGPlayerIconInfo //ScriptStruct SGFramework.SGPlayerIconInfo
    {
    //Children Prop Count (Fields): 7
    public:

        struct FString Name; // 0x0
        int32_t Level; // 0x10
        int32_t Rank; // 0x14
        struct FSGPlayerTitleInfo TitleInfo; // 0x18
        struct FString AvatarUrl; // 0x30
        int32_t HeadBoxID; // 0x40
        int32_t NameCard; // 0x44

    };

    struct FSGPlayerTitleInfo //ScriptStruct SGFramework.SGPlayerTitleInfo
    {
    //Children Prop Count (Fields): 6
    public:

        uint32_t ItemID; // 0x0
        bool HasTitle; // 0x4
        uint32_t StarNum; // 0x8
        uint32_t Rank; // 0xc
        uint32_t ADCode; // 0x10
        uint32_t LBSRankLevel; // 0x14

    };

    struct FMFMissionFlowNodeInstanceData //ScriptStruct MFMission.MFMissionFlowNodeInstanceData
    {
    //Children Prop Count (Fields): 18
    public:

        class AActor* Instigator; // 0x0
        class UMFMissionFlowNode* MissionFlowNode; // 0x8
        enum class EMissionFlowNodeStatus NodeStatus; // 0x10
        class UMFMissionObjective* Objective; // 0x18
        enum class EMissionStatus MissionStatus; // 0x20
        int32_t InitialProgress; // 0x24
        int32_t OldProgress; // 0x28
        int32_t CurProgress; // 0x2c
        int32_t BeginProgress; // 0x30
        int32_t EndProgress; // 0x34
        int32_t CachedProgress; // 0x38
        int32_t OneBattleAddedProgress; // 0x3c
        float ActivationTime; // 0x40
        float FinishTime; // 0x44
        float RemainTime; // 0x48
        float RemainTimeUpdateServerTime; // 0x4c
        bool bHasTryInteract; // 0x50
        enum class EMissionFailedType FailedType; // 0x51

    };

    struct FMFMissionFlowReplicateData //ScriptStruct MFMission.MFMissionFlowReplicateData
    {
    //Children Prop Count (Fields): 6
    public:

        class AActor* Instigator; // 0x0
        struct FString MissionFlowName; // 0x8
        enum class EMissionStatus MissionFlowStatus; // 0x18
        enum class EMissionStatus OldMissionFlowStatus; // 0x19
        bool bBeforeState; // 0x1a
        float StatusChangeTime; // 0x1c

    };

    struct FChaseActivityStateChangeInfo //ScriptStruct SGFramework.ChaseActivityStateChangeInfo
    {
    //Children Prop Count (Fields): 3
    public:

        enum class EChaseActivityState PreviousState; // 0x0
        enum class EChaseActivityState CurrentState; // 0x1
        float ServerTime; // 0x4

    };

    struct FRepAttachment //ScriptStruct Engine.RepAttachment
    {
    //Children Prop Count (Fields): 6
    public:

        class AActor* AttachParent; // 0x0
        struct FVector_NetQuantize100 LocationOffset; // 0x8
        struct FVector_NetQuantize100 RelativeScale3D; // 0x14
        struct FRotator RotationOffset; // 0x20
        struct FName AttachSocket; // 0x2c
        class USceneComponent* AttachComponent; // 0x38

    };

    struct FRepMovement //ScriptStruct Engine.RepMovement
    {
    //Children Prop Count (Fields): 9
    public:

        struct FVector LinearVelocity; // 0x0
        struct FVector AngularVelocity; // 0xc
        struct FVector Location; // 0x18
        struct FRotator Rotation; // 0x24
        char bSimulatedPhysicSleep; // 0x30
        char bRepPhysics; // 0x30
        enum class EVectorQuantization LocationQuantizationLevel; // 0x31
        enum class EVectorQuantization VelocityQuantizationLevel; // 0x32
        enum class ERotatorQuantization RotationQuantizationLevel; // 0x33

    };

    struct FActorTickFunction : FTickFunction //ScriptStruct Engine.ActorTickFunction
    {
    public:


    };

    struct FUniqueNetIdRepl : FUniqueNetIdWrapper //ScriptStruct Engine.UniqueNetIdRepl
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<char> ReplicationBytes; // 0x18

    };

    struct FForceFeedbackParameters //ScriptStruct Engine.ForceFeedbackParameters
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName Tag; // 0x0
        bool bLooping; // 0x8
        bool bIgnoreTimeDilation; // 0x9
        bool bPlayWhilePaused; // 0xa

    };

    struct FViewTargetTransitionParams //ScriptStruct Engine.ViewTargetTransitionParams
    {
    //Children Prop Count (Fields): 4
    public:

        float BlendTime; // 0x0
        enum class EViewTargetBlendFunction BlendFunction; // 0x4
        float BlendExp; // 0x8
        char bLockOutgoing; // 0xc

    };

    struct FUpdateLevelStreamingLevelStatus //ScriptStruct Engine.UpdateLevelStreamingLevelStatus
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName PackageName; // 0x0
        int32_t LODIndex; // 0x8
        char bNewShouldBeLoaded; // 0xc
        char bNewShouldBeVisible; // 0xc
        char bNewShouldBlockOnLoad; // 0xc

    };

    struct FUpdateLevelVisibilityLevelInfo //ScriptStruct Engine.UpdateLevelVisibilityLevelInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName PackageName; // 0x0
        struct FName Filename; // 0x8
        char bIsVisible; // 0x10

    };

    struct FActiveForceFeedbackEffect //ScriptStruct Engine.ActiveForceFeedbackEffect
    {
    //Children Prop Count (Fields): 1
    public:

        class UForceFeedbackEffect* ForceFeedbackEffect; // 0x0

    };

    struct FAIRequestID //ScriptStruct AIModule.AIRequestID
    {
    //Children Prop Count (Fields): 1
    public:

        uint32_t RequestID; // 0x0

    };

    struct FAIStimulus //ScriptStruct AIModule.AIStimulus
    {
    //Children Prop Count (Fields): 7
    public:

        float Age; // 0x0
        float ExpirationAge; // 0x4
        float Strength; // 0x8
        struct FVector StimulusLocation; // 0xc
        struct FVector ReceiverLocation; // 0x18
        struct FName Tag; // 0x24
        char bSuccessfullySensed; // 0x38

    };

    struct FActorPerceptionUpdateInfo //ScriptStruct AIModule.ActorPerceptionUpdateInfo
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t TargetId; // 0x0
        struct TWeakObjectPtr<struct AActor> Target; // 0x4
        struct FAIStimulus Stimulus; // 0xc

    };

    struct FShootInputFlowData //ScriptStruct SGFramework.ShootInputFlowData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString InputFlowDataSlice; // 0x0
        bool bComplete; // 0x10
        int32_t SequenceNum; // 0x14

    };

    struct FDSSwitchConfig //ScriptStruct SGFramework.DSSwitchConfig
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t nGetAttachLoopMaxNum; // 0x0
        float CheckLimitTime; // 0x4
        bool bTouchCheckSwitcher; // 0x8

    };

    struct FBlueprintSessionResult //ScriptStruct OnlineSubsystemUtils.BlueprintSessionResult
    {
    public:


    };

    struct FInAppPurchaseProductInfo //ScriptStruct OnlineSubsystem.InAppPurchaseProductInfo
    {
    //Children Prop Count (Fields): 11
    public:

        struct FString Identifier; // 0x0
        struct FString TransactionIdentifier; // 0x10
        struct FString DisplayName; // 0x20
        struct FString DisplayDescription; // 0x30
        struct FString DisplayPrice; // 0x40
        float RawPrice; // 0x50
        struct FString CurrencyCode; // 0x58
        struct FString CurrencySymbol; // 0x68
        struct FString DecimalSeparator; // 0x78
        struct FString GroupingSeparator; // 0x88
        struct FString ReceiptData; // 0x98

    };

    struct FInAppPurchaseReceiptInfo2 //ScriptStruct OnlineSubsystemUtils.InAppPurchaseReceiptInfo2
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ItemName; // 0x0
        struct FString ItemID; // 0x10
        struct FString ValidationInfo; // 0x20

    };

    struct FOnlineProxyStoreOffer //ScriptStruct OnlineSubsystemUtils.OnlineProxyStoreOffer
    {
    //Children Prop Count (Fields): 13
    public:

        struct FString OfferId; // 0x0
        struct FText Title; // 0x10
        struct FText Description; // 0x28
        struct FText LongDescription; // 0x40
        struct FText RegularPriceText; // 0x58
        int32_t RegularPrice; // 0x70
        struct FText PriceText; // 0x78
        int32_t NumericPrice; // 0x90
        struct FString CurrencyCode; // 0x98
        struct FDateTime ReleaseDate; // 0xa8
        struct FDateTime ExpirationDate; // 0xb0
        enum class EOnlineProxyStoreOfferDiscountType DiscountType; // 0xb8
        struct TMap<struct FString, struct FString> DynamicFields; // 0xc0

    };

    struct FInAppPurchaseRestoreInfo //ScriptStruct OnlineSubsystem.InAppPurchaseRestoreInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Identifier; // 0x0
        struct FString ReceiptData; // 0x10
        struct FString TransactionIdentifier; // 0x20

    };

    struct FInAppPurchaseRestoreInfo2 //ScriptStruct OnlineSubsystemUtils.InAppPurchaseRestoreInfo2
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ItemName; // 0x0
        struct FString ItemID; // 0x10
        struct FString ValidationInfo; // 0x20

    };

    struct FQuestContextPair //ScriptStruct MFQuestSystem.QuestContextPair
    {
    //Children Prop Count (Fields): 2
    public:

        class UMFQuestContextSourceBase* ContextSource; // 0x0
        class UMFQuestContextBase* Context; // 0x8

    };

    struct FMagicLeapARPinState //ScriptStruct MagicLeapARPin.MagicLeapARPinState
    {
    //Children Prop Count (Fields): 5
    public:

        float Confidence; // 0x0
        float ValidRadius; // 0x4
        float RotationError; // 0x8
        float TranslationError; // 0xc
        enum class EMagicLeapARPinType PinType; // 0x10

    };

    struct FAreaDataInfo //ScriptStruct UAGame.AreaDataInfo
    {
    //Children Prop Count (Fields): 9
    public:

        int32_t Triggertype; // 0x0
        int32_t AreaID; // 0x4
        struct FName AreaName; // 0x8
        int64_t EnterTimeStamp; // 0x10
        float EnterInventoryValue; // 0x18
        int32_t EnterMainWeaponValue; // 0x1c
        int32_t EnterSecondWeaponValue; // 0x20
        int32_t EnterSafeBoxValue; // 0x24
        int32_t EnterArmorValue; // 0x28

    };

    struct FNewTraceableActorInfo //ScriptStruct UAGame.NewTraceableActorInfo
    {
    //Children Prop Count (Fields): 12
    public:

        struct TArray<enum class ENewTraceDisplayPlatform> NeedDisplayPlatforms; // 0x8
        struct TWeakObjectPtr<struct AActor> TraceActor; // 0x18
        bool bActorDestroyed; // 0x20
        struct FVector WorldLocation; // 0x24
        int32_t Handle; // 0x30
        int32_t ConfigID; // 0x34
        bool bNeedTrace; // 0x38
        int64_t CreateTimeStamp; // 0x40
        int32_t TaskId; // 0x48
        int32_t TargetId; // 0x4c
        struct FVector Extend; // 0x50
        int32_t ConditionEscapeId; // 0x5c

    };

    struct FChaosPhysicsCollisionInfo //ScriptStruct ChaosSolverEngine.ChaosPhysicsCollisionInfo
    {
    //Children Prop Count (Fields): 11
    public:

        class UPrimitiveComponent* Component; // 0x0
        class UPrimitiveComponent* OtherComponent; // 0x8
        struct FVector Location; // 0x10
        struct FVector Normal; // 0x1c
        struct FVector AccumulatedImpulse; // 0x28
        struct FVector Velocity; // 0x34
        struct FVector OtherVelocity; // 0x40
        struct FVector AngularVelocity; // 0x4c
        struct FVector OtherAngularVelocity; // 0x58
        float Mass; // 0x64
        float OtherMass; // 0x68

    };

    struct FChaosCollisionEventData //ScriptStruct GeometryCollectionEngine.ChaosCollisionEventData
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector Location; // 0x0
        struct FVector Normal; // 0xc
        struct FVector Velocity1; // 0x18
        struct FVector Velocity2; // 0x24
        float Mass1; // 0x30
        float Mass2; // 0x34
        struct FVector Impulse; // 0x38

    };

    struct FChaosBreakingEventData //ScriptStruct GeometryCollectionEngine.ChaosBreakingEventData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Location; // 0x0
        struct FVector Velocity; // 0xc
        float Mass; // 0x18

    };

    struct FChaosTrailingEventData //ScriptStruct GeometryCollectionEngine.ChaosTrailingEventData
    {
    //Children Prop Count (Fields): 5
    public:

        struct FVector Location; // 0x0
        struct FVector Velocity; // 0xc
        struct FVector AngularVelocity; // 0x18
        float Mass; // 0x24
        int32_t ParticleIndex; // 0x28

    };

    struct FChaosBreakEvent //ScriptStruct ChaosSolverEngine.ChaosBreakEvent
    {
    //Children Prop Count (Fields): 5
    public:

        class UPrimitiveComponent* Component; // 0x0
        struct FVector Location; // 0x8
        struct FVector Velocity; // 0x14
        struct FVector AngularVelocity; // 0x20
        float Mass; // 0x2c

    };

    struct FWalkableSlopeOverride //ScriptStruct Engine.WalkableSlopeOverride
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EWalkableSlopeBehavior WalkableSlopeBehavior; // 0x0
        float WalkableSlopeAngle; // 0x4

    };

    struct FBodyInstanceCore //ScriptStruct PhysicsCore.BodyInstanceCore
    {
    //Children Prop Count (Fields): 7
    public:

        char bSimulatePhysics; // 0x10
        char bOverrideMass; // 0x10
        char bEnableGravity; // 0x10
        char bAutoWeld; // 0x10
        char bStartAwake; // 0x10
        char bGenerateWakeEvents; // 0x10
        char bUpdateMassWhenScaleChanges; // 0x10

    };

    struct FBodyInstance : FBodyInstanceCore //ScriptStruct Engine.BodyInstance
    {
    //Children Prop Count (Fields): 37
    public:

        enum class ECollisionChannel ObjectType; // 0x1e
        enum class ECollisionEnabled CollisionEnabled; // 0x20
        enum class ESleepFamily SleepFamily; // 0x59
        enum class EDOFMode DOFMode; // 0x5a
        char bUseCCD; // 0x5b
        char bIgnoreAnalyticCollisions; // 0x5b
        char bNotifyRigidBodyCollision; // 0x5b
        char bLockTranslation; // 0x5b
        char bLockRotation; // 0x5b
        char bLockXTranslation; // 0x5b
        char bLockYTranslation; // 0x5b
        char bLockZTranslation; // 0x5c
        char bLockXRotation; // 0x5c
        char bLockYRotation; // 0x5c
        char bLockZRotation; // 0x5c
        char bOverrideMaxAngularVelocity; // 0x5c
        char bOverrideMaxDepenetrationVelocity; // 0x5c
        char bOverrideWalkableSlopeOnInstance; // 0x5d
        char bInterpolateWhenSubStepping; // 0x5d
        struct FName CollisionProfileName; // 0x6c
        char PositionSolverIterationCount; // 0x74
        char VelocitySolverIterationCount; // 0x75
        struct FCollisionResponse CollisionResponses; // 0x78
        float MaxDepenetrationVelocity; // 0xa8
        float MassInKgOverride; // 0xac
        float LinearDamping; // 0xb8
        float AngularDamping; // 0xbc
        struct FVector CustomDOFPlaneNormal; // 0xc0
        struct FVector COMNudge; // 0xcc
        float MassScale; // 0xd8
        struct FVector InertiaTensorScale; // 0xdc
        struct FWalkableSlopeOverride WalkableSlopeOverride; // 0xf8
        class UPhysicalMaterial* PhysMaterialOverride; // 0x108
        float MaxAngularVelocity; // 0x110
        float CustomSleepThresholdMultiplier; // 0x114
        float StabilizationThresholdMultiplier; // 0x118
        float PhysicsBlendWeight; // 0x11c

    };

    struct FCollisionResponse //ScriptStruct Engine.CollisionResponse
    {
    //Children Prop Count (Fields): 2
    public:

        struct FCollisionResponseContainer ResponseToChannels; // 0x0
        struct TArray<struct FResponseChannel> ResponseArray; // 0x20

    };

    struct FResponseChannel //ScriptStruct Engine.ResponseChannel
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Channel; // 0x0
        enum class ECollisionResponse Response; // 0x8

    };

    struct FCollisionResponseContainer //ScriptStruct Engine.CollisionResponseContainer
    {
    //Children Prop Count (Fields): 32
    public:

        enum class ECollisionResponse WorldStatic; // 0x0
        enum class ECollisionResponse WorldDynamic; // 0x1
        enum class ECollisionResponse Pawn; // 0x2
        enum class ECollisionResponse Visibility; // 0x3
        enum class ECollisionResponse Camera; // 0x4
        enum class ECollisionResponse PhysicsBody; // 0x5
        enum class ECollisionResponse Vehicle; // 0x6
        enum class ECollisionResponse Destructible; // 0x7
        enum class ECollisionResponse EngineTraceChannel1; // 0x8
        enum class ECollisionResponse EngineTraceChannel2; // 0x9
        enum class ECollisionResponse EngineTraceChannel3; // 0xa
        enum class ECollisionResponse EngineTraceChannel4; // 0xb
        enum class ECollisionResponse EngineTraceChannel5; // 0xc
        enum class ECollisionResponse EngineTraceChannel6; // 0xd
        enum class ECollisionResponse GameTraceChannel1; // 0xe
        enum class ECollisionResponse GameTraceChannel2; // 0xf
        enum class ECollisionResponse GameTraceChannel3; // 0x10
        enum class ECollisionResponse GameTraceChannel4; // 0x11
        enum class ECollisionResponse GameTraceChannel5; // 0x12
        enum class ECollisionResponse GameTraceChannel6; // 0x13
        enum class ECollisionResponse GameTraceChannel7; // 0x14
        enum class ECollisionResponse GameTraceChannel8; // 0x15
        enum class ECollisionResponse GameTraceChannel9; // 0x16
        enum class ECollisionResponse GameTraceChannel10; // 0x17
        enum class ECollisionResponse GameTraceChannel11; // 0x18
        enum class ECollisionResponse GameTraceChannel12; // 0x19
        enum class ECollisionResponse GameTraceChannel13; // 0x1a
        enum class ECollisionResponse GameTraceChannel14; // 0x1b
        enum class ECollisionResponse GameTraceChannel15; // 0x1c
        enum class ECollisionResponse GameTraceChannel16; // 0x1d
        enum class ECollisionResponse GameTraceChannel17; // 0x1e
        enum class ECollisionResponse GameTraceChannel18; // 0x1f

    };

    struct FCustomPrimitiveData //ScriptStruct Engine.CustomPrimitiveData
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<float> Data; // 0x0

    };

    struct FLightingChannels //ScriptStruct Engine.LightingChannels
    {
    //Children Prop Count (Fields): 3
    public:

        char bChannel0; // 0x0
        char bChannel1; // 0x0
        char bChannel2; // 0x0

    };

    struct FPrimitivePhysicsShapes //ScriptStruct Engine.PrimitivePhysicsShapes
    {
    //Children Prop Count (Fields): 2
    public:

        struct TMap<class UPrimitiveComponent*, struct FBodyInstancePhysicsShapes> BlockShapes; // 0x0
        struct TMap<class UPrimitiveComponent*, struct FBodyInstancePhysicsShapes> TouchShapes; // 0x50

    };

    struct FBodyInstancePhysicsShapes //ScriptStruct Engine.BodyInstancePhysicsShapes
    {
    public:


    };

    struct FGeometryCollectionRepData //ScriptStruct GeometryCollectionEngine.GeometryCollectionRepData
    {
    public:


    };

    struct FGeomComponentCacheParameters //ScriptStruct GeometryCollectionEngine.GeomComponentCacheParameters
    {
    //Children Prop Count (Fields): 20
    public:

        enum class EGeometryCollectionCacheType CacheMode; // 0x0
        class UGeometryCollectionCache* TargetCache; // 0x8
        float ReverseCacheBeginTime; // 0x10
        bool SaveCollisionData; // 0x14
        bool DoGenerateCollisionData; // 0x15
        int32_t CollisionDataSizeMax; // 0x18
        bool DoCollisionDataSpatialHash; // 0x1c
        float CollisionDataSpatialHashRadius; // 0x20
        int32_t MaxCollisionPerCell; // 0x24
        bool SaveBreakingData; // 0x28
        bool DoGenerateBreakingData; // 0x29
        int32_t BreakingDataSizeMax; // 0x2c
        bool DoBreakingDataSpatialHash; // 0x30
        float BreakingDataSpatialHashRadius; // 0x34
        int32_t MaxBreakingPerCell; // 0x38
        bool SaveTrailingData; // 0x3c
        bool DoGenerateTrailingData; // 0x3d
        int32_t TrailingDataSizeMax; // 0x40
        float TrailingMinSpeedThreshold; // 0x44
        float TrailingMinVolumeThreshold; // 0x48

    };

    struct FAkAdvancedInitializationSettings //ScriptStruct AkAudio.AkAdvancedInitializationSettings
    {
    //Children Prop Count (Fields): 11
    public:

        uint32_t IO_MemorySize; // 0x0
        uint32_t IO_Granularity; // 0x4
        float TargetAutoStreamBufferLength; // 0x8
        bool UseStreamCache; // 0xc
        uint32_t MaximumPinnedBytesInCache; // 0x10
        bool EnableGameSyncPreparation; // 0x14
        uint32_t ContinuousPlaybackLookAhead; // 0x18
        uint32_t MonitorQueuePoolSize; // 0x1c
        uint32_t MaximumHardwareTimeoutMs; // 0x20
        bool DebugOutOfRangeCheckEnabled; // 0x24
        float DebugOutOfRangeLimit; // 0x28

    };

    struct FAkAdvancedInitializationSettingsWithMultiCoreRendering : FAkAdvancedInitializationSettings //ScriptStruct AkAudio.AkAdvancedInitializationSettingsWithMultiCoreRendering
    {
    //Children Prop Count (Fields): 1
    public:

        bool EnableMultiCoreRendering; // 0x2c

    };

    struct FAkAndroidAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering //ScriptStruct AkAudio.AkAndroidAdvancedInitializationSettings
    {
    //Children Prop Count (Fields): 2
    public:

        uint32_t AudioAPI; // 0x30
        bool RoundFrameSizeToHardwareSize; // 0x34

    };

    struct FAkAudioSession //ScriptStruct AkAudio.AkAudioSession
    {
    //Children Prop Count (Fields): 3
    public:

        enum class EAkAudioSessionCategory AudioSessionCategory; // 0x0
        uint32_t AudioSessionCategoryOptions; // 0x4
        enum class EAkAudioSessionMode AudioSessionMode; // 0x8

    };

    struct FVoicePlayingData //ScriptStruct AkAudio.VoicePlayingData
    {
    public:


    };

    struct FAkExternalSourceInfo //ScriptStruct AkAudio.AkExternalSourceInfo
    {
    //Children Prop Count (Fields): 5
    public:

        struct FString ExternalSrcName; // 0x0
        enum class AkCodecId CodecID; // 0x10
        struct FString Filename; // 0x18
        class UAkExternalMediaAsset* ExternalSourceAsset; // 0x28
        bool IsStreamed; // 0x30

    };

    struct FAkSegmentInfo //ScriptStruct AkAudio.AkSegmentInfo
    {
    //Children Prop Count (Fields): 9
    public:

        int32_t CurrentPosition; // 0x0
        int32_t PreEntryDuration; // 0x4
        int32_t ActiveDuration; // 0x8
        int32_t PostExitDuration; // 0xc
        int32_t RemainingLookAheadTime; // 0x10
        float BeatDuration; // 0x14
        float BarDuration; // 0x18
        float GridDuration; // 0x1c
        float GridOffset; // 0x20

    };

    struct FAkMidiEventBase //ScriptStruct AkAudio.AkMidiEventBase
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EAkMidiEventType Type; // 0x0
        char Chan; // 0x1

    };

    struct FAkMidiProgramChange : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiProgramChange
    {
    //Children Prop Count (Fields): 1
    public:

        char ProgramNum; // 0x2

    };

    struct FAkMidiChannelAftertouch : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiChannelAftertouch
    {
    //Children Prop Count (Fields): 1
    public:

        char Value; // 0x2

    };

    struct FAkMidiNoteAftertouch : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiNoteAftertouch
    {
    //Children Prop Count (Fields): 2
    public:

        char Note; // 0x2
        char Value; // 0x3

    };

    struct FAkMidiPitchBend : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiPitchBend
    {
    //Children Prop Count (Fields): 3
    public:

        char ValueLsb; // 0x2
        char ValueMsb; // 0x3
        int32_t FullValue; // 0x4

    };

    struct FAkMidiCc : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiCc
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EAkMidiCcValues Cc; // 0x2
        char Value; // 0x3

    };

    struct FAkMidiNoteOnOff : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiNoteOnOff
    {
    //Children Prop Count (Fields): 2
    public:

        char Note; // 0x2
        char Velocity; // 0x3

    };

    struct FAkMidiGeneric : FAkMidiEventBase //ScriptStruct AkAudio.AkMidiGeneric
    {
    //Children Prop Count (Fields): 2
    public:

        char Param1; // 0x2
        char Param2; // 0x3

    };

    struct FAkOutputSettings //ScriptStruct AkAudio.AkOutputSettings
    {
    //Children Prop Count (Fields): 4
    public:

        struct FString AudioDeviceSharesetName; // 0x0
        int32_t IdDevice; // 0x10
        enum class PanningRule PanRule; // 0x14
        enum class AkChannelConfiguration ChannelConfig; // 0x15

    };

    struct FAkChannelMask //ScriptStruct AkAudio.AkChannelMask
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t ChannelMask; // 0x0

    };

    struct FAkGeometrySurfaceOverride //ScriptStruct AkAudio.AkGeometrySurfaceOverride
    {
    //Children Prop Count (Fields): 4
    public:

        class UAkAcousticTexture* AcousticTexture; // 0x0
        bool bEnableOcclusionOverride; // 0x8
        float OcclusionValue; // 0xc
        float SurfaceArea; // 0x10

    };

    struct FAkGeometryData //ScriptStruct AkAudio.AkGeometryData
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FVector> Vertices; // 0x0
        struct TArray<struct FAkAcousticSurface> Surfaces; // 0x10
        struct TArray<struct FAkTriangle> Triangles; // 0x20
        struct TArray<class UPhysicalMaterial*> ToOverrideAcousticTexture; // 0x30
        struct TArray<class UPhysicalMaterial*> ToOverrideOcclusion; // 0x40

    };

    struct FAkTriangle //ScriptStruct AkAudio.AkTriangle
    {
    //Children Prop Count (Fields): 4
    public:

        uint16_t Point0; // 0x0
        uint16_t Point1; // 0x2
        uint16_t Point2; // 0x4
        uint16_t Surface; // 0x6

    };

    struct FAkAcousticSurface //ScriptStruct AkAudio.AkAcousticSurface
    {
    //Children Prop Count (Fields): 3
    public:

        uint32_t Texture; // 0x0
        float Occlusion; // 0x4
        struct FString Name; // 0x8

    };

    struct FAkPluginInfo //ScriptStruct AkAudio.AkPluginInfo
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString Name; // 0x0
        uint32_t PluginID; // 0x10
        struct FString dll; // 0x18

    };

    struct FAkCommonInitializationSettings //ScriptStruct AkAudio.AkCommonInitializationSettings
    {
    //Children Prop Count (Fields): 8
    public:

        uint32_t MaximumNumberOfMemoryPools; // 0x0
        uint32_t MaximumNumberOfPositioningPaths; // 0x4
        uint32_t CommandQueueSize; // 0x8
        uint32_t SamplesPerFrame; // 0xc
        struct FAkMainOutputSettings MainOutputSettings; // 0x10
        float StreamingLookAheadRatio; // 0x38
        uint16_t NumberOfRefillsInVoice; // 0x3c
        struct FAkSpatialAudioSettings SpatialAudioSettings; // 0x40

    };

    struct FAkSpatialAudioSettings //ScriptStruct AkAudio.AkSpatialAudioSettings
    {
    //Children Prop Count (Fields): 11
    public:

        uint32_t MaxSoundPropagationDepth; // 0x0
        float MovementThreshold; // 0x4
        uint32_t NumberOfPrimaryRays; // 0x8
        uint32_t ReflectionOrder; // 0xc
        float MaximumPathLength; // 0x10
        float CPULimitPercentage; // 0x14
        bool EnableDiffractionOnReflections; // 0x18
        bool EnableGeometricDiffractionAndTransmission; // 0x19
        bool CalcEmitterVirtualPosition; // 0x1a
        bool UseObstruction; // 0x1b
        bool UseOcclusion; // 0x1c

    };

    struct FAkMainOutputSettings //ScriptStruct AkAudio.AkMainOutputSettings
    {
    //Children Prop Count (Fields): 6
    public:

        struct FString AudioDeviceShareset; // 0x0
        uint32_t DeviceID; // 0x10
        enum class EAkPanningRule PanningRule; // 0x14
        enum class EAkChannelConfigType ChannelConfigType; // 0x18
        uint32_t ChannelMask; // 0x1c
        uint32_t NumberOfChannels; // 0x20

    };

    struct FAkCommonInitializationSettingsWithSampleRate : FAkCommonInitializationSettings //ScriptStruct AkAudio.AkCommonInitializationSettingsWithSampleRate
    {
    //Children Prop Count (Fields): 1
    public:

        uint32_t SampleRate; // 0x60

    };

    struct FAkCommunicationSettings //ScriptStruct AkAudio.AkCommunicationSettings
    {
    //Children Prop Count (Fields): 5
    public:

        uint32_t PoolSize; // 0x0
        uint16_t DiscoveryBroadcastPort; // 0x4
        uint16_t CommandPort; // 0x6
        uint16_t NotificationPort; // 0x8
        struct FString NetworkName; // 0x10

    };

    struct FAkCommunicationSettingsWithCommSelection : FAkCommunicationSettings //ScriptStruct AkAudio.AkCommunicationSettingsWithCommSelection
    {
    //Children Prop Count (Fields): 1
    public:

        enum class EAkCommSystem CommunicationSystem; // 0x20

    };

    struct FAkCommunicationSettingsWithSystemInitialization : FAkCommunicationSettings //ScriptStruct AkAudio.AkCommunicationSettingsWithSystemInitialization
    {
    //Children Prop Count (Fields): 1
    public:

        bool InitializeSystemComms; // 0x20

    };

    struct FAkBoolPropertyToControl //ScriptStruct AkAudio.AkBoolPropertyToControl
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ItemProperty; // 0x0

    };

    struct FAkPropertyToControl //ScriptStruct AkAudio.AkPropertyToControl
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString ItemProperty; // 0x0

    };

    struct FAkReverbDescriptor //ScriptStruct AkAudio.AkReverbDescriptor
    {
    public:


    };

    struct FAkAcousticTextureParams //ScriptStruct AkAudio.AkAcousticTextureParams
    {
    //Children Prop Count (Fields): 1
    public:

        struct FVector4 AbsorptionValues; // 0x0

    };

    struct FAkGeometrySurfacePropertiesToMap //ScriptStruct AkAudio.AkGeometrySurfacePropertiesToMap
    {
    //Children Prop Count (Fields): 2
    public:

        struct TSoftObjectPtr<UAkAcousticTexture> AcousticTexture; // 0x0
        float OcclusionValue; // 0x28

    };

    struct FAkWwiseItemToControl //ScriptStruct AkAudio.AkWwiseItemToControl
    {
    //Children Prop Count (Fields): 2
    public:

        struct FAkWwiseObjectDetails ItemPicked; // 0x0
        struct FString ItemPath; // 0x30

    };

    struct FAkWwiseObjectDetails //ScriptStruct AkAudio.AkWwiseObjectDetails
    {
    //Children Prop Count (Fields): 3
    public:

        struct FString ItemName; // 0x0
        struct FString ItemPath; // 0x10
        struct FString ItemID; // 0x20

    };

    struct FAkSurfacePoly //ScriptStruct AkAudio.AkSurfacePoly
    {
    //Children Prop Count (Fields): 4
    public:

        class UAkAcousticTexture* Texture; // 0x0
        float Occlusion; // 0x8
        bool EnableSurface; // 0xc
        float SurfaceArea; // 0x10

    };

    struct FAkSurfaceEdgeInfo //ScriptStruct AkAudio.AkSurfaceEdgeInfo
    {
    public:


    };

    struct FAkSurfaceEdgeVerts //ScriptStruct AkAudio.AkSurfaceEdgeVerts
    {
    public:


    };

    struct FAkWaapiFieldNames //ScriptStruct AkAudio.AkWaapiFieldNames
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString FieldName; // 0x0

    };

    struct FAkWaapiUri //ScriptStruct AkAudio.AkWaapiUri
    {
    //Children Prop Count (Fields): 1
    public:

        struct FString Uri; // 0x0

    };

    struct FAkWindowsAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering //ScriptStruct AkAudio.AkWindowsAdvancedInitializationSettings
    {
    //Children Prop Count (Fields): 2
    public:

        bool UseHeadMountedDisplayAudioDevice; // 0x30
        uint32_t MaxSystemAudioObjects; // 0x34

    };

    struct FAudioConsoleMessage //ScriptStruct AkAudio.AudioConsoleMessage
    {
    //Children Prop Count (Fields): 8
    public:

        float TimeSeconds; // 0x0
        enum class AudioLogVerbosity Verbosity; // 0x4
        enum class AudioAction Action; // 0x5
        enum class AudioObjectType ObjectType; // 0x6
        struct FString ObjectName; // 0x8
        struct FString GameObject; // 0x18
        float Value; // 0x28
        struct FString Source; // 0x30

    };

    struct FAudioStudioProfileData //ScriptStruct AkAudio.AudioStudioProfileData
    {
    //Children Prop Count (Fields): 20
    public:

        double ak_totalCPU; // 0x0
        double ak_pluginCPU; // 0x8
        double ak_calCpuByRendertime; // 0x10
        uint32_t ak_physicalVoices; // 0x18
        uint32_t ak_virtualVoices; // 0x1c
        uint32_t ak_totalVoices; // 0x20
        uint32_t ak_nbActiveEvents; // 0x24
        float ak_memory; // 0x28
        float gameCPU; // 0x2c
        float FrameTime; // 0x30
        float gameThreadTime; // 0x34
        float gameMemory; // 0x38
        uint32_t ak_memory_Used; // 0x3c
        uint32_t ak_memory_DeviceUsed; // 0x40
        uint32_t ak_memory_Reserved; // 0x44
        uint32_t ak_memory_Max; // 0x48
        float ak_volume_bus_weapon; // 0x4c
        float ak_volume_bus_action; // 0x50
        float ak_volume_bus_ambience; // 0x54
        float ak_volume_bus_voice; // 0x58

    };

    struct FLevelAudioData //ScriptStruct AkAudio.LevelAudioData
    {
    //Children Prop Count (Fields): 9
    public:

        struct FString InheritedConfigName; // 0x0
        struct TArray<struct FString> Levels; // 0x10
        struct TArray<struct FString> Banks; // 0x20
        struct TArray<struct FString> States; // 0x30
        struct TArray<struct FString> Events; // 0x40
        bool UnloadBanksOnLevelUnload; // 0x50
        bool StopEventsOnLevelUnload; // 0x51
        bool StopAll2DSoundsOnLevelUnload; // 0x52
        bool LevelNameExactMatch; // 0x53

    };

    struct FAudioEventExtendData_HD : FTableRowBase //ScriptStruct AkAudio.AudioEventExtendData_HD
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Category; // 0x8

    };

    struct FTArrUMultiSourceSoundComponent //ScriptStruct AkAudio.TArrUMultiSourceSoundComponent
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UMultiSourceSoundComponent*> TArrUMultiSourceSoundComponent; // 0x0

    };

    struct FMovieSceneEvalTemplateBase //ScriptStruct MovieScene.MovieSceneEvalTemplateBase
    {
    public:


    };

    struct FMovieSceneEvalTemplate : FMovieSceneEvalTemplateBase //ScriptStruct MovieScene.MovieSceneEvalTemplate
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EMovieSceneCompletionMode CompletionMode; // 0x10
        struct TWeakObjectPtr<struct UMovieSceneSection> SourceSectionPtr; // 0x14

    };

    struct FMovieSceneAkAudioEventTemplate : FMovieSceneEvalTemplate //ScriptStruct AkAudio.MovieSceneAkAudioEventTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        class UMovieSceneAkAudioEventSection* Section; // 0x20

    };

    struct FMovieSceneAkAudioRTPCTemplate : FMovieSceneEvalTemplate //ScriptStruct AkAudio.MovieSceneAkAudioRTPCTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        class UMovieSceneAkAudioRTPCSection* Section; // 0x20

    };

    struct FMovieSceneFloatChannelSerializationHelper //ScriptStruct AkAudio.MovieSceneFloatChannelSerializationHelper
    {
    //Children Prop Count (Fields): 6
    public:

        enum class ERichCurveExtrapolation PreInfinityExtrap; // 0x0
        enum class ERichCurveExtrapolation PostInfinityExtrap; // 0x1
        struct TArray<int32_t> Times; // 0x8
        struct TArray<struct FMovieSceneFloatValueSerializationHelper> Values; // 0x18
        float DefaultValue; // 0x28
        bool bHasDefaultValue; // 0x2c

    };

    struct FMovieSceneFloatValueSerializationHelper //ScriptStruct AkAudio.MovieSceneFloatValueSerializationHelper
    {
    //Children Prop Count (Fields): 4
    public:

        float Value; // 0x0
        enum class ERichCurveInterpMode InterpMode; // 0x4
        enum class ERichCurveTangentMode TangentMode; // 0x5
        struct FMovieSceneTangentDataSerializationHelper Tangent; // 0x8

    };

    struct FMovieSceneTangentDataSerializationHelper //ScriptStruct AkAudio.MovieSceneTangentDataSerializationHelper
    {
    //Children Prop Count (Fields): 5
    public:

        float ArriveTangent; // 0x0
        float LeaveTangent; // 0x4
        enum class ERichCurveTangentWeightMode TangentWeightMode; // 0x8
        float ArriveTangentWeight; // 0xc
        float LeaveTangentWeight; // 0x10

    };

    struct FParticleSoundData //ScriptStruct AkAudio.ParticleSoundData
    {
    //Children Prop Count (Fields): 3
    public:

        enum class EParticleEventType ParticleEventType; // 0x0
        struct FName ParticleEventName; // 0x4
        class UAkAudioEvent* AudioEvent; // 0x10

    };

    struct FMFFoliageBillboardInstanceInfo //ScriptStruct MFGridLevelsRuntime.MFFoliageBillboardInstanceInfo
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t SectionIndex; // 0x0
        char bVisibile; // 0x4

    };

    struct FMFFoliageBillboardSection //ScriptStruct MFGridLevelsRuntime.MFFoliageBillboardSection
    {
    //Children Prop Count (Fields): 4
    public:

        class UStaticMesh* StaticMesh; // 0x0
        class UMaterialInterface* MaterialInterface; // 0x8
        struct TArray<struct FTransform> PerInstanceTransform; // 0x10
        struct TArray<float> PerInstanceCustomData; // 0x20

    };

    struct FMFStaticMeshComponentGroupForCombine //ScriptStruct MFGridLevelsRuntime.MFStaticMeshComponentGroupForCombine
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FMFStaticMeshComponentForCombine> StaticMeshComponents; // 0x0

    };

    struct FMFStaticMeshComponentForCombine //ScriptStruct MFGridLevelsRuntime.MFStaticMeshComponentForCombine
    {
    //Children Prop Count (Fields): 3
    public:

        class UStaticMeshComponent* Component; // 0x0
        class UMaterialInterface* Material; // 0x8
        uint32_t HashCode; // 0x10

    };

    struct FProcMeshSection //ScriptStruct ProceduralMeshComponent.ProcMeshSection
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FProcMeshVertex> ProcVertexBuffer; // 0x0
        struct TArray<uint32_t> ProcIndexBuffer; // 0x10
        struct FBox SectionLocalBox; // 0x20
        bool bEnableCollision; // 0x3c
        bool bSectionVisible; // 0x3d

    };

    struct FProcMeshVertex //ScriptStruct ProceduralMeshComponent.ProcMeshVertex
    {
    //Children Prop Count (Fields): 8
    public:

        struct FVector position; // 0x0
        struct FVector Normal; // 0xc
        struct FProcMeshTangent Tangent; // 0x18
        struct FColor Color; // 0x28
        struct FVector2D UV0; // 0x2c
        struct FVector2D UV1; // 0x34
        struct FVector2D UV2; // 0x3c
        struct FVector2D UV3; // 0x44

    };

    struct FProcMeshTangent //ScriptStruct ProceduralMeshComponent.ProcMeshTangent
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector TangentX; // 0x0
        bool bFlipTangentY; // 0xc

    };

    struct FConnectionAlwaysRelevantNodePair //ScriptStruct ReplicationGraph.ConnectionAlwaysRelevantNodePair
    {
    //Children Prop Count (Fields): 2
    public:

        class UNetConnection* NetConnection; // 0x0
        class UReplicationGraphNode_AlwaysRelevant_ForConnection* Node; // 0x8

    };

    struct FDynamicCharacterRepInfo //ScriptStruct ReplicationGraph.DynamicCharacterRepInfo
    {
    //Children Prop Count (Fields): 8
    public:

        class AActor* Actor; // 0x0
        uint32_t ReplicationPeriodFrame; // 0x8
        uint32_t FastPath_ReplicationPeriodFrame; // 0xc
        uint32_t FastShare_ReplicationIndex; // 0x10
        uint32_t Default_ReplicationIndex; // 0x14
        float NetPriority; // 0x18
        float ExtraNetPriority; // 0x1c
        bool bReplicate_FastShare; // 0x20

    };

    struct FLastLocationGatherInfo //ScriptStruct ReplicationGraph.LastLocationGatherInfo
    {
    //Children Prop Count (Fields): 3
    public:

        class UNetConnection* Connection; // 0x0
        struct FVector LastLocation; // 0x8
        struct FVector LastOutOfRangeLocationCheck; // 0x14

    };

    struct FTearOffActorInfo //ScriptStruct ReplicationGraph.TearOffActorInfo
    {
    //Children Prop Count (Fields): 1
    public:

        class AActor* Actor; // 0x8

    };

    struct FAlwaysRelevantActorInfo //ScriptStruct ReplicationGraph.AlwaysRelevantActorInfo
    {
    //Children Prop Count (Fields): 3
    public:

        class UNetConnection* Connection; // 0x0
        class AActor* LastViewer; // 0x8
        class AActor* LastViewTarget; // 0x10

    };

    struct FClassReplicationInfo //ScriptStruct ReplicationGraph.ClassReplicationInfo
    {
    //Children Prop Count (Fields): 8
    public:

        float DistancePriorityScale; // 0x0
        float StarvationPriorityScale; // 0x4
        float AccumulatedNetPriorityBias; // 0x8
        uint16_t ReplicationPeriodFrame; // 0xc
        uint16_t FastPath_ReplicationPeriodFrame; // 0xe
        uint16_t ActorChannelFrameTimeout; // 0x10
        float CullDistance; // 0x68
        float CullDistanceSquared; // 0x6c

    };

    struct FNetSerializeScriptStructCache //ScriptStruct GameplayAbilities.NetSerializeScriptStructCache
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class UScriptStruct*> ScriptStructs; // 0x0

    };

    struct FAttributeMetaData : FTableRowBase //ScriptStruct GameplayAbilities.AttributeMetaData
    {
    //Children Prop Count (Fields): 5
    public:

        float BaseValue; // 0x8
        float MinValue; // 0xc
        float MaxValue; // 0x10
        struct FString DerivedAttributeInfo; // 0x18
        bool bCanStack; // 0x28

    };

    struct FGameplayAttributeData //ScriptStruct GameplayAbilities.GameplayAttributeData
    {
    //Children Prop Count (Fields): 2
    public:

        float BaseValue; // 0x8
        float CurrentValue; // 0xc

    };

    struct FAbilityTriggerData //ScriptStruct GameplayAbilities.AbilityTriggerData
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGameplayTag TriggerTag; // 0x0
        enum class EGameplayAbilityTriggerSource TriggerSource; // 0x8

    };

    struct FGameplayAbilityBindInfo //ScriptStruct GameplayAbilities.GameplayAbilityBindInfo
    {
    //Children Prop Count (Fields): 2
    public:

        enum class EGameplayAbilityInputBinds Command; // 0x0
        class UGameplayAbility* GameplayAbilityClass; // 0x8

    };

    struct FGameplayTargetDataFilterHandle //ScriptStruct GameplayAbilities.GameplayTargetDataFilterHandle
    {
    public:


    };

    struct FGameplayTargetDataFilter //ScriptStruct GameplayAbilities.GameplayTargetDataFilter
    {
    //Children Prop Count (Fields): 4
    public:

        class AActor* SelfActor; // 0x8
        class AActor* RequiredActorClass; // 0x10
        enum class ETargetDataFilterSelf SelfFilter; // 0x18
        bool bReverseFilter; // 0x19

    };

    struct FGameplayAbilityTargetData //ScriptStruct GameplayAbilities.GameplayAbilityTargetData
    {
    public:


    };

    struct FGameplayAbilityTargetData_SingleTargetHit : FGameplayAbilityTargetData //ScriptStruct GameplayAbilities.GameplayAbilityTargetData_SingleTargetHit
    {
    //Children Prop Count (Fields): 2
    public:

        struct FHitResult HitResult; // 0x8
        bool bHitReplaced; // 0xa0

    };

    struct FGameplayAbilityTargetData_ActorArray : FGameplayAbilityTargetData //ScriptStruct GameplayAbilities.GameplayAbilityTargetData_ActorArray
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGameplayAbilityTargetingLocationInfo SourceLocation; // 0x10
        struct TArray<struct TWeakObjectPtr<struct AActor>> TargetActorArray; // 0x80

    };

    struct FGameplayAbilityTargetingLocationInfo //ScriptStruct GameplayAbilities.GameplayAbilityTargetingLocationInfo
    {
    //Children Prop Count (Fields): 6
    public:

        enum class EGameplayAbilityTargetingLocationType LocationType; // 0x10
        struct FTransform LiteralTransform; // 0x20
        class AActor* SourceActor; // 0x50
        class UMeshComponent* SourceComponent; // 0x58
        class UGameplayAbility* SourceAbility; // 0x60
        struct FName SourceSocketName; // 0x68

    };

    struct FGameplayAbilityTargetData_LocationInfo : FGameplayAbilityTargetData //ScriptStruct GameplayAbilities.GameplayAbilityTargetData_LocationInfo
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGameplayAbilityTargetingLocationInfo SourceLocation; // 0x10
        struct FGameplayAbilityTargetingLocationInfo TargetLocation; // 0x80

    };

    struct FGameplayAbilitySpecHandleAndPredictionKey //ScriptStruct GameplayAbilities.GameplayAbilitySpecHandleAndPredictionKey
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGameplayAbilitySpecHandle AbilityHandle; // 0x0
        int32_t PredictionKeyAtCreation; // 0x4

    };

    struct FAbilityTaskDebugMessage //ScriptStruct GameplayAbilities.AbilityTaskDebugMessage
    {
    //Children Prop Count (Fields): 2
    public:

        class UGameplayTask* FromTask; // 0x0
        struct FString Message; // 0x8

    };

    struct FAbilityEndedData //ScriptStruct GameplayAbilities.AbilityEndedData
    {
    //Children Prop Count (Fields): 4
    public:

        class UGameplayAbility* AbilityThatEnded; // 0x0
        struct FGameplayAbilitySpecHandle AbilitySpecHandle; // 0x8
        bool bReplicateEndAbility; // 0xc
        bool bWasCancelled; // 0xd

    };

    struct FGameplayAbilityActorInfo //ScriptStruct GameplayAbilities.GameplayAbilityActorInfo
    {
    //Children Prop Count (Fields): 8
    public:

        struct TWeakObjectPtr<struct AActor> OwnerActor; // 0x8
        struct TWeakObjectPtr<struct AActor> AvatarActor; // 0x10
        struct TWeakObjectPtr<struct APlayerController> PlayerController; // 0x18
        struct TWeakObjectPtr<struct UAbilitySystemComponent> AbilitySystemComponent; // 0x20
        struct TWeakObjectPtr<struct USkeletalMeshComponent> SkeletalMeshComponent; // 0x28
        struct TWeakObjectPtr<struct UAnimInstance> AnimInstance; // 0x30
        struct TWeakObjectPtr<struct UMovementComponent> MovementComponent; // 0x38
        struct FName AffectedAnimInstanceTag; // 0x40

    };

    struct FWorldReticleParameters //ScriptStruct GameplayAbilities.WorldReticleParameters
    {
    //Children Prop Count (Fields): 1
    public:

        struct FVector AOEScale; // 0x0

    };

    struct FPreallocationInfo //ScriptStruct GameplayAbilities.PreallocationInfo
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<class AGameplayCueNotify_Actor*> ClassesNeedingPreallocation; // 0x50

    };

    struct FGameplayCuePendingExecute //ScriptStruct GameplayAbilities.GameplayCuePendingExecute
    {
    //Children Prop Count (Fields): 5
    public:

        struct FPredictionKey PredictionKey; // 0x18
        enum class EGameplayCuePayloadType PayloadType; // 0x28
        class UAbilitySystemComponent* OwningComponent; // 0x30
        struct FGameplayEffectSpecForRPC FromSpec; // 0x38
        struct FGameplayCueParameters CueParameters; // 0xb0

    };

    struct FMinimalGameplayCueReplicationProxy //ScriptStruct GameplayAbilities.MinimalGameplayCueReplicationProxy
    {
    //Children Prop Count (Fields): 1
    public:

        class UAbilitySystemComponent* Owner; // 0x1b0

    };

    struct FGameplayCueTag //ScriptStruct GameplayAbilities.GameplayCueTag
    {
    //Children Prop Count (Fields): 1
    public:

        struct FGameplayTag GameplayCueTag; // 0x0

    };

    struct FGameplayCueObjectLibrary //ScriptStruct GameplayAbilities.GameplayCueObjectLibrary
    {
    //Children Prop Count (Fields): 8
    public:

        struct TArray<struct FString> Paths; // 0x0
        class UObjectLibrary* ActorObjectLibrary; // 0x30
        class UObjectLibrary* StaticObjectLibrary; // 0x38
        class UGameplayCueSet* CueSet; // 0x40
        bool bShouldSyncScan; // 0x4c
        bool bShouldAsyncLoad; // 0x4d
        bool bShouldSyncLoad; // 0x4e
        bool bHasBeenInitialized; // 0x4f

    };

    struct FGameplayCueNotifyData //ScriptStruct GameplayAbilities.GameplayCueNotifyData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FGameplayTag GameplayCueTag; // 0x0
        struct FSoftObjectPath GameplayCueNotifyObj; // 0x8
        class UObject* LoadedGameplayCueClass; // 0x20

    };

    struct FGameplayCueTranslationManager //ScriptStruct GameplayAbilities.GameplayCueTranslationManager
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FGameplayCueTranslatorNode> TranslationLUT; // 0x0
        struct TMap<struct FName, struct FGameplayCueTranslatorNodeIndex> TranslationNameToIndexMap; // 0x10
        class UGameplayTagsManager* TagManager; // 0x60

    };

    struct FGameplayCueTranslatorNodeIndex //ScriptStruct GameplayAbilities.GameplayCueTranslatorNodeIndex
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t Index; // 0x0

    };

    struct FGameplayCueTranslatorNode //ScriptStruct GameplayAbilities.GameplayCueTranslatorNode
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<struct FGameplayCueTranslationLink> Links; // 0x0
        struct FGameplayCueTranslatorNodeIndex CachedIndex; // 0x10
        struct FGameplayTag CachedGameplayTag; // 0x14
        struct FName CachedGameplayTagName; // 0x1c

    };

    struct FGameplayCueTranslationLink //ScriptStruct GameplayAbilities.GameplayCueTranslationLink
    {
    //Children Prop Count (Fields): 1
    public:

        class UGameplayCueTranslator* RulesCDO; // 0x0

    };

    struct FActiveGameplayEffectQuery //ScriptStruct GameplayAbilities.ActiveGameplayEffectQuery
    {
    public:


    };

    struct FInheritedTagContainer //ScriptStruct GameplayAbilities.InheritedTagContainer
    {
    //Children Prop Count (Fields): 3
    public:

        struct FGameplayTagContainer CombinedTags; // 0x0
        struct FGameplayTagContainer Added; // 0x20
        struct FGameplayTagContainer Removed; // 0x40

    };

    struct FGameplayEffectCue //ScriptStruct GameplayAbilities.GameplayEffectCue
    {
    //Children Prop Count (Fields): 4
    public:

        struct FGameplayAttribute MagnitudeAttribute; // 0x0
        float MinLevel; // 0x38
        float MaxLevel; // 0x3c
        struct FGameplayTagContainer GameplayCueTags; // 0x40

    };

    struct FGameplayModifierInfo //ScriptStruct GameplayAbilities.GameplayModifierInfo
    {
    //Children Prop Count (Fields): 9
    public:

        struct FGameplayAttribute Attribute; // 0x0
        enum class EGameplayModOp ModifierOp; // 0x38
        enum class EGameplayModsSelector ModifiersSelector; // 0x39
        char Priority; // 0x3a
        struct FScalableFloat Magnitude; // 0x40
        struct FGameplayEffectModifierMagnitude ModifierMagnitude; // 0x60
        struct FGameplayModEvaluationChannelSettings EvaluationChannelSettings; // 0x208
        struct FGameplayTagRequirements SourceTags; // 0x210
        struct FGameplayTagRequirements TargetTags; // 0x250

    };

    struct FGameplayTagRequirements //ScriptStruct GameplayAbilities.GameplayTagRequirements
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGameplayTagContainer RequireTags; // 0x0
        struct FGameplayTagContainer IgnoreTags; // 0x20

    };

    struct FGameplayModEvaluationChannelSettings //ScriptStruct GameplayAbilities.GameplayModEvaluationChannelSettings
    {
    //Children Prop Count (Fields): 1
    public:

        enum class EGameplayModEvaluationChannel Channel; // 0x0

    };

    struct FGameplayEffectModifierMagnitude //ScriptStruct GameplayAbilities.GameplayEffectModifierMagnitude
    {
    //Children Prop Count (Fields): 5
    public:

        enum class EGameplayEffectMagnitudeCalculation MagnitudeCalculationType; // 0x0
        struct FScalableFloat ScalableFloatMagnitude; // 0x8
        struct FAttributeBasedFloat AttributeBasedMagnitude; // 0x28
        struct FCustomCalculationBasedFloat CustomMagnitude; // 0x120
        struct FSetByCallerFloat SetByCallerMagnitude; // 0x198

    };

    struct FSetByCallerFloat //ScriptStruct GameplayAbilities.SetByCallerFloat
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName DataName; // 0x0
        struct FGameplayTag DataTag; // 0x8

    };

    struct FCustomCalculationBasedFloat //ScriptStruct GameplayAbilities.CustomCalculationBasedFloat
    {
    //Children Prop Count (Fields): 5
    public:

        class UGameplayModMagnitudeCalculation* CalculationClassMagnitude; // 0x0
        struct FScalableFloat Coefficient; // 0x8
        struct FScalableFloat PreMultiplyAdditiveValue; // 0x28
        struct FScalableFloat PostMultiplyAdditiveValue; // 0x48
        struct FCurveTableRowHandle FinalLookupCurve; // 0x68

    };

    struct FAttributeBasedFloat //ScriptStruct GameplayAbilities.AttributeBasedFloat
    {
    //Children Prop Count (Fields): 9
    public:

        struct FScalableFloat Coefficient; // 0x0
        struct FScalableFloat PreMultiplyAdditiveValue; // 0x20
        struct FScalableFloat PostMultiplyAdditiveValue; // 0x40
        struct FGameplayEffectAttributeCaptureDefinition BackingAttribute; // 0x60
        struct FCurveTableRowHandle AttributeCurve; // 0xa0
        enum class EAttributeBasedFloatCalculationType AttributeCalculationType; // 0xb0
        enum class EGameplayModEvaluationChannel FinalChannel; // 0xb1
        struct FGameplayTagContainer SourceTagFilter; // 0xb8
        struct FGameplayTagContainer TargetTagFilter; // 0xd8

    };

    struct FGameplayEffectExecutionDefinition //ScriptStruct GameplayAbilities.GameplayEffectExecutionDefinition
    {
    //Children Prop Count (Fields): 5
    public:

        class UGameplayEffectExecutionCalculation* CalculationClass; // 0x0
        struct FGameplayTagContainer PassedInTags; // 0x8
        struct TArray<struct FGameplayEffectExecutionScopedModifierInfo> CalculationModifiers; // 0x28
        struct TArray<class UGameplayEffect*> ConditionalGameplayEffectClasses; // 0x38
        struct TArray<struct FConditionalGameplayEffect> ConditionalGameplayEffects; // 0x48

    };

    struct FConditionalGameplayEffect //ScriptStruct GameplayAbilities.ConditionalGameplayEffect
    {
    //Children Prop Count (Fields): 2
    public:

        class UGameplayEffect* EffectClass; // 0x0
        struct FGameplayTagContainer RequiredSourceTags; // 0x8

    };

    struct FGameplayEffectExecutionScopedModifierInfo //ScriptStruct GameplayAbilities.GameplayEffectExecutionScopedModifierInfo
    {
    //Children Prop Count (Fields): 10
    public:

        struct FGameplayEffectAttributeCaptureDefinition CapturedAttribute; // 0x0
        struct FGameplayTag TransientAggregatorIdentifier; // 0x40
        enum class EGameplayEffectScopedModifierAggregatorType AggregatorType; // 0x48
        enum class EGameplayModOp ModifierOp; // 0x49
        enum class EGameplayModsSelector ModifiersSelector; // 0x4a
        char Priority; // 0x4b
        struct FGameplayEffectModifierMagnitude ModifierMagnitude; // 0x50
        struct FGameplayModEvaluationChannelSettings EvaluationChannelSettings; // 0x1f8
        struct FGameplayTagRequirements SourceTags; // 0x200
        struct FGameplayTagRequirements TargetTags; // 0x240

    };

    struct FGameplayEffectCustomExecutionOutput //ScriptStruct GameplayAbilities.GameplayEffectCustomExecutionOutput
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<struct FGameplayModifierEvaluatedData> OutputModifiers; // 0x0
        char bTriggerConditionalGameplayEffects; // 0x10
        char bHandledStackCountManually; // 0x10
        char bHandledGameplayCuesManually; // 0x10

    };

    struct FGameplayModifierEvaluatedData //ScriptStruct GameplayAbilities.GameplayModifierEvaluatedData
    {
    //Children Prop Count (Fields): 8
    public:

        struct FGameplayAttribute Attribute; // 0x0
        enum class EGameplayModOp ModifierOp; // 0x38
        float Magnitude; // 0x3c
        char Priority; // 0x40
        enum class EGameplayModsSelector ModsSelector; // 0x41
        enum class EGameplayModEvaluationChannel ModsChannel; // 0x42
        struct FActiveGameplayEffectHandle Handle; // 0x58
        bool IsValid; // 0x60

    };

    struct FGameplayEffectCustomExecutionParameters //ScriptStruct GameplayAbilities.GameplayEffectCustomExecutionParameters
    {
    public:


    };

    struct FGameplayTagBlueprintPropertyMap //ScriptStruct GameplayAbilities.GameplayTagBlueprintPropertyMap
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FGameplayTagBlueprintPropertyMapping> PropertyMappings; // 0x10

    };

    struct FGameplayTagBlueprintPropertyMapping //ScriptStruct GameplayAbilities.GameplayTagBlueprintPropertyMapping
    {
    //Children Prop Count (Fields): 4
    public:

        struct FGameplayTag TagToMap; // 0x0
        struct TFieldPath<FProperty> PropertyToEdit; // 0x8
        struct FName PropertyName; // 0x28
        struct FGuid PropertyGuid; // 0x30

    };

    struct FGameplayEffectContext //ScriptStruct GameplayAbilities.GameplayEffectContext
    {
    //Children Prop Count (Fields): 11
    public:

        struct TWeakObjectPtr<struct AActor> Instigator; // 0x8
        struct TWeakObjectPtr<struct AActor> EffectCauser; // 0x10
        struct TWeakObjectPtr<struct UGameplayAbility> AbilityCDO; // 0x18
        struct TWeakObjectPtr<struct UGameplayAbility> AbilityInstanceNotReplicated; // 0x20
        int32_t AbilityLevel; // 0x28
        struct TWeakObjectPtr<struct UObject> SourceObject; // 0x2c
        struct TWeakObjectPtr<struct UAbilitySystemComponent> InstigatorAbilitySystemComponent; // 0x34
        struct TArray<struct TWeakObjectPtr<struct AActor>> Actors; // 0x40
        struct FVector WorldOrigin; // 0x60
        char bHasWorldOrigin; // 0x6c
        char bReplicateSourceObject; // 0x6c

    };

    struct FGameplayTagResponseTableEntry //ScriptStruct GameplayAbilities.GameplayTagResponseTableEntry
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGameplayTagReponsePair Positive; // 0x0
        struct FGameplayTagReponsePair Negative; // 0x28

    };

    struct FGameplayTagReponsePair //ScriptStruct GameplayAbilities.GameplayTagReponsePair
    {
    //Children Prop Count (Fields): 4
    public:

        struct FGameplayTag Tag; // 0x0
        class UGameplayEffect* ResponseGameplayEffect; // 0x8
        struct TArray<class UGameplayEffect*> ResponseGameplayEffects; // 0x10
        int32_t SoftCountCap; // 0x20

    };

    struct FAdaptorPolygon2Group //ScriptStruct EditableMesh.AdaptorPolygon2Group
    {
    //Children Prop Count (Fields): 3
    public:

        uint32_t RenderingSectionIndex; // 0x0
        int32_t MaterialIndex; // 0x4
        int32_t MaxTriangles; // 0x8

    };

    struct FAdaptorPolygon //ScriptStruct EditableMesh.AdaptorPolygon
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPolygonGroupID PolygonGroupID; // 0x0
        struct TArray<struct FAdaptorTriangleID> TriangulatedPolygonTriangleIndices; // 0x8

    };

    struct FElementID //ScriptStruct MeshDescription.ElementID
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t IDValue; // 0x0

    };

    struct FAdaptorTriangleID : FElementID //ScriptStruct EditableMesh.AdaptorTriangleID
    {
    public:


    };

    struct FPolygonGroupID : FElementID //ScriptStruct MeshDescription.PolygonGroupID
    {
    public:


    };

    struct FPolygonGroupForPolygon //ScriptStruct EditableMesh.PolygonGroupForPolygon
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPolygonID PolygonID; // 0x0
        struct FPolygonGroupID PolygonGroupID; // 0x4

    };

    struct FPolygonID : FElementID //ScriptStruct MeshDescription.PolygonID
    {
    public:


    };

    struct FPolygonGroupToCreate //ScriptStruct EditableMesh.PolygonGroupToCreate
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMeshElementAttributeList PolygonGroupAttributes; // 0x0
        struct FPolygonGroupID OriginalPolygonGroupID; // 0x10

    };

    struct FMeshElementAttributeList //ScriptStruct EditableMesh.MeshElementAttributeList
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FMeshElementAttributeData> Attributes; // 0x0

    };

    struct FMeshElementAttributeData //ScriptStruct EditableMesh.MeshElementAttributeData
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName AttributeName; // 0x0
        int32_t AttributeIndex; // 0x8
        struct FMeshElementAttributeValue AttributeValue; // 0x10

    };

    struct FMeshElementAttributeValue //ScriptStruct EditableMesh.MeshElementAttributeValue
    {
    public:


    };

    struct FVertexToMove //ScriptStruct EditableMesh.VertexToMove
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVertexID VertexID; // 0x0
        struct FVector NewVertexPosition; // 0x4

    };

    struct FVertexID : FElementID //ScriptStruct MeshDescription.VertexID
    {
    public:


    };

    struct FChangeVertexInstancesForPolygon //ScriptStruct EditableMesh.ChangeVertexInstancesForPolygon
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPolygonID PolygonID; // 0x0
        struct TArray<struct FVertexIndexAndInstanceID> PerimeterVertexIndicesAndInstanceIDs; // 0x8
        struct TArray<struct FVertexInstancesForPolygonHole> VertexIndicesAndInstanceIDsForEachHole; // 0x18

    };

    struct FVertexInstancesForPolygonHole //ScriptStruct EditableMesh.VertexInstancesForPolygonHole
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FVertexIndexAndInstanceID> VertexIndicesAndInstanceIDs; // 0x0

    };

    struct FVertexIndexAndInstanceID //ScriptStruct EditableMesh.VertexIndexAndInstanceID
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t ContourIndex; // 0x0
        struct FVertexInstanceID VertexInstanceID; // 0x4

    };

    struct FVertexInstanceID : FElementID //ScriptStruct MeshDescription.VertexInstanceID
    {
    public:


    };

    struct FVertexAttributesForPolygon //ScriptStruct EditableMesh.VertexAttributesForPolygon
    {
    //Children Prop Count (Fields): 3
    public:

        struct FPolygonID PolygonID; // 0x0
        struct TArray<struct FMeshElementAttributeList> PerimeterVertexAttributeLists; // 0x8
        struct TArray<struct FVertexAttributesForPolygonHole> VertexAttributeListsForEachHole; // 0x18

    };

    struct FVertexAttributesForPolygonHole //ScriptStruct EditableMesh.VertexAttributesForPolygonHole
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FMeshElementAttributeList> VertexAttributeList; // 0x0

    };

    struct FAttributesForEdge //ScriptStruct EditableMesh.AttributesForEdge
    {
    //Children Prop Count (Fields): 2
    public:

        struct FEdgeID EdgeID; // 0x0
        struct FMeshElementAttributeList EdgeAttributes; // 0x8

    };

    struct FEdgeID : FElementID //ScriptStruct MeshDescription.EdgeID
    {
    public:


    };

    struct FAttributesForVertexInstance //ScriptStruct EditableMesh.AttributesForVertexInstance
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVertexInstanceID VertexInstanceID; // 0x0
        struct FMeshElementAttributeList VertexInstanceAttributes; // 0x8

    };

    struct FAttributesForVertex //ScriptStruct EditableMesh.AttributesForVertex
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVertexID VertexID; // 0x0
        struct FMeshElementAttributeList VertexAttributes; // 0x8

    };

    struct FPolygonToSplit //ScriptStruct EditableMesh.PolygonToSplit
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPolygonID PolygonID; // 0x0
        struct TArray<struct FVertexPair> VertexPairsToSplitAt; // 0x8

    };

    struct FVertexPair //ScriptStruct EditableMesh.VertexPair
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVertexID VertexID0; // 0x0
        struct FVertexID VertexID1; // 0x4

    };

    struct FPolygonToCreate //ScriptStruct EditableMesh.PolygonToCreate
    {
    //Children Prop Count (Fields): 4
    public:

        struct FPolygonGroupID PolygonGroupID; // 0x0
        struct TArray<struct FVertexAndAttributes> PerimeterVertices; // 0x8
        struct FPolygonID OriginalPolygonID; // 0x18
        enum class EPolygonEdgeHardness PolygonEdgeHardness; // 0x1c

    };

    struct FVertexAndAttributes //ScriptStruct EditableMesh.VertexAndAttributes
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVertexInstanceID VertexInstanceID; // 0x0
        struct FVertexID VertexID; // 0x4
        struct FMeshElementAttributeList PolygonVertexAttributes; // 0x8

    };

    struct FEdgeToCreate //ScriptStruct EditableMesh.EdgeToCreate
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVertexID VertexID0; // 0x0
        struct FVertexID VertexID1; // 0x4
        struct FMeshElementAttributeList EdgeAttributes; // 0x8
        struct FEdgeID OriginalEdgeID; // 0x18

    };

    struct FVertexInstanceToCreate //ScriptStruct EditableMesh.VertexInstanceToCreate
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVertexID VertexID; // 0x0
        struct FMeshElementAttributeList VertexInstanceAttributes; // 0x8
        struct FVertexInstanceID OriginalVertexInstanceID; // 0x18

    };

    struct FVertexToCreate //ScriptStruct EditableMesh.VertexToCreate
    {
    //Children Prop Count (Fields): 2
    public:

        struct FMeshElementAttributeList VertexAttributes; // 0x0
        struct FVertexID OriginalVertexID; // 0x10

    };

    struct FSubdivisionLimitData //ScriptStruct EditableMesh.SubdivisionLimitData
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FVector> VertexPositions; // 0x0
        struct TArray<struct FSubdivisionLimitSection> Sections; // 0x10
        struct TArray<struct FSubdividedWireEdge> SubdividedWireEdges; // 0x20

    };

    struct FSubdividedWireEdge //ScriptStruct EditableMesh.SubdividedWireEdge
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t EdgeVertex0PositionIndex; // 0x0
        int32_t EdgeVertex1PositionIndex; // 0x4

    };

    struct FSubdivisionLimitSection //ScriptStruct EditableMesh.SubdivisionLimitSection
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FSubdividedQuad> SubdividedQuads; // 0x0

    };

    struct FSubdividedQuad //ScriptStruct EditableMesh.SubdividedQuad
    {
    //Children Prop Count (Fields): 4
    public:

        struct FSubdividedQuadVertex QuadVertex0; // 0x0
        struct FSubdividedQuadVertex QuadVertex1; // 0x34
        struct FSubdividedQuadVertex QuadVertex2; // 0x68
        struct FSubdividedQuadVertex QuadVertex3; // 0x9c

    };

    struct FSubdividedQuadVertex //ScriptStruct EditableMesh.SubdividedQuadVertex
    {
    //Children Prop Count (Fields): 7
    public:

        int32_t VertexPositionIndex; // 0x0
        struct FVector2D TextureCoordinate0; // 0x4
        struct FVector2D TextureCoordinate1; // 0xc
        struct FColor VertexColor; // 0x14
        struct FVector VertexNormal; // 0x18
        struct FVector VertexTangent; // 0x24
        float VertexBinormalSign; // 0x30

    };

    struct FRenderingPolygonGroup //ScriptStruct EditableMesh.RenderingPolygonGroup
    {
    //Children Prop Count (Fields): 3
    public:

        uint32_t RenderingSectionIndex; // 0x0
        int32_t MaterialIndex; // 0x4
        int32_t MaxTriangles; // 0x8

    };

    struct FRenderingPolygon //ScriptStruct EditableMesh.RenderingPolygon
    {
    //Children Prop Count (Fields): 2
    public:

        struct FPolygonGroupID PolygonGroupID; // 0x0
        struct TArray<struct FTriangleID> TriangulatedPolygonTriangleIndices; // 0x8

    };

    struct FTriangleID : FElementID //ScriptStruct MeshDescription.TriangleID
    {
    public:


    };

    struct FMovieSceneGeometryCollectionParams //ScriptStruct GeometryCollectionTracks.MovieSceneGeometryCollectionParams
    {
    //Children Prop Count (Fields): 4
    public:

        struct FSoftObjectPath GeometryCollectionCache; // 0x8
        struct FFrameNumber StartFrameOffset; // 0x20
        struct FFrameNumber EndFrameOffset; // 0x24
        float PlayRate; // 0x28

    };

    struct FMovieSceneGeometryCollectionSectionTemplate : FMovieSceneEvalTemplate //ScriptStruct GeometryCollectionTracks.MovieSceneGeometryCollectionSectionTemplate
    {
    //Children Prop Count (Fields): 1
    public:

        struct FMovieSceneGeometryCollectionSectionTemplateParameters Params; // 0x20

    };

    struct FMovieSceneGeometryCollectionSectionTemplateParameters : FMovieSceneGeometryCollectionParams //ScriptStruct GeometryCollectionTracks.MovieSceneGeometryCollectionSectionTemplateParameters
    {
    //Children Prop Count (Fields): 2
    public:

        struct FFrameNumber SectionStartTime; // 0x30
        struct FFrameNumber SectionEndTime; // 0x34

    };

    struct FUdpMockMessage //ScriptStruct UdpMessaging.UdpMockMessage
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<char> Data; // 0x0

    };

    struct FNodeHierarchyWithUserData //ScriptStruct AnimationCore.NodeHierarchyWithUserData
    {
    //Children Prop Count (Fields): 1
    public:

        struct FNodeHierarchyData Hierarchy; // 0x8

    };

    struct FNodeHierarchyData //ScriptStruct AnimationCore.NodeHierarchyData
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FNodeObject> Nodes; // 0x0
        struct TArray<struct FTransform> Transforms; // 0x10
        struct TMap<struct FName, int32_t> NodeNameToIndexMapping; // 0x20

    };

    struct FNodeObject //ScriptStruct AnimationCore.NodeObject
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Name; // 0x0
        struct FName ParentName; // 0x8

    };

    struct FAnimationHierarchy : FNodeHierarchyWithUserData //ScriptStruct ControlRig.AnimationHierarchy
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FConstraintNodeData> UserData; // 0x78

    };

    struct FConstraintNodeData //ScriptStruct ControlRig.ConstraintNodeData
    {
    //Children Prop Count (Fields): 4
    public:

        struct FTransform RelativeParent; // 0x0
        struct FConstraintOffset ConstraintOffset; // 0x30
        struct FName LinkedNode; // 0x90
        struct TArray<struct FTransformConstraint> Constraints; // 0x98

    };

    struct FTransformConstraint //ScriptStruct AnimationCore.TransformConstraint
    {
    //Children Prop Count (Fields): 5
    public:

        struct FConstraintDescription Operator; // 0x0
        struct FName SourceNode; // 0x10
        struct FName TargetNode; // 0x18
        float Weight; // 0x20
        bool bMaintainOffset; // 0x24

    };

    struct FConstraintDescription //ScriptStruct AnimationCore.ConstraintDescription
    {
    //Children Prop Count (Fields): 7
    public:

        bool bTranslation; // 0x0
        bool bRotation; // 0x1
        bool bScale; // 0x2
        bool bParent; // 0x3
        struct FFilterOptionPerAxis TranslationAxes; // 0x4
        struct FFilterOptionPerAxis RotationAxes; // 0x7
        struct FFilterOptionPerAxis ScaleAxes; // 0xa

    };

    struct FFilterOptionPerAxis //ScriptStruct AnimationCore.FilterOptionPerAxis
    {
    //Children Prop Count (Fields): 3
    public:

        bool bX; // 0x0
        bool bY; // 0x1
        bool bZ; // 0x2

    };

    struct FConstraintOffset //ScriptStruct AnimationCore.ConstraintOffset
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector Translation; // 0x0
        struct FQuat Rotation; // 0x10
        struct FVector Scale; // 0x20
        struct FTransform Parent; // 0x30

    };

    struct FAnimNode_Base //ScriptStruct Engine.AnimNode_Base
    {
    public:


    };

    struct FAnimNode_CustomProperty : FAnimNode_Base //ScriptStruct Engine.AnimNode_CustomProperty
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FName> SourcePropertyNames; // 0x10
        struct TArray<struct FName> DestPropertyNames; // 0x20
        class UObject* TargetInstance; // 0x30

    };

    struct FAnimNode_ControlRigBase : FAnimNode_CustomProperty //ScriptStruct ControlRig.AnimNode_ControlRigBase
    {
    //Children Prop Count (Fields): 8
    public:

        struct FPoseLink Source; // 0x58
        struct TMap<struct FName, uint16_t> ControlRigBoneMapping; // 0x68
        struct TMap<struct FName, uint16_t> ControlRigCurveMapping; // 0xb8
        struct TMap<struct FName, uint16_t> InputToCurveMappingUIDs; // 0x108
        struct TWeakObjectPtr<struct UNodeMappingContainer> NodeMappingContainer; // 0x158
        struct FControlRigIOSettings InputSettings; // 0x160
        struct FControlRigIOSettings OutputSettings; // 0x162
        bool bExecute; // 0x164

    };

    struct FControlRigIOSettings //ScriptStruct ControlRig.ControlRigIOSettings
    {
    //Children Prop Count (Fields): 2
    public:

        bool bUpdatePose; // 0x0
        bool bUpdateCurves; // 0x1

    };

    struct FPoseLinkBase //ScriptStruct Engine.PoseLinkBase
    {
    //Children Prop Count (Fields): 1
    public:

        int32_t LinkID; // 0x0

    };

    struct FPoseLink : FPoseLinkBase //ScriptStruct Engine.PoseLink
    {
    public:


    };

    struct FAnimNode_ControlRig : FAnimNode_ControlRigBase //ScriptStruct ControlRig.AnimNode_ControlRig
    {
    //Children Prop Count (Fields): 13
    public:

        class UControlRig* ControlRigClass; // 0x170
        class UControlRig* ControlRig; // 0x178
        float Alpha; // 0x180
        enum class EAnimAlphaInputType AlphaInputType; // 0x184
        char bAlphaBoolEnabled; // 0x185
        char bSetRefPoseFromSkeleton; // 0x185
        struct FInputScaleBias AlphaScaleBias; // 0x188
        struct FInputAlphaBoolBlend AlphaBoolBlend; // 0x190
        struct FName AlphaCurveName; // 0x1d8
        struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x1e0
        struct TMap<struct FName, struct FName> InputMapping; // 0x210
        struct TMap<struct FName, struct FName> OutputMapping; // 0x260
        int32_t LODThreshold; // 0x360

    };

    struct FInputScaleBiasClamp //ScriptStruct Engine.InputScaleBiasClamp
    {
    //Children Prop Count (Fields): 11
    public:

        bool bMapRange; // 0x0
        bool bClampResult; // 0x1
        bool bInterpResult; // 0x2
        struct FInputRange InRange; // 0x4
        struct FInputRange OutRange; // 0xc
        float Scale; // 0x14
        float Bias; // 0x18
        float ClampMin; // 0x1c
        float ClampMax; // 0x20
        float InterpSpeedIncreasing; // 0x24
        float InterpSpeedDecreasing; // 0x28

    };

    struct FInputRange //ScriptStruct Engine.InputRange
    {
    //Children Prop Count (Fields): 2
    public:

        float Min; // 0x0
        float Max; // 0x4

    };

    struct FInputAlphaBoolBlend //ScriptStruct Engine.InputAlphaBoolBlend
    {
    //Children Prop Count (Fields): 6
    public:

        float BlendInTime; // 0x0
        float BlendOutTime; // 0x4
        enum class EAlphaBlendOption BlendOption; // 0x8
        bool bInitialized; // 0x9
        class UCurveFloat* CustomCurve; // 0x10
        struct FAlphaBlend AlphaBlend; // 0x18

    };

    struct FAlphaBlend //ScriptStruct Engine.AlphaBlend
    {
    //Children Prop Count (Fields): 3
    public:

        class UCurveFloat* CustomCurve; // 0x0
        float BlendTime; // 0x8
        enum class EAlphaBlendOption BlendOption; // 0x24

    };

    struct FInputScaleBias //ScriptStruct Engine.InputScaleBias
    {
    //Children Prop Count (Fields): 2
    public:

        float Scale; // 0x0
        float Bias; // 0x4

    };

    struct FAnimNode_ControlRig_ExternalSource : FAnimNode_ControlRigBase //ScriptStruct ControlRig.AnimNode_ControlRig_ExternalSource
    {
    //Children Prop Count (Fields): 1
    public:

        struct TWeakObjectPtr<struct UControlRig> ControlRig; // 0x170

    };

    struct FAnimInstanceProxy //ScriptStruct Engine.AnimInstanceProxy
    {
    public:


    };

    struct FControlRigAnimInstanceProxy : FAnimInstanceProxy //ScriptStruct ControlRig.ControlRigAnimInstanceProxy
    {
    public:


    };

    struct FControlRigComponentMappedCurve //ScriptStruct ControlRig.ControlRigComponentMappedCurve
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Source; // 0x0
        struct FName Target; // 0x8

    };

    struct FControlRigComponentMappedBone //ScriptStruct ControlRig.ControlRigComponentMappedBone
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Source; // 0x0
        struct FName Target; // 0x8

    };

    struct FControlRigComponentMappedComponent //ScriptStruct ControlRig.ControlRigComponentMappedComponent
    {
    //Children Prop Count (Fields): 4
    public:

        class USceneComponent* Component; // 0x0
        struct FName ElementName; // 0x8
        enum class ERigElementType ElementType; // 0x10
        enum class EControlRigComponentMapDirection Direction; // 0x11

    };

    struct FControlRigComponentMappedElement //ScriptStruct ControlRig.ControlRigComponentMappedElement
    {
    //Children Prop Count (Fields): 12
    public:

        struct FComponentReference ComponentReference; // 0x0
        int32_t TransformIndex; // 0x28
        struct FName TransformName; // 0x2c
        enum class ERigElementType ElementType; // 0x34
        struct FName ElementName; // 0x38
        enum class EControlRigComponentMapDirection Direction; // 0x40
        struct FTransform Offset; // 0x50
        float Weight; // 0x80
        enum class EControlRigComponentSpace Space; // 0x84
        class USceneComponent* SceneComponent; // 0x88
        int32_t ElementIndex; // 0x90
        int32_t SubIndex; // 0x94

    };

    struct FComponentReference //ScriptStruct Engine.ComponentReference
    {
    //Children Prop Count (Fields): 3
    public:

        class AActor* OtherActor; // 0x0
        struct FName ComponentProperty; // 0x8
        struct FString PathToComponent; // 0x10

    };

    struct FRigVMExecuteContext //ScriptStruct RigVM.RigVMExecuteContext
    {
    public:


    };

    struct FControlRigExecuteContext : FRigVMExecuteContext //ScriptStruct ControlRig.ControlRigExecuteContext
    {
    public:


    };

    struct FControlRigDrawContainer //ScriptStruct ControlRig.ControlRigDrawContainer
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FControlRigDrawInstruction> Instructions; // 0x8

    };

    struct FControlRigDrawInstruction //ScriptStruct ControlRig.ControlRigDrawInstruction
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName Name; // 0x0
        enum class EControlRigDrawSettings PrimitiveType; // 0x8
        struct TArray<struct FVector> Positions; // 0x10
        struct FLinearColor Color; // 0x20
        float Thickness; // 0x30
        struct FTransform Transform; // 0x40

    };

    struct FControlRigDrawInterface : FControlRigDrawContainer //ScriptStruct ControlRig.ControlRigDrawInterface
    {
    public:


    };

    struct FGizmoActorCreationParam //ScriptStruct ControlRig.GizmoActorCreationParam
    {
    public:


    };

    struct FControlRigGizmoDefinition //ScriptStruct ControlRig.ControlRigGizmoDefinition
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName GizmoName; // 0x0
        struct TSoftObjectPtr<UStaticMesh> StaticMesh; // 0x8
        struct FTransform Transform; // 0x30

    };

    struct FControlRigLayerInstanceProxy : FAnimInstanceProxy //ScriptStruct ControlRig.ControlRigLayerInstanceProxy
    {
    public:


    };

    struct FAnimNode_ControlRigInputPose : FAnimNode_Base //ScriptStruct ControlRig.AnimNode_ControlRigInputPose
    {
    //Children Prop Count (Fields): 1
    public:

        struct FPoseLink InputPose; // 0x10

    };

    struct FCRFourPointBezier //ScriptStruct ControlRig.CRFourPointBezier
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector A; // 0x0
        struct FVector B; // 0xc
        struct FVector C; // 0x18
        struct FVector D; // 0x24

    };

    struct FControlRigSequenceObjectReferenceMap //ScriptStruct ControlRig.ControlRigSequenceObjectReferenceMap
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FGuid> BindingIds; // 0x0
        struct TArray<struct FControlRigSequenceObjectReferences> References; // 0x10

    };

    struct FControlRigSequenceObjectReferences //ScriptStruct ControlRig.ControlRigSequenceObjectReferences
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FControlRigSequenceObjectReference> Array; // 0x0

    };

    struct FControlRigSequenceObjectReference //ScriptStruct ControlRig.ControlRigSequenceObjectReference
    {
    //Children Prop Count (Fields): 1
    public:

        class UControlRig* ControlRigClass; // 0x0

    };

    struct FAnimSequencerInstanceProxy : FAnimInstanceProxy //ScriptStruct AnimGraphRuntime.AnimSequencerInstanceProxy
    {
    public:


    };

    struct FControlRigSequencerAnimInstanceProxy : FAnimSequencerInstanceProxy //ScriptStruct ControlRig.ControlRigSequencerAnimInstanceProxy
    {
    public:


    };

    struct FControlRigSettingsPerPinBool //ScriptStruct ControlRig.ControlRigSettingsPerPinBool
    {
    //Children Prop Count (Fields): 1
    public:

        struct TMap<struct FString, bool> Values; // 0x0

    };

    struct FControlRigValidationContext //ScriptStruct ControlRig.ControlRigValidationContext
    {
    public:


    };

    struct FCRSimContainer //ScriptStruct ControlRig.CRSimContainer
    {
    //Children Prop Count (Fields): 3
    public:

        float TimeStep; // 0x8
        float AccumulatedTime; // 0xc
        float TimeLeftForStep; // 0x10

    };

    struct FCRSimLinearSpring //ScriptStruct ControlRig.CRSimLinearSpring
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t SubjectA; // 0x0
        int32_t SubjectB; // 0x4
        float Coefficient; // 0x8
        float Equilibrium; // 0xc

    };

    struct FCRSimPoint //ScriptStruct ControlRig.CRSimPoint
    {
    //Children Prop Count (Fields): 6
    public:

        float Mass; // 0x0
        float Size; // 0x4
        float LinearDamping; // 0x8
        float InheritMotion; // 0xc
        struct FVector position; // 0x10
        struct FVector LinearVelocity; // 0x1c

    };

    struct FCRSimPointConstraint //ScriptStruct ControlRig.CRSimPointConstraint
    {
    //Children Prop Count (Fields): 5
    public:

        enum class ECRSimConstraintType Type; // 0x0
        int32_t SubjectA; // 0x4
        int32_t SubjectB; // 0x8
        struct FVector DataA; // 0xc
        struct FVector DataB; // 0x18

    };

    struct FCRSimPointContainer : FCRSimContainer //ScriptStruct ControlRig.CRSimPointContainer
    {
    //Children Prop Count (Fields): 6
    public:

        struct TArray<struct FCRSimPoint> Points; // 0x18
        struct TArray<struct FCRSimLinearSpring> Springs; // 0x28
        struct TArray<struct FCRSimPointForce> Forces; // 0x38
        struct TArray<struct FCRSimSoftCollision> CollisionVolumes; // 0x48
        struct TArray<struct FCRSimPointConstraint> Constraints; // 0x58
        struct TArray<struct FCRSimPoint> PreviousStep; // 0x68

    };

    struct FCRSimSoftCollision //ScriptStruct ControlRig.CRSimSoftCollision
    {
    //Children Prop Count (Fields): 7
    public:

        struct FTransform Transform; // 0x0
        enum class ECRSimSoftCollisionType ShapeType; // 0x30
        float MinimumDistance; // 0x34
        float MaximumDistance; // 0x38
        enum class EControlRigAnimEasingType FalloffType; // 0x3c
        float Coefficient; // 0x40
        bool bInverted; // 0x44

    };

    struct FCRSimPointForce //ScriptStruct ControlRig.CRSimPointForce
    {
    //Children Prop Count (Fields): 4
    public:

        enum class ECRSimPointForceType ForceType; // 0x0
        struct FVector Vector; // 0x4
        float Coefficient; // 0x10
        bool bNormalize; // 0x14

    };

    struct FMovieSceneSequenceInstanceData //ScriptStruct MovieScene.MovieSceneSequenceInstanceData
    {
    public:


    };

    struct FMovieSceneControlRigInstanceData : FMovieSceneSequenceInstanceData //ScriptStruct ControlRig.MovieSceneControlRigInstanceData
    {
    //Children Prop Count (Fields): 5
    public:

        bool bAdditive; // 0x8
        bool bApplyBoneFilter; // 0x9
        struct FInputBlendPose BoneFilter; // 0x10
        struct FMovieSceneFloatChannel Weight; // 0x20
        struct FMovieSceneEvaluationOperand Operand; // 0xc0

    };

    struct FMovieSceneEvaluationOperand //ScriptStruct MovieScene.MovieSceneEvaluationOperand
    {
    //Children Prop Count (Fields): 2
    public:

        struct FGuid ObjectBindingID; // 0x0
        struct FMovieSceneSequenceID SequenceID; // 0x10

    };

    struct FMovieSceneSequenceID //ScriptStruct MovieScene.MovieSceneSequenceID
    {
    //Children Prop Count (Fields): 1
    public:

        uint32_t Value; // 0x0

    };

    struct FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneChannel
    {
    public:


    };

    struct FMovieSceneFloatChannel : FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneFloatChannel
    {
    //Children Prop Count (Fields): 8
    public:

        enum class ERichCurveExtrapolation PreInfinityExtrap; // 0x8
        enum class ERichCurveExtrapolation PostInfinityExtrap; // 0x9
        struct TArray<struct FFrameNumber> Times; // 0x10
        struct TArray<struct FMovieSceneFloatValue> Values; // 0x20
        float DefaultValue; // 0x30
        bool bHasDefaultValue; // 0x34
        struct FMovieSceneKeyHandleMap KeyHandles; // 0x38
        struct FFrameRate TickResolution; // 0x98

    };

    struct FKeyHandleLookupTable //ScriptStruct Engine.KeyHandleLookupTable
    {
    public:


    };

    struct FMovieSceneKeyHandleMap : FKeyHandleLookupTable //ScriptStruct MovieScene.MovieSceneKeyHandleMap
    {
    public:


    };

    struct FMovieSceneFloatValue //ScriptStruct MovieScene.MovieSceneFloatValue
    {
    //Children Prop Count (Fields): 5
    public:

        float Value; // 0x0
        struct FMovieSceneTangentData Tangent; // 0x4
        enum class ERichCurveInterpMode InterpMode; // 0x18
        enum class ERichCurveTangentMode TangentMode; // 0x19
        char PaddingByte; // 0x1a

    };

    struct FMovieSceneTangentData //ScriptStruct MovieScene.MovieSceneTangentData
    {
    //Children Prop Count (Fields): 5
    public:

        float ArriveTangent; // 0x0
        float LeaveTangent; // 0x4
        float ArriveTangentWeight; // 0x8
        float LeaveTangentWeight; // 0xc
        enum class ERichCurveTangentWeightMode TangentWeightMode; // 0x10

    };

    struct FInputBlendPose //ScriptStruct Engine.InputBlendPose
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FBranchFilter> BranchFilters; // 0x0

    };

    struct FBranchFilter //ScriptStruct Engine.BranchFilter
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName BoneName; // 0x0
        int32_t BlendDepth; // 0x8

    };

    struct FChannelMapInfo //ScriptStruct ControlRig.ChannelMapInfo
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t ControlIndex; // 0x0
        int32_t TotalChannelIndex; // 0x4
        int32_t ChannelIndex; // 0x8
        int32_t ParentControlIndex; // 0xc
        struct FName ChannelTypeName; // 0x10

    };

    struct FIntegerParameterNameAndCurve //ScriptStruct ControlRig.IntegerParameterNameAndCurve
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName ParameterName; // 0x0
        struct FMovieSceneIntegerChannel ParameterCurve; // 0x8

    };

    struct FMovieSceneIntegerChannel : FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneIntegerChannel
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<struct FFrameNumber> Times; // 0x8
        int32_t DefaultValue; // 0x18
        bool bHasDefaultValue; // 0x1c
        struct TArray<int32_t> Values; // 0x20

    };

    struct FEnumParameterNameAndCurve //ScriptStruct ControlRig.EnumParameterNameAndCurve
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName ParameterName; // 0x0
        struct FMovieSceneByteChannel ParameterCurve; // 0x8

    };

    struct FMovieSceneByteChannel : FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneByteChannel
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FFrameNumber> Times; // 0x8
        char DefaultValue; // 0x18
        bool bHasDefaultValue; // 0x19
        struct TArray<char> Values; // 0x20
        class UEnum* Enum; // 0x30

    };

    struct FMovieSceneParameterSectionTemplate : FMovieSceneEvalTemplate //ScriptStruct MovieSceneTracks.MovieSceneParameterSectionTemplate
    {
    //Children Prop Count (Fields): 6
    public:

        struct TArray<struct FScalarParameterNameAndCurve> Scalars; // 0x20
        struct TArray<struct FBoolParameterNameAndCurve> Bools; // 0x30
        struct TArray<struct FVector2DParameterNameAndCurves> Vector2Ds; // 0x40
        struct TArray<struct FVectorParameterNameAndCurves> Vectors; // 0x50
        struct TArray<struct FColorParameterNameAndCurves> Colors; // 0x60
        struct TArray<struct FTransformParameterNameAndCurves> Transforms; // 0x70

    };

    struct FTransformParameterNameAndCurves //ScriptStruct MovieSceneTracks.TransformParameterNameAndCurves
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName ParameterName; // 0x0
        struct FMovieSceneFloatChannel Translation; // 0x8
        struct FMovieSceneFloatChannel Rotation; // 0x1e8
        struct FMovieSceneFloatChannel Scale; // 0x3c8

    };

    struct FColorParameterNameAndCurves //ScriptStruct MovieSceneTracks.ColorParameterNameAndCurves
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName ParameterName; // 0x0
        struct FMovieSceneFloatChannel RedCurve; // 0x8
        struct FMovieSceneFloatChannel GreenCurve; // 0xa8
        struct FMovieSceneFloatChannel BlueCurve; // 0x148
        struct FMovieSceneFloatChannel AlphaCurve; // 0x1e8

    };

    struct FVectorParameterNameAndCurves //ScriptStruct MovieSceneTracks.VectorParameterNameAndCurves
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName ParameterName; // 0x0
        struct FMovieSceneFloatChannel XCurve; // 0x8
        struct FMovieSceneFloatChannel YCurve; // 0xa8
        struct FMovieSceneFloatChannel ZCurve; // 0x148

    };

    struct FVector2DParameterNameAndCurves //ScriptStruct MovieSceneTracks.Vector2DParameterNameAndCurves
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName ParameterName; // 0x0
        struct FMovieSceneFloatChannel XCurve; // 0x8
        struct FMovieSceneFloatChannel YCurve; // 0xa8

    };

    struct FBoolParameterNameAndCurve //ScriptStruct MovieSceneTracks.BoolParameterNameAndCurve
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName ParameterName; // 0x0
        struct FMovieSceneBoolChannel ParameterCurve; // 0x8

    };

    struct FMovieSceneBoolChannel : FMovieSceneChannel //ScriptStruct MovieScene.MovieSceneBoolChannel
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<struct FFrameNumber> Times; // 0x8
        bool DefaultValue; // 0x18
        bool bHasDefaultValue; // 0x19
        struct TArray<bool> Values; // 0x20

    };

    struct FScalarParameterNameAndCurve //ScriptStruct MovieSceneTracks.ScalarParameterNameAndCurve
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName ParameterName; // 0x0
        struct FMovieSceneFloatChannel ParameterCurve; // 0x8

    };

    struct FMovieSceneControlRigParameterTemplate : FMovieSceneParameterSectionTemplate //ScriptStruct ControlRig.MovieSceneControlRigParameterTemplate
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FEnumParameterNameAndCurve> Enums; // 0x80
        struct TArray<struct FIntegerParameterNameAndCurve> Integers; // 0x90

    };

    struct FRigBoneHierarchy //ScriptStruct ControlRig.RigBoneHierarchy
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FRigBone> Bones; // 0x20
        struct TMap<struct FName, int32_t> NameToIndexMapping; // 0x30
        struct TArray<struct FName> Selection; // 0x80

    };

    struct FRigElement //ScriptStruct ControlRig.RigElement
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Name; // 0x8
        int32_t Index; // 0x10

    };

    struct FRigBone : FRigElement //ScriptStruct ControlRig.RigBone
    {
    //Children Prop Count (Fields): 7
    public:

        struct FName ParentName; // 0x18
        int32_t ParentIndex; // 0x20
        struct FTransform InitialTransform; // 0x30
        struct FTransform GlobalTransform; // 0x60
        struct FTransform LocalTransform; // 0x90
        struct TArray<int32_t> Dependents; // 0xc0
        enum class ERigBoneType Type; // 0xd0

    };

    struct FRigControlHierarchy //ScriptStruct ControlRig.RigControlHierarchy
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FRigControl> Controls; // 0x98
        struct TMap<struct FName, int32_t> NameToIndexMapping; // 0xa8
        struct TArray<struct FName> Selection; // 0xf8

    };

    struct FRigControl : FRigElement //ScriptStruct ControlRig.RigControl
    {
    //Children Prop Count (Fields): 26
    public:

        enum class ERigControlType ControlType; // 0x18
        struct FName DisplayName; // 0x1c
        struct FName ParentName; // 0x24
        int32_t ParentIndex; // 0x2c
        struct FName SpaceName; // 0x30
        int32_t SpaceIndex; // 0x38
        struct FTransform OffsetTransform; // 0x40
        struct FRigControlValue InitialValue; // 0x70
        struct FRigControlValue Value; // 0xf0
        enum class ERigControlAxis PrimaryAxis; // 0x170
        bool bIsCurve; // 0x171
        bool bAnimatable; // 0x172
        bool bLimitTranslation; // 0x173
        bool bLimitRotation; // 0x174
        bool bLimitScale; // 0x175
        bool bDrawLimits; // 0x176
        struct FRigControlValue MinimumValue; // 0x180
        struct FRigControlValue MaximumValue; // 0x200
        bool bGizmoEnabled; // 0x280
        bool bGizmoVisible; // 0x281
        struct FName GizmoName; // 0x284
        struct FTransform GizmoTransform; // 0x290
        struct FLinearColor GizmoColor; // 0x2c0
        struct TArray<int32_t> Dependents; // 0x2d0
        bool bIsTransientControl; // 0x2e0
        class UEnum* ControlEnum; // 0x2e8

    };

    struct FRigControlValue //ScriptStruct ControlRig.RigControlValue
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRigControlValueStorage FloatStorage; // 0x0
        struct FTransform Storage; // 0x50

    };

    struct FRigControlValueStorage //ScriptStruct ControlRig.RigControlValueStorage
    {
    //Children Prop Count (Fields): 17
    public:

        float Float00; // 0x0
        float Float01; // 0x4
        float Float02; // 0x8
        float Float03; // 0xc
        float Float10; // 0x10
        float Float11; // 0x14
        float Float12; // 0x18
        float Float13; // 0x1c
        float Float20; // 0x20
        float Float21; // 0x24
        float Float22; // 0x28
        float Float23; // 0x2c
        float Float30; // 0x30
        float Float31; // 0x34
        float Float32; // 0x38
        float Float33; // 0x3c
        bool bValid; // 0x40

    };

    struct FRigCurveContainer //ScriptStruct ControlRig.RigCurveContainer
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FRigCurve> Curves; // 0x20
        struct TMap<struct FName, int32_t> NameToIndexMapping; // 0x30
        struct TArray<struct FName> Selection; // 0x80

    };

    struct FRigCurve : FRigElement //ScriptStruct ControlRig.RigCurve
    {
    //Children Prop Count (Fields): 1
    public:

        float Value; // 0x18

    };

    struct FCachedRigElement //ScriptStruct ControlRig.CachedRigElement
    {
    //Children Prop Count (Fields): 3
    public:

        struct FRigElementKey Key; // 0x0
        uint16_t Index; // 0xc
        int32_t ContainerVersion; // 0x10

    };

    struct FRigElementKey //ScriptStruct ControlRig.RigElementKey
    {
    //Children Prop Count (Fields): 2
    public:

        enum class ERigElementType Type; // 0x0
        struct FName Name; // 0x4

    };

    struct FRigHierarchyRef //ScriptStruct ControlRig.RigHierarchyRef
    {
    public:


    };

    struct FRigHierarchyContainer //ScriptStruct ControlRig.RigHierarchyContainer
    {
    //Children Prop Count (Fields): 5
    public:

        struct FRigBoneHierarchy BoneHierarchy; // 0x0
        struct FRigSpaceHierarchy SpaceHierarchy; // 0x98
        struct FRigControlHierarchy ControlHierarchy; // 0x128
        struct FRigCurveContainer CurveContainer; // 0x230
        int32_t Version; // 0x2c8

    };

    struct FRigSpaceHierarchy //ScriptStruct ControlRig.RigSpaceHierarchy
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FRigSpace> Spaces; // 0x20
        struct TMap<struct FName, int32_t> NameToIndexMapping; // 0x30
        struct TArray<struct FName> Selection; // 0x80

    };

    struct FRigSpace : FRigElement //ScriptStruct ControlRig.RigSpace
    {
    //Children Prop Count (Fields): 5
    public:

        enum class ERigSpaceType SpaceType; // 0x18
        struct FName ParentName; // 0x1c
        int32_t ParentIndex; // 0x24
        struct FTransform InitialTransform; // 0x30
        struct FTransform LocalTransform; // 0x60

    };

    struct FRigMirrorSettings //ScriptStruct ControlRig.RigMirrorSettings
    {
    //Children Prop Count (Fields): 4
    public:

        enum class EAxis MirrorAxis; // 0x0
        enum class EAxis AxisToFlip; // 0x1
        struct FString OldName; // 0x8
        struct FString NewName; // 0x18

    };

    struct FRigHierarchyCopyPasteContent //ScriptStruct ControlRig.RigHierarchyCopyPasteContent
    {
    //Children Prop Count (Fields): 4
    public:

        struct TArray<enum class ERigElementType> Types; // 0x0
        struct TArray<struct FString> Contents; // 0x10
        struct TArray<struct FTransform> LocalTransforms; // 0x20
        struct TArray<struct FTransform> GlobalTransforms; // 0x30

    };

    struct FRigEventContext //ScriptStruct ControlRig.RigEventContext
    {
    public:


    };

    struct FRigElementKeyCollection //ScriptStruct ControlRig.RigElementKeyCollection
    {
    public:


    };

    struct FRigControlModifiedContext //ScriptStruct ControlRig.RigControlModifiedContext
    {
    public:


    };

    struct FRigPose //ScriptStruct ControlRig.RigPose
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FRigPoseElement> Elements; // 0x0

    };

    struct FRigPoseElement //ScriptStruct ControlRig.RigPoseElement
    {
    //Children Prop Count (Fields): 4
    public:

        struct FCachedRigElement Index; // 0x0
        struct FTransform GlobalTransform; // 0x20
        struct FTransform LocalTransform; // 0x50
        float CurveValue; // 0x80

    };

    struct FRigInfluenceMapPerEvent //ScriptStruct ControlRig.RigInfluenceMapPerEvent
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FRigInfluenceMap> Maps; // 0x0
        struct TMap<struct FName, int32_t> EventToIndex; // 0x10

    };

    struct FRigInfluenceMap //ScriptStruct ControlRig.RigInfluenceMap
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName EventName; // 0x0
        struct TArray<struct FRigInfluenceEntry> Entries; // 0x8
        struct TMap<struct FRigElementKey, int32_t> KeyToIndex; // 0x18

    };

    struct FRigInfluenceEntry //ScriptStruct ControlRig.RigInfluenceEntry
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRigElementKey Source; // 0x0
        struct TArray<struct FRigElementKey> AffectedList; // 0x10

    };

    struct FRigInfluenceEntryModifier //ScriptStruct ControlRig.RigInfluenceEntryModifier
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FRigElementKey> AffectedList; // 0x0

    };

    struct FRigVMStruct //ScriptStruct RigVM.RigVMStruct
    {
    public:


    };

    struct FRigUnit : FRigVMStruct //ScriptStruct ControlRig.RigUnit
    {
    public:


    };

    struct FRigUnitMutable : FRigUnit //ScriptStruct ControlRig.RigUnitMutable
    {
    //Children Prop Count (Fields): 1
    public:

        struct FControlRigExecuteContext ExecuteContext; // 0x8

    };

    struct FRigUnit_SimBase : FRigUnit //ScriptStruct ControlRig.RigUnit_SimBase
    {
    public:


    };

    struct FRigUnit_AccumulateVectorRange : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateVectorRange
    {
    //Children Prop Count (Fields): 5
    public:

        struct FVector Value; // 0x8
        struct FVector Minimum; // 0x14
        struct FVector Maximum; // 0x20
        struct FVector AccumulatedMinimum; // 0x2c
        struct FVector AccumulatedMaximum; // 0x38

    };

    struct FRigUnit_AccumulateFloatRange : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateFloatRange
    {
    //Children Prop Count (Fields): 5
    public:

        float Value; // 0x8
        float Minimum; // 0xc
        float Maximum; // 0x10
        float AccumulatedMinimum; // 0x14
        float AccumulatedMaximum; // 0x18

    };

    struct FRigUnit_AccumulateTransformLerp : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateTransformLerp
    {
    //Children Prop Count (Fields): 6
    public:

        struct FTransform TargetValue; // 0x10
        struct FTransform InitialValue; // 0x40
        float Blend; // 0x70
        bool bIntegrateDeltaTime; // 0x74
        struct FTransform Result; // 0x80
        struct FTransform AccumulatedValue; // 0xb0

    };

    struct FRigUnit_AccumulateQuatLerp : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateQuatLerp
    {
    //Children Prop Count (Fields): 6
    public:

        struct FQuat TargetValue; // 0x10
        struct FQuat InitialValue; // 0x20
        float Blend; // 0x30
        bool bIntegrateDeltaTime; // 0x34
        struct FQuat Result; // 0x40
        struct FQuat AccumulatedValue; // 0x50

    };

    struct FRigUnit_AccumulateVectorLerp : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateVectorLerp
    {
    //Children Prop Count (Fields): 6
    public:

        struct FVector TargetValue; // 0x8
        struct FVector InitialValue; // 0x14
        float Blend; // 0x20
        bool bIntegrateDeltaTime; // 0x24
        struct FVector Result; // 0x28
        struct FVector AccumulatedValue; // 0x34

    };

    struct FRigUnit_AccumulateFloatLerp : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateFloatLerp
    {
    //Children Prop Count (Fields): 6
    public:

        float TargetValue; // 0x8
        float InitialValue; // 0xc
        float Blend; // 0x10
        bool bIntegrateDeltaTime; // 0x14
        float Result; // 0x18
        float AccumulatedValue; // 0x1c

    };

    struct FRigUnit_AccumulateTransformMul : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateTransformMul
    {
    //Children Prop Count (Fields): 6
    public:

        struct FTransform Multiplier; // 0x10
        struct FTransform InitialValue; // 0x40
        bool bFlipOrder; // 0x70
        bool bIntegrateDeltaTime; // 0x71
        struct FTransform Result; // 0x80
        struct FTransform AccumulatedValue; // 0xb0

    };

    struct FRigUnit_AccumulateQuatMul : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateQuatMul
    {
    //Children Prop Count (Fields): 6
    public:

        struct FQuat Multiplier; // 0x10
        struct FQuat InitialValue; // 0x20
        bool bFlipOrder; // 0x30
        bool bIntegrateDeltaTime; // 0x31
        struct FQuat Result; // 0x40
        struct FQuat AccumulatedValue; // 0x50

    };

    struct FRigUnit_AccumulateVectorMul : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateVectorMul
    {
    //Children Prop Count (Fields): 5
    public:

        struct FVector Multiplier; // 0x8
        struct FVector InitialValue; // 0x14
        bool bIntegrateDeltaTime; // 0x20
        struct FVector Result; // 0x24
        struct FVector AccumulatedValue; // 0x30

    };

    struct FRigUnit_AccumulateFloatMul : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateFloatMul
    {
    //Children Prop Count (Fields): 5
    public:

        float Multiplier; // 0x8
        float InitialValue; // 0xc
        bool bIntegrateDeltaTime; // 0x10
        float Result; // 0x14
        float AccumulatedValue; // 0x18

    };

    struct FRigUnit_AccumulateVectorAdd : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateVectorAdd
    {
    //Children Prop Count (Fields): 5
    public:

        struct FVector Increment; // 0x8
        struct FVector InitialValue; // 0x14
        bool bIntegrateDeltaTime; // 0x20
        struct FVector Result; // 0x24
        struct FVector AccumulatedValue; // 0x30

    };

    struct FRigUnit_AccumulateFloatAdd : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AccumulateFloatAdd
    {
    //Children Prop Count (Fields): 5
    public:

        float Increment; // 0x8
        float InitialValue; // 0xc
        bool bIntegrateDeltaTime; // 0x10
        float Result; // 0x14
        float AccumulatedValue; // 0x18

    };

    struct FRigUnit_AddBoneTransform : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_AddBoneTransform
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName Bone; // 0x68
        struct FTransform Transform; // 0x70
        float Weight; // 0xa0
        bool bPostMultiply; // 0xa4
        bool bPropagateToChildren; // 0xa5
        struct FCachedRigElement CachedBone; // 0xa8

    };

    struct FRigUnit_HighlevelBaseMutable : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_HighlevelBaseMutable
    {
    public:


    };

    struct FRigUnit_AimItem : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_AimItem
    {
    //Children Prop Count (Fields): 8
    public:

        struct FRigElementKey item; // 0x68
        struct FRigUnit_AimItem_Target Primary; // 0x74
        struct FRigUnit_AimItem_Target Secondary; // 0xa0
        float Weight; // 0xcc
        struct FRigUnit_AimBone_DebugSettings DebugSettings; // 0xd0
        struct FCachedRigElement CachedItem; // 0x110
        struct FCachedRigElement PrimaryCachedSpace; // 0x124
        struct FCachedRigElement SecondaryCachedSpace; // 0x138

    };

    struct FRigUnit_AimBone_DebugSettings //ScriptStruct ControlRig.RigUnit_AimBone_DebugSettings
    {
    //Children Prop Count (Fields): 3
    public:

        bool bEnabled; // 0x0
        float Scale; // 0x4
        struct FTransform WorldOffset; // 0x10

    };

    struct FRigUnit_AimItem_Target //ScriptStruct ControlRig.RigUnit_AimItem_Target
    {
    //Children Prop Count (Fields): 5
    public:

        float Weight; // 0x0
        struct FVector Axis; // 0x4
        struct FVector Target; // 0x10
        enum class EControlRigVectorKind Kind; // 0x1c
        struct FRigElementKey Space; // 0x20

    };

    struct FRigUnit_AimBone : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_AimBone
    {
    //Children Prop Count (Fields): 9
    public:

        struct FName Bone; // 0x68
        struct FRigUnit_AimBone_Target Primary; // 0x70
        struct FRigUnit_AimBone_Target Secondary; // 0x98
        float Weight; // 0xc0
        bool bPropagateToChildren; // 0xc4
        struct FRigUnit_AimBone_DebugSettings DebugSettings; // 0xd0
        struct FCachedRigElement CachedBoneIndex; // 0x110
        struct FCachedRigElement PrimaryCachedSpace; // 0x124
        struct FCachedRigElement SecondaryCachedSpace; // 0x138

    };

    struct FRigUnit_AimBone_Target //ScriptStruct ControlRig.RigUnit_AimBone_Target
    {
    //Children Prop Count (Fields): 5
    public:

        float Weight; // 0x0
        struct FVector Axis; // 0x4
        struct FVector Target; // 0x10
        enum class EControlRigVectorKind Kind; // 0x1c
        struct FName Space; // 0x20

    };

    struct FRigUnit_HighlevelBase : FRigUnit //ScriptStruct ControlRig.RigUnit_HighlevelBase
    {
    public:


    };

    struct FRigUnit_AimBoneMath : FRigUnit_HighlevelBase //ScriptStruct ControlRig.RigUnit_AimBoneMath
    {
    //Children Prop Count (Fields): 8
    public:

        struct FTransform InputTransform; // 0x10
        struct FRigUnit_AimItem_Target Primary; // 0x40
        struct FRigUnit_AimItem_Target Secondary; // 0x6c
        float Weight; // 0x98
        struct FTransform Result; // 0xa0
        struct FRigUnit_AimBone_DebugSettings DebugSettings; // 0xd0
        struct FCachedRigElement PrimaryCachedSpace; // 0x110
        struct FCachedRigElement SecondaryCachedSpace; // 0x124

    };

    struct FRigUnit_AimConstraint : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_AimConstraint
    {
    //Children Prop Count (Fields): 8
    public:

        struct FName Joint; // 0x68
        enum class EAimMode AimMode; // 0x70
        enum class EAimMode UpMode; // 0x71
        struct FVector AimVector; // 0x74
        struct FVector UpVector; // 0x80
        struct TArray<struct FAimTarget> AimTargets; // 0x90
        struct TArray<struct FAimTarget> UpTargets; // 0xa0
        struct FRigUnit_AimConstraint_WorkData WorkData; // 0xb0

    };

    struct FRigUnit_AimConstraint_WorkData //ScriptStruct ControlRig.RigUnit_AimConstraint_WorkData
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FConstraintData> ConstraintData; // 0x0

    };

    struct FConstraintData //ScriptStruct AnimationCore.ConstraintData
    {
    //Children Prop Count (Fields): 5
    public:

        struct FConstraintDescriptor Constraint; // 0x0
        float Weight; // 0x10
        bool bMaintainOffset; // 0x14
        struct FTransform Offset; // 0x20
        struct FTransform CurrentTransform; // 0x50

    };

    struct FConstraintDescriptor //ScriptStruct AnimationCore.ConstraintDescriptor
    {
    //Children Prop Count (Fields): 1
    public:

        enum class EConstraintType Type; // 0x0

    };

    struct FAimTarget //ScriptStruct ControlRig.AimTarget
    {
    //Children Prop Count (Fields): 3
    public:

        float Weight; // 0x0
        struct FTransform Transform; // 0x10
        struct FVector AlignVector; // 0x40

    };

    struct FRigUnit_AlphaInterpVector : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AlphaInterpVector
    {
    //Children Prop Count (Fields): 14
    public:

        struct FVector Value; // 0x8
        float Scale; // 0x14
        float Bias; // 0x18
        bool bMapRange; // 0x1c
        struct FInputRange InRange; // 0x20
        struct FInputRange OutRange; // 0x28
        bool bClampResult; // 0x30
        float ClampMin; // 0x34
        float ClampMax; // 0x38
        bool bInterpResult; // 0x3c
        float InterpSpeedIncreasing; // 0x40
        float InterpSpeedDecreasing; // 0x44
        struct FVector Result; // 0x48
        struct FInputScaleBiasClamp ScaleBiasClamp; // 0x54

    };

    struct FRigUnit_AlphaInterp : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_AlphaInterp
    {
    //Children Prop Count (Fields): 14
    public:

        float Value; // 0x8
        float Scale; // 0xc
        float Bias; // 0x10
        bool bMapRange; // 0x14
        struct FInputRange InRange; // 0x18
        struct FInputRange OutRange; // 0x20
        bool bClampResult; // 0x28
        float ClampMin; // 0x2c
        float ClampMax; // 0x30
        bool bInterpResult; // 0x34
        float InterpSpeedIncreasing; // 0x38
        float InterpSpeedDecreasing; // 0x3c
        float Result; // 0x40
        struct FInputScaleBiasClamp ScaleBiasClamp; // 0x44

    };

    struct FRigUnit_AnimBase : FRigUnit //ScriptStruct ControlRig.RigUnit_AnimBase
    {
    public:


    };

    struct FRigUnit_AnimEasing : FRigUnit_AnimBase //ScriptStruct ControlRig.RigUnit_AnimEasing
    {
    //Children Prop Count (Fields): 7
    public:

        float Value; // 0x8
        enum class EControlRigAnimEasingType Type; // 0xc
        float SourceMinimum; // 0x10
        float SourceMaximum; // 0x14
        float TargetMinimum; // 0x18
        float TargetMaximum; // 0x1c
        float Result; // 0x20

    };

    struct FRigUnit_AnimEasingType : FRigUnit_AnimBase //ScriptStruct ControlRig.RigUnit_AnimEasingType
    {
    //Children Prop Count (Fields): 1
    public:

        enum class EControlRigAnimEasingType Type; // 0x8

    };

    struct FRigUnit_AnimEvalRichCurve : FRigUnit_AnimBase //ScriptStruct ControlRig.RigUnit_AnimEvalRichCurve
    {
    //Children Prop Count (Fields): 7
    public:

        float Value; // 0x8
        struct FRuntimeFloatCurve Curve; // 0x10
        float SourceMinimum; // 0x98
        float SourceMaximum; // 0x9c
        float TargetMinimum; // 0xa0
        float TargetMaximum; // 0xa4
        float Result; // 0xa8

    };

    struct FRuntimeFloatCurve //ScriptStruct Engine.RuntimeFloatCurve
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRichCurve EditorCurveData; // 0x0
        class UCurveFloat* ExternalCurve; // 0x80

    };

    struct FIndexedCurve //ScriptStruct Engine.IndexedCurve
    {
    //Children Prop Count (Fields): 1
    public:

        struct FKeyHandleMap KeyHandlesToIndices; // 0x8

    };

    struct FKeyHandleMap //ScriptStruct Engine.KeyHandleMap
    {
    public:


    };

    struct FRealCurve : FIndexedCurve //ScriptStruct Engine.RealCurve
    {
    //Children Prop Count (Fields): 3
    public:

        float DefaultValue; // 0x68
        enum class ERichCurveExtrapolation PreInfinityExtrap; // 0x6c
        enum class ERichCurveExtrapolation PostInfinityExtrap; // 0x6d

    };

    struct FRichCurve : FRealCurve //ScriptStruct Engine.RichCurve
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FRichCurveKey> Keys; // 0x70

    };

    struct FRichCurveKey //ScriptStruct Engine.RichCurveKey
    {
    //Children Prop Count (Fields): 9
    public:

        enum class ERichCurveInterpMode InterpMode; // 0x0
        enum class ERichCurveTangentMode TangentMode; // 0x1
        enum class ERichCurveTangentWeightMode TangentWeightMode; // 0x2
        float Time; // 0x4
        float Value; // 0x8
        float ArriveTangent; // 0xc
        float ArriveTangentWeight; // 0x10
        float LeaveTangent; // 0x14
        float LeaveTangentWeight; // 0x18

    };

    struct FRigUnit_AnimRichCurve : FRigUnit_AnimBase //ScriptStruct ControlRig.RigUnit_AnimRichCurve
    {
    //Children Prop Count (Fields): 1
    public:

        struct FRuntimeFloatCurve Curve; // 0x8

    };

    struct FRigUnit_ApplyFK : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_ApplyFK
    {
    //Children Prop Count (Fields): 7
    public:

        struct FName Joint; // 0x68
        struct FTransform Transform; // 0x70
        struct FTransformFilter Filter; // 0xa0
        enum class EApplyTransformMode ApplyTransformMode; // 0xa9
        enum class ETransformSpaceMode ApplyTransformSpace; // 0xaa
        struct FTransform BaseTransform; // 0xb0
        struct FName BaseJoint; // 0xe0

    };

    struct FTransformFilter //ScriptStruct AnimationCore.TransformFilter
    {
    //Children Prop Count (Fields): 3
    public:

        struct FFilterOptionPerAxis TranslationFilter; // 0x0
        struct FFilterOptionPerAxis RotationFilter; // 0x3
        struct FFilterOptionPerAxis ScaleFilter; // 0x6

    };

    struct FRigUnit_BeginExecution : FRigUnit //ScriptStruct ControlRig.RigUnit_BeginExecution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FControlRigExecuteContext ExecuteContext; // 0x8

    };

    struct FRigUnit_BlendTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_BlendTransform
    {
    //Children Prop Count (Fields): 3
    public:

        struct FTransform Source; // 0x10
        struct TArray<struct FBlendTarget> Targets; // 0x40
        struct FTransform Result; // 0x50

    };

    struct FBlendTarget //ScriptStruct ControlRig.BlendTarget
    {
    //Children Prop Count (Fields): 2
    public:

        struct FTransform Transform; // 0x0
        float Weight; // 0x30

    };

    struct FRigUnit_ItemHarmonics : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_ItemHarmonics
    {
    //Children Prop Count (Fields): 11
    public:

        struct TArray<struct FRigUnit_Harmonics_TargetItem> Targets; // 0x68
        struct FVector WaveSpeed; // 0x78
        struct FVector WaveFrequency; // 0x84
        struct FVector WaveAmplitude; // 0x90
        struct FVector WaveOffset; // 0x9c
        struct FVector WaveNoise; // 0xa8
        enum class EControlRigAnimEasingType WaveEase; // 0xb4
        float WaveMinimum; // 0xb8
        float WaveMaximum; // 0xbc
        enum class EControlRigRotationOrder RotationOrder; // 0xc0
        struct FRigUnit_BoneHarmonics_WorkData WorkData; // 0xc8

    };

    struct FRigUnit_BoneHarmonics_WorkData //ScriptStruct ControlRig.RigUnit_BoneHarmonics_WorkData
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FCachedRigElement> CachedItems; // 0x0
        struct FVector WaveTime; // 0x10

    };

    struct FRigUnit_Harmonics_TargetItem //ScriptStruct ControlRig.RigUnit_Harmonics_TargetItem
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRigElementKey item; // 0x0
        float Ratio; // 0xc

    };

    struct FRigUnit_BoneHarmonics : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_BoneHarmonics
    {
    //Children Prop Count (Fields): 12
    public:

        struct TArray<struct FRigUnit_BoneHarmonics_BoneTarget> Bones; // 0x68
        struct FVector WaveSpeed; // 0x78
        struct FVector WaveFrequency; // 0x84
        struct FVector WaveAmplitude; // 0x90
        struct FVector WaveOffset; // 0x9c
        struct FVector WaveNoise; // 0xa8
        enum class EControlRigAnimEasingType WaveEase; // 0xb4
        float WaveMinimum; // 0xb8
        float WaveMaximum; // 0xbc
        enum class EControlRigRotationOrder RotationOrder; // 0xc0
        bool bPropagateToChildren; // 0xc1
        struct FRigUnit_BoneHarmonics_WorkData WorkData; // 0xc8

    };

    struct FRigUnit_BoneHarmonics_BoneTarget //ScriptStruct ControlRig.RigUnit_BoneHarmonics_BoneTarget
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Bone; // 0x0
        float Ratio; // 0x8

    };

    struct FRigUnit_ControlName : FRigUnit //ScriptStruct ControlRig.RigUnit_ControlName
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Control; // 0x8

    };

    struct FRigUnit_SpaceName : FRigUnit //ScriptStruct ControlRig.RigUnit_SpaceName
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Space; // 0x8

    };

    struct FRigUnit_BoneName : FRigUnit //ScriptStruct ControlRig.RigUnit_BoneName
    {
    //Children Prop Count (Fields): 1
    public:

        struct FName Bone; // 0x8

    };

    struct FRigUnit_Item : FRigUnit //ScriptStruct ControlRig.RigUnit_Item
    {
    //Children Prop Count (Fields): 1
    public:

        struct FRigElementKey item; // 0x8

    };

    struct FRigUnit_CCDIKPerItem : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_CCDIKPerItem
    {
    //Children Prop Count (Fields): 10
    public:

        struct FRigElementKeyCollection Items; // 0x68
        struct FTransform EffectorTransform; // 0x80
        float Precision; // 0xb0
        float Weight; // 0xb4
        int32_t MaxIterations; // 0xb8
        bool bStartFromTail; // 0xbc
        float BaseRotationLimit; // 0xc0
        struct TArray<struct FRigUnit_CCDIK_RotationLimitPerItem> RotationLimits; // 0xc8
        bool bPropagateToChildren; // 0xd8
        struct FRigUnit_CCDIK_WorkData WorkData; // 0xe0

    };

    struct FRigUnit_CCDIK_WorkData //ScriptStruct ControlRig.RigUnit_CCDIK_WorkData
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FCCDIKChainLink> Chain; // 0x0
        struct TArray<struct FCachedRigElement> CachedItems; // 0x10
        struct TArray<int32_t> RotationLimitIndex; // 0x20
        struct TArray<float> RotationLimitsPerItem; // 0x30
        struct FCachedRigElement CachedEffector; // 0x40

    };

    struct FCCDIKChainLink //ScriptStruct AnimationCore.CCDIKChainLink
    {
    public:


    };

    struct FRigUnit_CCDIK_RotationLimitPerItem //ScriptStruct ControlRig.RigUnit_CCDIK_RotationLimitPerItem
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRigElementKey item; // 0x0
        float Limit; // 0xc

    };

    struct FRigUnit_CCDIK : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_CCDIK
    {
    //Children Prop Count (Fields): 11
    public:

        struct FName StartBone; // 0x68
        struct FName EffectorBone; // 0x70
        struct FTransform EffectorTransform; // 0x80
        float Precision; // 0xb0
        float Weight; // 0xb4
        int32_t MaxIterations; // 0xb8
        bool bStartFromTail; // 0xbc
        float BaseRotationLimit; // 0xc0
        struct TArray<struct FRigUnit_CCDIK_RotationLimit> RotationLimits; // 0xc8
        bool bPropagateToChildren; // 0xd8
        struct FRigUnit_CCDIK_WorkData WorkData; // 0xe0

    };

    struct FRigUnit_CCDIK_RotationLimit //ScriptStruct ControlRig.RigUnit_CCDIK_RotationLimit
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Bone; // 0x0
        float Limit; // 0x8

    };

    struct FRigUnit_ChainHarmonicsPerItem : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_ChainHarmonicsPerItem
    {
    //Children Prop Count (Fields): 9
    public:

        struct FRigElementKey ChainRoot; // 0x68
        struct FVector Speed; // 0x74
        struct FRigUnit_ChainHarmonics_Reach Reach; // 0x80
        struct FRigUnit_ChainHarmonics_Wave Wave; // 0xa8
        struct FRuntimeFloatCurve WaveCurve; // 0xe8
        struct FRigUnit_ChainHarmonics_Pendulum Pendulum; // 0x170
        bool bDrawDebug; // 0x1ac
        struct FTransform DrawWorldOffset; // 0x1b0
        struct FRigUnit_ChainHarmonics_WorkData WorkData; // 0x1e0

    };

    struct FRigUnit_ChainHarmonics_WorkData //ScriptStruct ControlRig.RigUnit_ChainHarmonics_WorkData
    {
    //Children Prop Count (Fields): 9
    public:

        struct FVector Time; // 0x0
        struct TArray<struct FCachedRigElement> Items; // 0x10
        struct TArray<float> Ratio; // 0x20
        struct TArray<struct FVector> LocalTip; // 0x30
        struct TArray<struct FVector> PendulumTip; // 0x40
        struct TArray<struct FVector> PendulumPosition; // 0x50
        struct TArray<struct FVector> PendulumVelocity; // 0x60
        struct TArray<struct FVector> HierarchyLine; // 0x70
        struct TArray<struct FVector> VelocityLines; // 0x80

    };

    struct FRigUnit_ChainHarmonics_Pendulum //ScriptStruct ControlRig.RigUnit_ChainHarmonics_Pendulum
    {
    //Children Prop Count (Fields): 11
    public:

        bool bEnabled; // 0x0
        float PendulumStiffness; // 0x4
        struct FVector PendulumGravity; // 0x8
        float PendulumBlend; // 0x14
        float PendulumDrag; // 0x18
        float PendulumMinimum; // 0x1c
        float PendulumMaximum; // 0x20
        enum class EControlRigAnimEasingType PendulumEase; // 0x24
        struct FVector UnwindAxis; // 0x28
        float UnwindMinimum; // 0x34
        float UnwindMaximum; // 0x38

    };

    struct FRigUnit_ChainHarmonics_Wave //ScriptStruct ControlRig.RigUnit_ChainHarmonics_Wave
    {
    //Children Prop Count (Fields): 8
    public:

        bool bEnabled; // 0x0
        struct FVector WaveFrequency; // 0x4
        struct FVector WaveAmplitude; // 0x10
        struct FVector WaveOffset; // 0x1c
        struct FVector WaveNoise; // 0x28
        float WaveMinimum; // 0x34
        float WaveMaximum; // 0x38
        enum class EControlRigAnimEasingType WaveEase; // 0x3c

    };

    struct FRigUnit_ChainHarmonics_Reach //ScriptStruct ControlRig.RigUnit_ChainHarmonics_Reach
    {
    //Children Prop Count (Fields): 6
    public:

        bool bEnabled; // 0x0
        struct FVector ReachTarget; // 0x4
        struct FVector ReachAxis; // 0x10
        float ReachMinimum; // 0x1c
        float ReachMaximum; // 0x20
        enum class EControlRigAnimEasingType ReachEase; // 0x24

    };

    struct FRigUnit_ChainHarmonics : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_ChainHarmonics
    {
    //Children Prop Count (Fields): 9
    public:

        struct FName ChainRoot; // 0x68
        struct FVector Speed; // 0x70
        struct FRigUnit_ChainHarmonics_Reach Reach; // 0x7c
        struct FRigUnit_ChainHarmonics_Wave Wave; // 0xa4
        struct FRuntimeFloatCurve WaveCurve; // 0xe8
        struct FRigUnit_ChainHarmonics_Pendulum Pendulum; // 0x170
        bool bDrawDebug; // 0x1ac
        struct FTransform DrawWorldOffset; // 0x1b0
        struct FRigUnit_ChainHarmonics_WorkData WorkData; // 0x1e0

    };

    struct FRigUnit_CollectionBaseMutable : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_CollectionBaseMutable
    {
    public:


    };

    struct FRigUnit_CollectionLoop : FRigUnit_CollectionBaseMutable //ScriptStruct ControlRig.RigUnit_CollectionLoop
    {
    //Children Prop Count (Fields): 7
    public:

        struct FRigElementKeyCollection Collection; // 0x68
        struct FRigElementKey item; // 0x78
        int32_t Index; // 0x84
        int32_t Count; // 0x88
        float Ratio; // 0x8c
        bool Continue; // 0x90
        struct FControlRigExecuteContext Completed; // 0x98

    };

    struct FRigUnit_CollectionBase : FRigUnit //ScriptStruct ControlRig.RigUnit_CollectionBase
    {
    public:


    };

    struct FRigUnit_CollectionItemAtIndex : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionItemAtIndex
    {
    //Children Prop Count (Fields): 3
    public:

        struct FRigElementKeyCollection Collection; // 0x8
        int32_t Index; // 0x18
        struct FRigElementKey item; // 0x1c

    };

    struct FRigUnit_CollectionCount : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionCount
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRigElementKeyCollection Collection; // 0x8
        int32_t Count; // 0x18

    };

    struct FRigUnit_CollectionReverse : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionReverse
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRigElementKeyCollection Collection; // 0x8
        struct FRigElementKeyCollection Reversed; // 0x18

    };

    struct FRigUnit_CollectionDifference : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionDifference
    {
    //Children Prop Count (Fields): 3
    public:

        struct FRigElementKeyCollection A; // 0x8
        struct FRigElementKeyCollection B; // 0x18
        struct FRigElementKeyCollection Collection; // 0x28

    };

    struct FRigUnit_CollectionIntersection : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionIntersection
    {
    //Children Prop Count (Fields): 3
    public:

        struct FRigElementKeyCollection A; // 0x8
        struct FRigElementKeyCollection B; // 0x18
        struct FRigElementKeyCollection Collection; // 0x28

    };

    struct FRigUnit_CollectionUnion : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionUnion
    {
    //Children Prop Count (Fields): 3
    public:

        struct FRigElementKeyCollection A; // 0x8
        struct FRigElementKeyCollection B; // 0x18
        struct FRigElementKeyCollection Collection; // 0x28

    };

    struct FRigUnit_CollectionItems : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionItems
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FRigElementKey> Items; // 0x8
        struct FRigElementKeyCollection Collection; // 0x18

    };

    struct FRigUnit_CollectionReplaceItems : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionReplaceItems
    {
    //Children Prop Count (Fields): 7
    public:

        struct FRigElementKeyCollection Items; // 0x8
        struct FName Old; // 0x18
        struct FName New; // 0x20
        bool RemoveInvalidItems; // 0x28
        struct FRigElementKeyCollection Collection; // 0x30
        struct FRigElementKeyCollection CachedCollection; // 0x40
        int32_t CachedHierarchyHash; // 0x50

    };

    struct FRigUnit_CollectionChildren : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionChildren
    {
    //Children Prop Count (Fields): 7
    public:

        struct FRigElementKey Parent; // 0x8
        bool bIncludeParent; // 0x14
        bool bRecursive; // 0x15
        enum class ERigElementType TypeToSearch; // 0x16
        struct FRigElementKeyCollection Collection; // 0x18
        struct FRigElementKeyCollection CachedCollection; // 0x28
        int32_t CachedHierarchyHash; // 0x38

    };

    struct FRigUnit_CollectionNameSearch : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionNameSearch
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName PartialName; // 0x8
        enum class ERigElementType TypeToSearch; // 0x10
        struct FRigElementKeyCollection Collection; // 0x18
        struct FRigElementKeyCollection CachedCollection; // 0x28
        int32_t CachedHierarchyHash; // 0x38

    };

    struct FRigUnit_CollectionChain : FRigUnit_CollectionBase //ScriptStruct ControlRig.RigUnit_CollectionChain
    {
    //Children Prop Count (Fields): 6
    public:

        struct FRigElementKey FirstItem; // 0x8
        struct FRigElementKey LastItem; // 0x14
        bool Reverse; // 0x20
        struct FRigElementKeyCollection Collection; // 0x28
        struct FRigElementKeyCollection CachedCollection; // 0x38
        int32_t CachedHierarchyHash; // 0x48

    };

    struct FRigUnit_Control : FRigUnit //ScriptStruct ControlRig.RigUnit_Control
    {
    //Children Prop Count (Fields): 5
    public:

        struct FEulerTransform Transform; // 0x8
        struct FTransform Base; // 0x30
        struct FTransform InitTransform; // 0x60
        struct FTransform Result; // 0x90
        struct FTransformFilter Filter; // 0xc0

    };

    struct FEulerTransform //ScriptStruct AnimationCore.EulerTransform
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Location; // 0x0
        struct FRotator Rotation; // 0xc
        struct FVector Scale; // 0x18

    };

    struct FRigUnit_Control_StaticMesh : FRigUnit_Control //ScriptStruct ControlRig.RigUnit_Control_StaticMesh
    {
    //Children Prop Count (Fields): 1
    public:

        struct FTransform MeshTransform; // 0xd0

    };

    struct FRigUnit_ToSwingAndTwist : FRigUnit //ScriptStruct ControlRig.RigUnit_ToSwingAndTwist
    {
    //Children Prop Count (Fields): 4
    public:

        struct FQuat Input; // 0x10
        struct FVector TwistAxis; // 0x20
        struct FQuat Swing; // 0x30
        struct FQuat Twist; // 0x40

    };

    struct FRigUnit_ConvertQuaternionToVector : FRigUnit //ScriptStruct ControlRig.RigUnit_ConvertQuaternionToVector
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Input; // 0x10
        struct FVector Result; // 0x20

    };

    struct FRigUnit_ConvertRotationToVector : FRigUnit //ScriptStruct ControlRig.RigUnit_ConvertRotationToVector
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRotator Input; // 0x8
        struct FVector Result; // 0x14

    };

    struct FRigUnit_ConvertVectorToQuaternion : FRigUnit //ScriptStruct ControlRig.RigUnit_ConvertVectorToQuaternion
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Input; // 0x8
        struct FQuat Result; // 0x20

    };

    struct FRigUnit_ConvertVectorToRotation : FRigUnit //ScriptStruct ControlRig.RigUnit_ConvertVectorToRotation
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Input; // 0x8
        struct FRotator Result; // 0x14

    };

    struct FRigUnit_ConvertQuaternion : FRigUnit //ScriptStruct ControlRig.RigUnit_ConvertQuaternion
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Input; // 0x10
        struct FRotator Result; // 0x20

    };

    struct FRigUnit_ConvertRotation : FRigUnit //ScriptStruct ControlRig.RigUnit_ConvertRotation
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRotator Input; // 0x8
        struct FQuat Result; // 0x20

    };

    struct FRigUnit_ConvertVectorRotation : FRigUnit_ConvertRotation //ScriptStruct ControlRig.RigUnit_ConvertVectorRotation
    {
    public:


    };

    struct FRigUnit_ConvertEulerTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_ConvertEulerTransform
    {
    //Children Prop Count (Fields): 2
    public:

        struct FEulerTransform Input; // 0x8
        struct FTransform Result; // 0x30

    };

    struct FRigUnit_ConvertTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_ConvertTransform
    {
    //Children Prop Count (Fields): 2
    public:

        struct FTransform Input; // 0x10
        struct FEulerTransform Result; // 0x40

    };

    struct FRigUnit_DebugBaseMutable : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_DebugBaseMutable
    {
    public:


    };

    struct FRigUnit_DebugBase : FRigUnit //ScriptStruct ControlRig.RigUnit_DebugBase
    {
    public:


    };

    struct FRigUnit_DebugBezierItemSpace : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugBezierItemSpace
    {
    //Children Prop Count (Fields): 9
    public:

        struct FCRFourPointBezier Bezier; // 0x68
        float MinimumU; // 0x98
        float MaximumU; // 0x9c
        struct FLinearColor Color; // 0xa0
        float Thickness; // 0xb0
        int32_t Detail; // 0xb4
        struct FRigElementKey Space; // 0xb8
        struct FTransform WorldOffset; // 0xd0
        bool bEnabled; // 0x100

    };

    struct FRigUnit_DebugBezier : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugBezier
    {
    //Children Prop Count (Fields): 9
    public:

        struct FCRFourPointBezier Bezier; // 0x68
        float MinimumU; // 0x98
        float MaximumU; // 0x9c
        struct FLinearColor Color; // 0xa0
        float Thickness; // 0xb0
        int32_t Detail; // 0xb4
        struct FName Space; // 0xb8
        struct FTransform WorldOffset; // 0xc0
        bool bEnabled; // 0xf0

    };

    struct FRigUnit_DebugHierarchy : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugHierarchy
    {
    //Children Prop Count (Fields): 5
    public:

        float Scale; // 0x68
        struct FLinearColor Color; // 0x6c
        float Thickness; // 0x7c
        struct FTransform WorldOffset; // 0x80
        bool bEnabled; // 0xb0

    };

    struct FRigUnit_DebugLineItemSpace : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugLineItemSpace
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector A; // 0x68
        struct FVector B; // 0x74
        struct FLinearColor Color; // 0x80
        float Thickness; // 0x90
        struct FRigElementKey Space; // 0x94
        struct FTransform WorldOffset; // 0xa0
        bool bEnabled; // 0xd0

    };

    struct FRigUnit_DebugLine : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugLine
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector A; // 0x68
        struct FVector B; // 0x74
        struct FLinearColor Color; // 0x80
        float Thickness; // 0x90
        struct FName Space; // 0x94
        struct FTransform WorldOffset; // 0xa0
        bool bEnabled; // 0xd0

    };

    struct FRigUnit_DebugLineStripItemSpace : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugLineStripItemSpace
    {
    //Children Prop Count (Fields): 6
    public:

        struct TArray<struct FVector> Points; // 0x68
        struct FLinearColor Color; // 0x78
        float Thickness; // 0x88
        struct FRigElementKey Space; // 0x8c
        struct FTransform WorldOffset; // 0xa0
        bool bEnabled; // 0xd0

    };

    struct FRigUnit_DebugLineStrip : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugLineStrip
    {
    //Children Prop Count (Fields): 6
    public:

        struct TArray<struct FVector> Points; // 0x68
        struct FLinearColor Color; // 0x78
        float Thickness; // 0x88
        struct FName Space; // 0x8c
        struct FTransform WorldOffset; // 0xa0
        bool bEnabled; // 0xd0

    };

    struct FRigUnit_DebugPointMutable : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugPointMutable
    {
    //Children Prop Count (Fields): 8
    public:

        struct FVector Vector; // 0x68
        enum class ERigUnitDebugPointMode Mode; // 0x74
        struct FLinearColor Color; // 0x78
        float Scale; // 0x88
        float Thickness; // 0x8c
        struct FName Space; // 0x90
        struct FTransform WorldOffset; // 0xa0
        bool bEnabled; // 0xd0

    };

    struct FRigUnit_DebugPoint : FRigUnit_DebugBase //ScriptStruct ControlRig.RigUnit_DebugPoint
    {
    //Children Prop Count (Fields): 8
    public:

        struct FVector Vector; // 0x8
        enum class ERigUnitDebugPointMode Mode; // 0x14
        struct FLinearColor Color; // 0x18
        float Scale; // 0x28
        float Thickness; // 0x2c
        struct FName Space; // 0x30
        struct FTransform WorldOffset; // 0x40
        bool bEnabled; // 0x70

    };

    struct FRigUnit_DebugArcItemSpace : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugArcItemSpace
    {
    //Children Prop Count (Fields): 10
    public:

        struct FTransform Transform; // 0x70
        struct FLinearColor Color; // 0xa0
        float Radius; // 0xb0
        float MinimumDegrees; // 0xb4
        float MaximumDegrees; // 0xb8
        float Thickness; // 0xbc
        int32_t Detail; // 0xc0
        struct FRigElementKey Space; // 0xc4
        struct FTransform WorldOffset; // 0xd0
        bool bEnabled; // 0x100

    };

    struct FRigUnit_DebugArc : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugArc
    {
    //Children Prop Count (Fields): 10
    public:

        struct FTransform Transform; // 0x70
        struct FLinearColor Color; // 0xa0
        float Radius; // 0xb0
        float MinimumDegrees; // 0xb4
        float MaximumDegrees; // 0xb8
        float Thickness; // 0xbc
        int32_t Detail; // 0xc0
        struct FName Space; // 0xc4
        struct FTransform WorldOffset; // 0xd0
        bool bEnabled; // 0x100

    };

    struct FRigUnit_DebugRectangleItemSpace : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugRectangleItemSpace
    {
    //Children Prop Count (Fields): 7
    public:

        struct FTransform Transform; // 0x70
        struct FLinearColor Color; // 0xa0
        float Scale; // 0xb0
        float Thickness; // 0xb4
        struct FRigElementKey Space; // 0xb8
        struct FTransform WorldOffset; // 0xd0
        bool bEnabled; // 0x100

    };

    struct FRigUnit_DebugRectangle : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugRectangle
    {
    //Children Prop Count (Fields): 7
    public:

        struct FTransform Transform; // 0x70
        struct FLinearColor Color; // 0xa0
        float Scale; // 0xb0
        float Thickness; // 0xb4
        struct FName Space; // 0xb8
        struct FTransform WorldOffset; // 0xc0
        bool bEnabled; // 0xf0

    };

    struct FRigUnit_DebugTransformArrayMutable : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugTransformArrayMutable
    {
    //Children Prop Count (Fields): 9
    public:

        struct TArray<struct FTransform> Transforms; // 0x68
        enum class ERigUnitDebugTransformMode Mode; // 0x78
        struct FLinearColor Color; // 0x7c
        float Thickness; // 0x8c
        float Scale; // 0x90
        struct FName Space; // 0x94
        struct FTransform WorldOffset; // 0xa0
        bool bEnabled; // 0xd0
        struct FRigUnit_DebugTransformArrayMutable_WorkData WorkData; // 0xd8

    };

    struct FRigUnit_DebugTransformArrayMutable_WorkData //ScriptStruct ControlRig.RigUnit_DebugTransformArrayMutable_WorkData
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FTransform> DrawTransforms; // 0x0

    };

    struct FRigUnit_DebugTransformMutableItemSpace : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugTransformMutableItemSpace
    {
    //Children Prop Count (Fields): 8
    public:

        struct FTransform Transform; // 0x70
        enum class ERigUnitDebugTransformMode Mode; // 0xa0
        struct FLinearColor Color; // 0xa4
        float Thickness; // 0xb4
        float Scale; // 0xb8
        struct FRigElementKey Space; // 0xbc
        struct FTransform WorldOffset; // 0xd0
        bool bEnabled; // 0x100

    };

    struct FRigUnit_DebugTransformMutable : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_DebugTransformMutable
    {
    //Children Prop Count (Fields): 8
    public:

        struct FTransform Transform; // 0x70
        enum class ERigUnitDebugTransformMode Mode; // 0xa0
        struct FLinearColor Color; // 0xa4
        float Thickness; // 0xb4
        float Scale; // 0xb8
        struct FName Space; // 0xbc
        struct FTransform WorldOffset; // 0xd0
        bool bEnabled; // 0x100

    };

    struct FRigUnit_DebugTransform : FRigUnit_DebugBase //ScriptStruct ControlRig.RigUnit_DebugTransform
    {
    //Children Prop Count (Fields): 8
    public:

        struct FTransform Transform; // 0x10
        enum class ERigUnitDebugTransformMode Mode; // 0x40
        struct FLinearColor Color; // 0x44
        float Thickness; // 0x54
        float Scale; // 0x58
        struct FName Space; // 0x5c
        struct FTransform WorldOffset; // 0x70
        bool bEnabled; // 0xa0

    };

    struct FRigUnit_DeltaFromPreviousTransform : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_DeltaFromPreviousTransform
    {
    //Children Prop Count (Fields): 4
    public:

        struct FTransform Value; // 0x10
        struct FTransform Delta; // 0x40
        struct FTransform PreviousValue; // 0x70
        struct FTransform Cache; // 0xa0

    };

    struct FRigUnit_DeltaFromPreviousQuat : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_DeltaFromPreviousQuat
    {
    //Children Prop Count (Fields): 4
    public:

        struct FQuat Value; // 0x10
        struct FQuat Delta; // 0x20
        struct FQuat PreviousValue; // 0x30
        struct FQuat Cache; // 0x40

    };

    struct FRigUnit_DeltaFromPreviousVector : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_DeltaFromPreviousVector
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector Value; // 0x8
        struct FVector Delta; // 0x14
        struct FVector PreviousValue; // 0x20
        struct FVector Cache; // 0x2c

    };

    struct FRigUnit_DeltaFromPreviousFloat : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_DeltaFromPreviousFloat
    {
    //Children Prop Count (Fields): 4
    public:

        float Value; // 0x8
        float Delta; // 0xc
        float PreviousValue; // 0x10
        float Cache; // 0x14

    };

    struct FRigUnit_DistributeRotationForCollection : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_DistributeRotationForCollection
    {
    //Children Prop Count (Fields): 5
    public:

        struct FRigElementKeyCollection Items; // 0x68
        struct TArray<struct FRigUnit_DistributeRotation_Rotation> Rotations; // 0x78
        enum class EControlRigAnimEasingType RotationEaseType; // 0x88
        float Weight; // 0x8c
        struct FRigUnit_DistributeRotation_WorkData WorkData; // 0x90

    };

    struct FRigUnit_DistributeRotation_WorkData //ScriptStruct ControlRig.RigUnit_DistributeRotation_WorkData
    {
    //Children Prop Count (Fields): 5
    public:

        struct TArray<struct FCachedRigElement> CachedItems; // 0x0
        struct TArray<int32_t> ItemRotationA; // 0x10
        struct TArray<int32_t> ItemRotationB; // 0x20
        struct TArray<float> ItemRotationT; // 0x30
        struct TArray<struct FTransform> ItemLocalTransforms; // 0x40

    };

    struct FRigUnit_DistributeRotation_Rotation //ScriptStruct ControlRig.RigUnit_DistributeRotation_Rotation
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Rotation; // 0x0
        float Ratio; // 0x10

    };

    struct FRigUnit_DistributeRotation : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_DistributeRotation
    {
    //Children Prop Count (Fields): 7
    public:

        struct FName StartBone; // 0x68
        struct FName EndBone; // 0x70
        struct TArray<struct FRigUnit_DistributeRotation_Rotation> Rotations; // 0x78
        enum class EControlRigAnimEasingType RotationEaseType; // 0x88
        float Weight; // 0x8c
        bool bPropagateToChildren; // 0x90
        struct FRigUnit_DistributeRotation_WorkData WorkData; // 0x98

    };

    struct FRigUnit_DrawContainerSetTransform : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_DrawContainerSetTransform
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName InstructionName; // 0x68
        struct FTransform Transform; // 0x70

    };

    struct FRigUnit_DrawContainerSetThickness : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_DrawContainerSetThickness
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName InstructionName; // 0x68
        float Thickness; // 0x70

    };

    struct FRigUnit_DrawContainerSetColor : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_DrawContainerSetColor
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName InstructionName; // 0x68
        struct FLinearColor Color; // 0x70

    };

    struct FRigUnit_DrawContainerGetInstruction : FRigUnit //ScriptStruct ControlRig.RigUnit_DrawContainerGetInstruction
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName InstructionName; // 0x8
        struct FLinearColor Color; // 0x10
        struct FTransform Transform; // 0x20

    };

    struct FRigUnit_FABRIKPerItem : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_FABRIKPerItem
    {
    //Children Prop Count (Fields): 7
    public:

        struct FRigElementKeyCollection Items; // 0x68
        struct FTransform EffectorTransform; // 0x80
        float Precision; // 0xb0
        float Weight; // 0xb4
        bool bPropagateToChildren; // 0xb8
        int32_t MaxIterations; // 0xbc
        struct FRigUnit_FABRIK_WorkData WorkData; // 0xc0

    };

    struct FRigUnit_FABRIK_WorkData //ScriptStruct ControlRig.RigUnit_FABRIK_WorkData
    {
    //Children Prop Count (Fields): 3
    public:

        struct TArray<struct FFABRIKChainLink> Chain; // 0x0
        struct TArray<struct FCachedRigElement> CachedItems; // 0x10
        struct FCachedRigElement CachedEffector; // 0x20

    };

    struct FFABRIKChainLink //ScriptStruct AnimationCore.FABRIKChainLink
    {
    public:


    };

    struct FRigUnit_FABRIK : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_FABRIK
    {
    //Children Prop Count (Fields): 8
    public:

        struct FName StartBone; // 0x68
        struct FName EffectorBone; // 0x70
        struct FTransform EffectorTransform; // 0x80
        float Precision; // 0xb0
        float Weight; // 0xb4
        bool bPropagateToChildren; // 0xb8
        int32_t MaxIterations; // 0xbc
        struct FRigUnit_FABRIK_WorkData WorkData; // 0xc0

    };

    struct FRigUnit_FitChainToCurvePerItem : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_FitChainToCurvePerItem
    {
    //Children Prop Count (Fields): 15
    public:

        struct FRigElementKeyCollection Items; // 0x68
        struct FCRFourPointBezier Bezier; // 0x78
        enum class EControlRigCurveAlignment Alignment; // 0xa8
        float Minimum; // 0xac
        float Maximum; // 0xb0
        int32_t SamplingPrecision; // 0xb4
        struct FVector PrimaryAxis; // 0xb8
        struct FVector SecondaryAxis; // 0xc4
        struct FVector PoleVectorPosition; // 0xd0
        struct TArray<struct FRigUnit_FitChainToCurve_Rotation> Rotations; // 0xe0
        enum class EControlRigAnimEasingType RotationEaseType; // 0xf0
        float Weight; // 0xf4
        bool bPropagateToChildren; // 0xf8
        struct FRigUnit_FitChainToCurve_DebugSettings DebugSettings; // 0x100
        struct FRigUnit_FitChainToCurve_WorkData WorkData; // 0x160

    };

    struct FRigUnit_FitChainToCurve_WorkData //ScriptStruct ControlRig.RigUnit_FitChainToCurve_WorkData
    {
    //Children Prop Count (Fields): 10
    public:

        float ChainLength; // 0x0
        struct TArray<struct FVector> ItemPositions; // 0x8
        struct TArray<float> ItemSegments; // 0x18
        struct TArray<struct FVector> CurvePositions; // 0x28
        struct TArray<float> CurveSegments; // 0x38
        struct TArray<struct FCachedRigElement> CachedItems; // 0x48
        struct TArray<int32_t> ItemRotationA; // 0x58
        struct TArray<int32_t> ItemRotationB; // 0x68
        struct TArray<float> ItemRotationT; // 0x78
        struct TArray<struct FTransform> ItemLocalTransforms; // 0x88

    };

    struct FRigUnit_FitChainToCurve_DebugSettings //ScriptStruct ControlRig.RigUnit_FitChainToCurve_DebugSettings
    {
    //Children Prop Count (Fields): 5
    public:

        bool bEnabled; // 0x0
        float Scale; // 0x4
        struct FLinearColor CurveColor; // 0x8
        struct FLinearColor SegmentsColor; // 0x18
        struct FTransform WorldOffset; // 0x30

    };

    struct FRigUnit_FitChainToCurve_Rotation //ScriptStruct ControlRig.RigUnit_FitChainToCurve_Rotation
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Rotation; // 0x0
        float Ratio; // 0x10

    };

    struct FRigUnit_FitChainToCurve : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_FitChainToCurve
    {
    //Children Prop Count (Fields): 16
    public:

        struct FName StartBone; // 0x68
        struct FName EndBone; // 0x70
        struct FCRFourPointBezier Bezier; // 0x78
        enum class EControlRigCurveAlignment Alignment; // 0xa8
        float Minimum; // 0xac
        float Maximum; // 0xb0
        int32_t SamplingPrecision; // 0xb4
        struct FVector PrimaryAxis; // 0xb8
        struct FVector SecondaryAxis; // 0xc4
        struct FVector PoleVectorPosition; // 0xd0
        struct TArray<struct FRigUnit_FitChainToCurve_Rotation> Rotations; // 0xe0
        enum class EControlRigAnimEasingType RotationEaseType; // 0xf0
        float Weight; // 0xf4
        bool bPropagateToChildren; // 0xf8
        struct FRigUnit_FitChainToCurve_DebugSettings DebugSettings; // 0x100
        struct FRigUnit_FitChainToCurve_WorkData WorkData; // 0x160

    };

    struct FRigUnit_MapRange_Float : FRigUnit //ScriptStruct ControlRig.RigUnit_MapRange_Float
    {
    //Children Prop Count (Fields): 6
    public:

        float Value; // 0x8
        float MinIn; // 0xc
        float MaxIn; // 0x10
        float MinOut; // 0x14
        float MaxOut; // 0x18
        float Result; // 0x1c

    };

    struct FRigUnit_Clamp_Float : FRigUnit //ScriptStruct ControlRig.RigUnit_Clamp_Float
    {
    //Children Prop Count (Fields): 4
    public:

        float Value; // 0x8
        float Min; // 0xc
        float Max; // 0x10
        float Result; // 0x14

    };

    struct FRigUnit_BinaryFloatOp : FRigUnit //ScriptStruct ControlRig.RigUnit_BinaryFloatOp
    {
    //Children Prop Count (Fields): 3
    public:

        float Argument0; // 0x8
        float Argument1; // 0xc
        float Result; // 0x10

    };

    struct FRigUnit_Divide_FloatFloat : FRigUnit_BinaryFloatOp //ScriptStruct ControlRig.RigUnit_Divide_FloatFloat
    {
    public:


    };

    struct FRigUnit_Subtract_FloatFloat : FRigUnit_BinaryFloatOp //ScriptStruct ControlRig.RigUnit_Subtract_FloatFloat
    {
    public:


    };

    struct FRigUnit_Add_FloatFloat : FRigUnit_BinaryFloatOp //ScriptStruct ControlRig.RigUnit_Add_FloatFloat
    {
    public:


    };

    struct FRigUnit_Multiply_FloatFloat : FRigUnit_BinaryFloatOp //ScriptStruct ControlRig.RigUnit_Multiply_FloatFloat
    {
    public:


    };

    struct FRigUnit_ForLoopCount : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_ForLoopCount
    {
    //Children Prop Count (Fields): 5
    public:

        int32_t Count; // 0x68
        int32_t Index; // 0x6c
        float Ratio; // 0x70
        bool Continue; // 0x74
        struct FControlRigExecuteContext Completed; // 0x78

    };

    struct FRigUnit_GetBoneTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_GetBoneTransform
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName Bone; // 0x8
        enum class EBoneGetterSetterMode Space; // 0x10
        struct FTransform Transform; // 0x20
        struct FCachedRigElement CachedBone; // 0x50

    };

    struct FRigUnit_GetControlInitialTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_GetControlInitialTransform
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName Control; // 0x8
        enum class EBoneGetterSetterMode Space; // 0x10
        struct FTransform Transform; // 0x20
        struct FCachedRigElement CachedControlIndex; // 0x50

    };

    struct FRigUnit_GetControlTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_GetControlTransform
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName Control; // 0x8
        enum class EBoneGetterSetterMode Space; // 0x10
        struct FTransform Transform; // 0x20
        struct FTransform Minimum; // 0x50
        struct FTransform Maximum; // 0x80
        struct FCachedRigElement CachedControlIndex; // 0xb0

    };

    struct FRigUnit_GetControlRotator : FRigUnit //ScriptStruct ControlRig.RigUnit_GetControlRotator
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName Control; // 0x8
        enum class EBoneGetterSetterMode Space; // 0x10
        struct FRotator Rotator; // 0x14
        struct FRotator Minimum; // 0x20
        struct FRotator Maximum; // 0x2c
        struct FCachedRigElement CachedControlIndex; // 0x38

    };

    struct FRigUnit_GetControlVector : FRigUnit //ScriptStruct ControlRig.RigUnit_GetControlVector
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName Control; // 0x8
        enum class EBoneGetterSetterMode Space; // 0x10
        struct FVector Vector; // 0x14
        struct FVector Minimum; // 0x20
        struct FVector Maximum; // 0x2c
        struct FCachedRigElement CachedControlIndex; // 0x38

    };

    struct FRigUnit_GetControlVector2D : FRigUnit //ScriptStruct ControlRig.RigUnit_GetControlVector2D
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName Control; // 0x8
        struct FVector2D Vector; // 0x10
        struct FVector2D Minimum; // 0x18
        struct FVector2D Maximum; // 0x20
        struct FCachedRigElement CachedControlIndex; // 0x28

    };

    struct FRigUnit_GetControlInteger : FRigUnit //ScriptStruct ControlRig.RigUnit_GetControlInteger
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName Control; // 0x8
        int32_t IntegerValue; // 0x10
        int32_t Minimum; // 0x14
        int32_t Maximum; // 0x18
        struct FCachedRigElement CachedControlIndex; // 0x1c

    };

    struct FRigUnit_GetControlFloat : FRigUnit //ScriptStruct ControlRig.RigUnit_GetControlFloat
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName Control; // 0x8
        float FloatValue; // 0x10
        float Minimum; // 0x14
        float Maximum; // 0x18
        struct FCachedRigElement CachedControlIndex; // 0x1c

    };

    struct FRigUnit_GetControlBool : FRigUnit //ScriptStruct ControlRig.RigUnit_GetControlBool
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName Control; // 0x8
        bool BoolValue; // 0x10
        struct FCachedRigElement CachedControlIndex; // 0x14

    };

    struct FRigUnit_GetCurveValue : FRigUnit //ScriptStruct ControlRig.RigUnit_GetCurveValue
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName Curve; // 0x8
        float Value; // 0x10
        struct FCachedRigElement CachedCurveIndex; // 0x14

    };

    struct FRigUnit_GetDeltaTime : FRigUnit_AnimBase //ScriptStruct ControlRig.RigUnit_GetDeltaTime
    {
    //Children Prop Count (Fields): 1
    public:

        float Result; // 0x8

    };

    struct FRigUnit_GetInitialBoneTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_GetInitialBoneTransform
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName Bone; // 0x8
        enum class EBoneGetterSetterMode Space; // 0x10
        struct FTransform Transform; // 0x20
        struct FCachedRigElement CachedBone; // 0x50

    };

    struct FRigUnit_GetJointTransform : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_GetJointTransform
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName Joint; // 0x68
        enum class ETransformGetterType Type; // 0x70
        enum class ETransformSpaceMode TransformSpace; // 0x71
        struct FTransform BaseTransform; // 0x80
        struct FName BaseJoint; // 0xb0
        struct FTransform Output; // 0xc0

    };

    struct FRigUnit_GetRelativeBoneTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_GetRelativeBoneTransform
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName Bone; // 0x8
        struct FName Space; // 0x10
        struct FTransform Transform; // 0x20
        struct FCachedRigElement CachedBone; // 0x50
        struct FCachedRigElement CachedSpace; // 0x64

    };

    struct FRigUnit_GetRelativeTransformForItem : FRigUnit //ScriptStruct ControlRig.RigUnit_GetRelativeTransformForItem
    {
    //Children Prop Count (Fields): 7
    public:

        struct FRigElementKey Child; // 0x8
        bool bChildInitial; // 0x14
        struct FRigElementKey Parent; // 0x18
        bool bParentInitial; // 0x24
        struct FTransform RelativeTransform; // 0x30
        struct FCachedRigElement CachedChild; // 0x60
        struct FCachedRigElement CachedParent; // 0x74

    };

    struct FRigUnit_GetSpaceTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_GetSpaceTransform
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName Space; // 0x8
        enum class EBoneGetterSetterMode SpaceType; // 0x10
        struct FTransform Transform; // 0x20
        struct FCachedRigElement CachedSpaceIndex; // 0x50

    };

    struct FRigUnit_GetTransform : FRigUnit //ScriptStruct ControlRig.RigUnit_GetTransform
    {
    //Children Prop Count (Fields): 5
    public:

        struct FRigElementKey item; // 0x8
        enum class EBoneGetterSetterMode Space; // 0x14
        bool bInitial; // 0x15
        struct FTransform Transform; // 0x20
        struct FCachedRigElement CachedIndex; // 0x50

    };

    struct FRigUnit_GetWorldTime : FRigUnit_AnimBase //ScriptStruct ControlRig.RigUnit_GetWorldTime
    {
    //Children Prop Count (Fields): 8
    public:

        float Year; // 0x8
        float Month; // 0xc
        float Day; // 0x10
        float WeekDay; // 0x14
        float Hours; // 0x18
        float Minutes; // 0x1c
        float Seconds; // 0x20
        float OverallSeconds; // 0x24

    };

    struct FRigUnit_HierarchyBase : FRigUnit //ScriptStruct ControlRig.RigUnit_HierarchyBase
    {
    public:


    };

    struct FRigUnit_HierarchyGetSiblings : FRigUnit_HierarchyBase //ScriptStruct ControlRig.RigUnit_HierarchyGetSiblings
    {
    //Children Prop Count (Fields): 5
    public:

        struct FRigElementKey item; // 0x8
        bool bIncludeItem; // 0x14
        struct FRigElementKeyCollection Siblings; // 0x18
        struct FCachedRigElement CachedItem; // 0x28
        struct FRigElementKeyCollection CachedSiblings; // 0x40

    };

    struct FRigUnit_HierarchyGetChildren : FRigUnit_HierarchyBase //ScriptStruct ControlRig.RigUnit_HierarchyGetChildren
    {
    //Children Prop Count (Fields): 6
    public:

        struct FRigElementKey Parent; // 0x8
        bool bIncludeParent; // 0x14
        bool bRecursive; // 0x15
        struct FRigElementKeyCollection Children; // 0x18
        struct FCachedRigElement CachedParent; // 0x28
        struct FRigElementKeyCollection CachedChildren; // 0x40

    };

    struct FRigUnit_HierarchyGetParents : FRigUnit_HierarchyBase //ScriptStruct ControlRig.RigUnit_HierarchyGetParents
    {
    //Children Prop Count (Fields): 6
    public:

        struct FRigElementKey Child; // 0x8
        bool bIncludeChild; // 0x14
        bool bReverse; // 0x15
        struct FRigElementKeyCollection Parents; // 0x18
        struct FCachedRigElement CachedChild; // 0x28
        struct FRigElementKeyCollection CachedParents; // 0x40

    };

    struct FRigUnit_HierarchyGetParent : FRigUnit_HierarchyBase //ScriptStruct ControlRig.RigUnit_HierarchyGetParent
    {
    //Children Prop Count (Fields): 4
    public:

        struct FRigElementKey Child; // 0x8
        struct FRigElementKey Parent; // 0x14
        struct FCachedRigElement CachedChild; // 0x20
        struct FCachedRigElement CachedParent; // 0x34

    };

    struct FRigUnit_InverseExecution : FRigUnit //ScriptStruct ControlRig.RigUnit_InverseExecution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FControlRigExecuteContext ExecuteContext; // 0x8

    };

    struct FRigUnit_IsInteracting : FRigUnit //ScriptStruct ControlRig.RigUnit_IsInteracting
    {
    //Children Prop Count (Fields): 1
    public:

        bool bIsInteracting; // 0x8

    };

    struct FRigUnit_ItemBase : FRigUnit //ScriptStruct ControlRig.RigUnit_ItemBase
    {
    public:


    };

    struct FRigUnit_ItemReplace : FRigUnit_ItemBase //ScriptStruct ControlRig.RigUnit_ItemReplace
    {
    //Children Prop Count (Fields): 4
    public:

        struct FRigElementKey item; // 0x8
        struct FName Old; // 0x14
        struct FName New; // 0x1c
        struct FRigElementKey Result; // 0x24

    };

    struct FRigUnit_ItemExists : FRigUnit_ItemBase //ScriptStruct ControlRig.RigUnit_ItemExists
    {
    //Children Prop Count (Fields): 3
    public:

        struct FRigElementKey item; // 0x8
        bool Exists; // 0x14
        struct FCachedRigElement CachedIndex; // 0x18

    };

    struct FRigUnit_ItemBaseMutable : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_ItemBaseMutable
    {
    public:


    };

    struct FRigUnit_KalmanTransform : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_KalmanTransform
    {
    //Children Prop Count (Fields): 5
    public:

        struct FTransform Value; // 0x10
        int32_t BufferSize; // 0x40
        struct FTransform Result; // 0x50
        struct TArray<struct FTransform> Buffer; // 0x80
        int32_t LastInsertIndex; // 0x90

    };

    struct FRigUnit_KalmanVector : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_KalmanVector
    {
    //Children Prop Count (Fields): 5
    public:

        struct FVector Value; // 0x8
        int32_t BufferSize; // 0x14
        struct FVector Result; // 0x18
        struct TArray<struct FVector> Buffer; // 0x28
        int32_t LastInsertIndex; // 0x38

    };

    struct FRigUnit_KalmanFloat : FRigUnit_SimBase //ScriptStruct ControlRig.RigUnit_KalmanFloat
    {
    //Children Prop Count (Fields): 5
    public:

        float Value; // 0x8
        int32_t BufferSize; // 0xc
        float Result; // 0x10
        struct TArray<float> Buffer; // 0x18
        int32_t LastInsertIndex; // 0x28

    };

    struct FRigUnit_MathBase : FRigUnit //ScriptStruct ControlRig.RigUnit_MathBase
    {
    public:


    };

    struct FRigUnit_MathBoolBase : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_MathBoolBase
    {
    public:


    };

    struct FRigUnit_MathBoolNotEquals : FRigUnit_MathBoolBase //ScriptStruct ControlRig.RigUnit_MathBoolNotEquals
    {
    //Children Prop Count (Fields): 3
    public:

        bool A; // 0x8
        bool B; // 0x9
        bool Result; // 0xa

    };

    struct FRigUnit_MathBoolEquals : FRigUnit_MathBoolBase //ScriptStruct ControlRig.RigUnit_MathBoolEquals
    {
    //Children Prop Count (Fields): 3
    public:

        bool A; // 0x8
        bool B; // 0x9
        bool Result; // 0xa

    };

    struct FRigUnit_MathBoolBinaryOp : FRigUnit_MathBoolBase //ScriptStruct ControlRig.RigUnit_MathBoolBinaryOp
    {
    //Children Prop Count (Fields): 3
    public:

        bool A; // 0x8
        bool B; // 0x9
        bool Result; // 0xa

    };

    struct FRigUnit_MathBoolOr : FRigUnit_MathBoolBinaryOp //ScriptStruct ControlRig.RigUnit_MathBoolOr
    {
    public:


    };

    struct FRigUnit_MathBoolNand : FRigUnit_MathBoolBinaryOp //ScriptStruct ControlRig.RigUnit_MathBoolNand
    {
    public:


    };

    struct FRigUnit_MathBoolAnd : FRigUnit_MathBoolBinaryOp //ScriptStruct ControlRig.RigUnit_MathBoolAnd
    {
    public:


    };

    struct FRigUnit_MathBoolUnaryOp : FRigUnit_MathBoolBase //ScriptStruct ControlRig.RigUnit_MathBoolUnaryOp
    {
    //Children Prop Count (Fields): 2
    public:

        bool Value; // 0x8
        bool Result; // 0x9

    };

    struct FRigUnit_MathBoolNot : FRigUnit_MathBoolUnaryOp //ScriptStruct ControlRig.RigUnit_MathBoolNot
    {
    public:


    };

    struct FRigUnit_MathBoolConstant : FRigUnit_MathBoolBase //ScriptStruct ControlRig.RigUnit_MathBoolConstant
    {
    //Children Prop Count (Fields): 1
    public:

        bool Value; // 0x8

    };

    struct FRigUnit_MathBoolConstFalse : FRigUnit_MathBoolConstant //ScriptStruct ControlRig.RigUnit_MathBoolConstFalse
    {
    public:


    };

    struct FRigUnit_MathBoolConstTrue : FRigUnit_MathBoolConstant //ScriptStruct ControlRig.RigUnit_MathBoolConstTrue
    {
    public:


    };

    struct FRigUnit_MathColorBase : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_MathColorBase
    {
    public:


    };

    struct FRigUnit_MathColorLerp : FRigUnit_MathColorBase //ScriptStruct ControlRig.RigUnit_MathColorLerp
    {
    //Children Prop Count (Fields): 4
    public:

        struct FLinearColor A; // 0x8
        struct FLinearColor B; // 0x18
        float T; // 0x28
        struct FLinearColor Result; // 0x2c

    };

    struct FRigUnit_MathColorBinaryOp : FRigUnit_MathColorBase //ScriptStruct ControlRig.RigUnit_MathColorBinaryOp
    {
    //Children Prop Count (Fields): 3
    public:

        struct FLinearColor A; // 0x8
        struct FLinearColor B; // 0x18
        struct FLinearColor Result; // 0x28

    };

    struct FRigUnit_MathColorMul : FRigUnit_MathColorBinaryOp //ScriptStruct ControlRig.RigUnit_MathColorMul
    {
    public:


    };

    struct FRigUnit_MathColorSub : FRigUnit_MathColorBinaryOp //ScriptStruct ControlRig.RigUnit_MathColorSub
    {
    public:


    };

    struct FRigUnit_MathColorAdd : FRigUnit_MathColorBinaryOp //ScriptStruct ControlRig.RigUnit_MathColorAdd
    {
    public:


    };

    struct FRigUnit_MathColorFromFloat : FRigUnit_MathColorBase //ScriptStruct ControlRig.RigUnit_MathColorFromFloat
    {
    //Children Prop Count (Fields): 2
    public:

        float Value; // 0x8
        struct FLinearColor Result; // 0xc

    };

    struct FRigUnit_MathFloatBase : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_MathFloatBase
    {
    public:


    };

    struct FRigUnit_MathFloatLawOfCosine : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatLawOfCosine
    {
    //Children Prop Count (Fields): 7
    public:

        float A; // 0x8
        float B; // 0xc
        float C; // 0x10
        float AlphaAngle; // 0x14
        float BetaAngle; // 0x18
        float GammaAngle; // 0x1c
        bool bValid; // 0x20

    };

    struct FRigUnit_MathFloatUnaryOp : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatUnaryOp
    {
    //Children Prop Count (Fields): 2
    public:

        float Value; // 0x8
        float Result; // 0xc

    };

    struct FRigUnit_MathFloatAtan : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatAtan
    {
    public:


    };

    struct FRigUnit_MathFloatAcos : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatAcos
    {
    public:


    };

    struct FRigUnit_MathFloatAsin : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatAsin
    {
    public:


    };

    struct FRigUnit_MathFloatTan : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatTan
    {
    public:


    };

    struct FRigUnit_MathFloatCos : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatCos
    {
    public:


    };

    struct FRigUnit_MathFloatSin : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatSin
    {
    public:


    };

    struct FRigUnit_MathFloatRad : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatRad
    {
    public:


    };

    struct FRigUnit_MathFloatDeg : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatDeg
    {
    public:


    };

    struct FRigUnit_MathFloatSelectBool : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatSelectBool
    {
    //Children Prop Count (Fields): 4
    public:

        bool Condition; // 0x8
        float IfTrue; // 0xc
        float IfFalse; // 0x10
        float Result; // 0x14

    };

    struct FRigUnit_MathFloatIsNearlyEqual : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatIsNearlyEqual
    {
    //Children Prop Count (Fields): 4
    public:

        float A; // 0x8
        float B; // 0xc
        float Tolerance; // 0x10
        bool Result; // 0x14

    };

    struct FRigUnit_MathFloatIsNearlyZero : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatIsNearlyZero
    {
    //Children Prop Count (Fields): 3
    public:

        float Value; // 0x8
        float Tolerance; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathFloatLessEqual : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatLessEqual
    {
    //Children Prop Count (Fields): 3
    public:

        float A; // 0x8
        float B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathFloatGreaterEqual : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatGreaterEqual
    {
    //Children Prop Count (Fields): 3
    public:

        float A; // 0x8
        float B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathFloatLess : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatLess
    {
    //Children Prop Count (Fields): 3
    public:

        float A; // 0x8
        float B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathFloatGreater : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatGreater
    {
    //Children Prop Count (Fields): 3
    public:

        float A; // 0x8
        float B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathFloatNotEquals : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatNotEquals
    {
    //Children Prop Count (Fields): 3
    public:

        float A; // 0x8
        float B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathFloatEquals : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatEquals
    {
    //Children Prop Count (Fields): 3
    public:

        float A; // 0x8
        float B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathFloatRemap : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatRemap
    {
    //Children Prop Count (Fields): 7
    public:

        float Value; // 0x8
        float SourceMinimum; // 0xc
        float SourceMaximum; // 0x10
        float TargetMinimum; // 0x14
        float TargetMaximum; // 0x18
        bool bClamp; // 0x1c
        float Result; // 0x20

    };

    struct FRigUnit_MathFloatLerp : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatLerp
    {
    //Children Prop Count (Fields): 4
    public:

        float A; // 0x8
        float B; // 0xc
        float T; // 0x10
        float Result; // 0x14

    };

    struct FRigUnit_MathFloatClamp : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatClamp
    {
    //Children Prop Count (Fields): 4
    public:

        float Value; // 0x8
        float Minimum; // 0xc
        float Maximum; // 0x10
        float Result; // 0x14

    };

    struct FRigUnit_MathFloatSign : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatSign
    {
    public:


    };

    struct FRigUnit_MathFloatToInt : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatToInt
    {
    //Children Prop Count (Fields): 2
    public:

        float Value; // 0x8
        int32_t Result; // 0xc

    };

    struct FRigUnit_MathFloatRound : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatRound
    {
    //Children Prop Count (Fields): 3
    public:

        float Value; // 0x8
        float Result; // 0xc
        int32_t Int; // 0x10

    };

    struct FRigUnit_MathFloatCeil : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatCeil
    {
    //Children Prop Count (Fields): 3
    public:

        float Value; // 0x8
        float Result; // 0xc
        int32_t Int; // 0x10

    };

    struct FRigUnit_MathFloatFloor : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatFloor
    {
    //Children Prop Count (Fields): 3
    public:

        float Value; // 0x8
        float Result; // 0xc
        int32_t Int; // 0x10

    };

    struct FRigUnit_MathFloatAbs : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatAbs
    {
    public:


    };

    struct FRigUnit_MathFloatNegate : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatNegate
    {
    public:


    };

    struct FRigUnit_MathFloatSqrt : FRigUnit_MathFloatUnaryOp //ScriptStruct ControlRig.RigUnit_MathFloatSqrt
    {
    public:


    };

    struct FRigUnit_MathFloatBinaryOp : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatBinaryOp
    {
    //Children Prop Count (Fields): 3
    public:

        float A; // 0x8
        float B; // 0xc
        float Result; // 0x10

    };

    struct FRigUnit_MathFloatPow : FRigUnit_MathFloatBinaryOp //ScriptStruct ControlRig.RigUnit_MathFloatPow
    {
    public:


    };

    struct FRigUnit_MathFloatMax : FRigUnit_MathFloatBinaryOp //ScriptStruct ControlRig.RigUnit_MathFloatMax
    {
    public:


    };

    struct FRigUnit_MathFloatMin : FRigUnit_MathFloatBinaryOp //ScriptStruct ControlRig.RigUnit_MathFloatMin
    {
    public:


    };

    struct FRigUnit_MathFloatMod : FRigUnit_MathFloatBinaryOp //ScriptStruct ControlRig.RigUnit_MathFloatMod
    {
    public:


    };

    struct FRigUnit_MathFloatDiv : FRigUnit_MathFloatBinaryOp //ScriptStruct ControlRig.RigUnit_MathFloatDiv
    {
    public:


    };

    struct FRigUnit_MathFloatMul : FRigUnit_MathFloatBinaryOp //ScriptStruct ControlRig.RigUnit_MathFloatMul
    {
    public:


    };

    struct FRigUnit_MathFloatSub : FRigUnit_MathFloatBinaryOp //ScriptStruct ControlRig.RigUnit_MathFloatSub
    {
    public:


    };

    struct FRigUnit_MathFloatAdd : FRigUnit_MathFloatBinaryOp //ScriptStruct ControlRig.RigUnit_MathFloatAdd
    {
    public:


    };

    struct FRigUnit_MathFloatConstant : FRigUnit_MathFloatBase //ScriptStruct ControlRig.RigUnit_MathFloatConstant
    {
    //Children Prop Count (Fields): 1
    public:

        float Value; // 0x8

    };

    struct FRigUnit_MathFloatConstTwoPi : FRigUnit_MathFloatConstant //ScriptStruct ControlRig.RigUnit_MathFloatConstTwoPi
    {
    public:


    };

    struct FRigUnit_MathFloatConstHalfPi : FRigUnit_MathFloatConstant //ScriptStruct ControlRig.RigUnit_MathFloatConstHalfPi
    {
    public:


    };

    struct FRigUnit_MathFloatConstPi : FRigUnit_MathFloatConstant //ScriptStruct ControlRig.RigUnit_MathFloatConstPi
    {
    public:


    };

    struct FRigUnit_MathIntBase : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_MathIntBase
    {
    public:


    };

    struct FRigUnit_MathIntLessEqual : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntLessEqual
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t A; // 0x8
        int32_t B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathIntGreaterEqual : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntGreaterEqual
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t A; // 0x8
        int32_t B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathIntLess : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntLess
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t A; // 0x8
        int32_t B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathIntGreater : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntGreater
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t A; // 0x8
        int32_t B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathIntNotEquals : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntNotEquals
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t A; // 0x8
        int32_t B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathIntEquals : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntEquals
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t A; // 0x8
        int32_t B; // 0xc
        bool Result; // 0x10

    };

    struct FRigUnit_MathIntClamp : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntClamp
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t Value; // 0x8
        int32_t Minimum; // 0xc
        int32_t Maximum; // 0x10
        int32_t Result; // 0x14

    };

    struct FRigUnit_MathIntUnaryOp : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntUnaryOp
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Value; // 0x8
        int32_t Result; // 0xc

    };

    struct FRigUnit_MathIntSign : FRigUnit_MathIntUnaryOp //ScriptStruct ControlRig.RigUnit_MathIntSign
    {
    public:


    };

    struct FRigUnit_MathIntToFloat : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntToFloat
    {
    //Children Prop Count (Fields): 2
    public:

        int32_t Value; // 0x8
        float Result; // 0xc

    };

    struct FRigUnit_MathIntAbs : FRigUnit_MathIntUnaryOp //ScriptStruct ControlRig.RigUnit_MathIntAbs
    {
    public:


    };

    struct FRigUnit_MathIntNegate : FRigUnit_MathIntUnaryOp //ScriptStruct ControlRig.RigUnit_MathIntNegate
    {
    public:


    };

    struct FRigUnit_MathIntBinaryOp : FRigUnit_MathIntBase //ScriptStruct ControlRig.RigUnit_MathIntBinaryOp
    {
    //Children Prop Count (Fields): 3
    public:

        int32_t A; // 0x8
        int32_t B; // 0xc
        int32_t Result; // 0x10

    };

    struct FRigUnit_MathIntPow : FRigUnit_MathIntBinaryOp //ScriptStruct ControlRig.RigUnit_MathIntPow
    {
    public:


    };

    struct FRigUnit_MathIntMax : FRigUnit_MathIntBinaryOp //ScriptStruct ControlRig.RigUnit_MathIntMax
    {
    public:


    };

    struct FRigUnit_MathIntMin : FRigUnit_MathIntBinaryOp //ScriptStruct ControlRig.RigUnit_MathIntMin
    {
    public:


    };

    struct FRigUnit_MathIntMod : FRigUnit_MathIntBinaryOp //ScriptStruct ControlRig.RigUnit_MathIntMod
    {
    public:


    };

    struct FRigUnit_MathIntDiv : FRigUnit_MathIntBinaryOp //ScriptStruct ControlRig.RigUnit_MathIntDiv
    {
    public:


    };

    struct FRigUnit_MathIntMul : FRigUnit_MathIntBinaryOp //ScriptStruct ControlRig.RigUnit_MathIntMul
    {
    public:


    };

    struct FRigUnit_MathIntSub : FRigUnit_MathIntBinaryOp //ScriptStruct ControlRig.RigUnit_MathIntSub
    {
    public:


    };

    struct FRigUnit_MathIntAdd : FRigUnit_MathIntBinaryOp //ScriptStruct ControlRig.RigUnit_MathIntAdd
    {
    public:


    };

    struct FRigUnit_MathQuaternionRotationOrder : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_MathQuaternionRotationOrder
    {
    //Children Prop Count (Fields): 1
    public:

        enum class EControlRigRotationOrder RotationOrder; // 0x8

    };

    struct FRigUnit_MathQuaternionBase : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_MathQuaternionBase
    {
    public:


    };

    struct FRigUnit_MathQuaternionSwingTwist : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionSwingTwist
    {
    //Children Prop Count (Fields): 4
    public:

        struct FQuat Input; // 0x10
        struct FVector TwistAxis; // 0x20
        struct FQuat Swing; // 0x30
        struct FQuat Twist; // 0x40

    };

    struct FRigUnit_MathQuaternionGetAxis : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionGetAxis
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat Quaternion; // 0x10
        enum class EAxis Axis; // 0x20
        struct FVector Result; // 0x24

    };

    struct FRigUnit_MathQuaternionRotateVector : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionRotateVector
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat Quaternion; // 0x10
        struct FVector Vector; // 0x20
        struct FVector Result; // 0x2c

    };

    struct FRigUnit_MathQuaternionUnaryOp : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionUnaryOp
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Value; // 0x10
        struct FQuat Result; // 0x20

    };

    struct FRigUnit_MathQuaternionUnit : FRigUnit_MathQuaternionUnaryOp //ScriptStruct ControlRig.RigUnit_MathQuaternionUnit
    {
    public:


    };

    struct FRigUnit_MathQuaternionDot : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionDot
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat A; // 0x10
        struct FQuat B; // 0x20
        float Result; // 0x30

    };

    struct FRigUnit_MathQuaternionSelectBool : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionSelectBool
    {
    //Children Prop Count (Fields): 4
    public:

        bool Condition; // 0x8
        struct FQuat IfTrue; // 0x10
        struct FQuat IfFalse; // 0x20
        struct FQuat Result; // 0x30

    };

    struct FRigUnit_MathQuaternionNotEquals : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionNotEquals
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat A; // 0x10
        struct FQuat B; // 0x20
        bool Result; // 0x30

    };

    struct FRigUnit_MathQuaternionEquals : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionEquals
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat A; // 0x10
        struct FQuat B; // 0x20
        bool Result; // 0x30

    };

    struct FRigUnit_MathQuaternionSlerp : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionSlerp
    {
    //Children Prop Count (Fields): 4
    public:

        struct FQuat A; // 0x10
        struct FQuat B; // 0x20
        float T; // 0x30
        struct FQuat Result; // 0x40

    };

    struct FRigUnit_MathQuaternionInverse : FRigUnit_MathQuaternionUnaryOp //ScriptStruct ControlRig.RigUnit_MathQuaternionInverse
    {
    public:


    };

    struct FRigUnit_MathQuaternionBinaryOp : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionBinaryOp
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat A; // 0x10
        struct FQuat B; // 0x20
        struct FQuat Result; // 0x30

    };

    struct FRigUnit_MathQuaternionMul : FRigUnit_MathQuaternionBinaryOp //ScriptStruct ControlRig.RigUnit_MathQuaternionMul
    {
    public:


    };

    struct FRigUnit_MathQuaternionToRotator : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionToRotator
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Value; // 0x10
        struct FRotator Result; // 0x20

    };

    struct FRigUnit_MathQuaternionToEuler : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionToEuler
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat Value; // 0x10
        enum class EControlRigRotationOrder RotationOrder; // 0x20
        struct FVector Result; // 0x24

    };

    struct FRigUnit_MathQuaternionScale : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionScale
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Value; // 0x10
        float Scale; // 0x20

    };

    struct FRigUnit_MathQuaternionToAxisAndAngle : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionToAxisAndAngle
    {
    //Children Prop Count (Fields): 3
    public:

        struct FQuat Value; // 0x10
        struct FVector Axis; // 0x20
        float Angle; // 0x2c

    };

    struct FRigUnit_MathQuaternionFromTwoVectors : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionFromTwoVectors
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        struct FQuat Result; // 0x20

    };

    struct FRigUnit_MathQuaternionFromRotator : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionFromRotator
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRotator Rotator; // 0x8
        struct FQuat Result; // 0x20

    };

    struct FRigUnit_MathQuaternionFromEuler : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionFromEuler
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Euler; // 0x8
        enum class EControlRigRotationOrder RotationOrder; // 0x14
        struct FQuat Result; // 0x20

    };

    struct FRigUnit_MathQuaternionFromAxisAndAngle : FRigUnit_MathQuaternionBase //ScriptStruct ControlRig.RigUnit_MathQuaternionFromAxisAndAngle
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Axis; // 0x8
        float Angle; // 0x14
        struct FQuat Result; // 0x20

    };

    struct FRigUnit_MathRBFInterpolateBase : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateBase
    {
    public:


    };

    struct FRigUnit_MathRBFInterpolateVectorBase : FRigUnit_MathRBFInterpolateBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateVectorBase
    {
    //Children Prop Count (Fields): 6
    public:

        struct FVector Input; // 0x8
        enum class ERBFVectorDistanceType DistanceFunction; // 0x14
        enum class ERBFKernelType SmoothingFunction; // 0x15
        float SmoothingRadius; // 0x18
        bool bNormalizeOutput; // 0x1c
        struct FRigUnit_MathRBFInterpolateVectorWorkData WorkData; // 0x20

    };

    struct FRigUnit_MathRBFInterpolateVectorWorkData //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateVectorWorkData
    {
    public:


    };

    struct FRigUnit_MathRBFInterpolateVectorXform : FRigUnit_MathRBFInterpolateVectorBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateVectorXform
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateVectorXform_Target> Targets; // 0xb0
        struct FTransform Output; // 0xc0

    };

    struct FMathRBFInterpolateVectorXform_Target //ScriptStruct ControlRig.MathRBFInterpolateVectorXform_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Target; // 0x0
        struct FTransform Value; // 0x10

    };

    struct FRigUnit_MathRBFInterpolateVectorQuat : FRigUnit_MathRBFInterpolateVectorBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateVectorQuat
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateVectorQuat_Target> Targets; // 0xb0
        struct FQuat Output; // 0xc0

    };

    struct FMathRBFInterpolateVectorQuat_Target //ScriptStruct ControlRig.MathRBFInterpolateVectorQuat_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Target; // 0x0
        struct FQuat Value; // 0x10

    };

    struct FRigUnit_MathRBFInterpolateVectorColor : FRigUnit_MathRBFInterpolateVectorBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateVectorColor
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateVectorColor_Target> Targets; // 0xb0
        struct FLinearColor Output; // 0xc0

    };

    struct FMathRBFInterpolateVectorColor_Target //ScriptStruct ControlRig.MathRBFInterpolateVectorColor_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Target; // 0x0
        struct FLinearColor Value; // 0xc

    };

    struct FRigUnit_MathRBFInterpolateVectorVector : FRigUnit_MathRBFInterpolateVectorBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateVectorVector
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateVectorVector_Target> Targets; // 0xb0
        struct FVector Output; // 0xc0

    };

    struct FMathRBFInterpolateVectorVector_Target //ScriptStruct ControlRig.MathRBFInterpolateVectorVector_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Target; // 0x0
        struct FVector Value; // 0xc

    };

    struct FRigUnit_MathRBFInterpolateVectorFloat : FRigUnit_MathRBFInterpolateVectorBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateVectorFloat
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateVectorFloat_Target> Targets; // 0xb0
        float Output; // 0xc0

    };

    struct FMathRBFInterpolateVectorFloat_Target //ScriptStruct ControlRig.MathRBFInterpolateVectorFloat_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Target; // 0x0
        float Value; // 0xc

    };

    struct FRigUnit_MathRBFInterpolateQuatBase : FRigUnit_MathRBFInterpolateBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateQuatBase
    {
    //Children Prop Count (Fields): 7
    public:

        struct FQuat Input; // 0x10
        enum class ERBFQuatDistanceType DistanceFunction; // 0x20
        enum class ERBFKernelType SmoothingFunction; // 0x21
        float SmoothingAngle; // 0x24
        bool bNormalizeOutput; // 0x28
        struct FVector TwistAxis; // 0x2c
        struct FRigUnit_MathRBFInterpolateQuatWorkData WorkData; // 0x40

    };

    struct FRigUnit_MathRBFInterpolateQuatWorkData //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateQuatWorkData
    {
    public:


    };

    struct FRigUnit_MathRBFInterpolateQuatXform : FRigUnit_MathRBFInterpolateQuatBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateQuatXform
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateQuatXform_Target> Targets; // 0xd0
        struct FTransform Output; // 0xe0

    };

    struct FMathRBFInterpolateQuatXform_Target //ScriptStruct ControlRig.MathRBFInterpolateQuatXform_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Target; // 0x0
        struct FTransform Value; // 0x10

    };

    struct FRigUnit_MathRBFInterpolateQuatQuat : FRigUnit_MathRBFInterpolateQuatBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateQuatQuat
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateQuatQuat_Target> Targets; // 0xd0
        struct FQuat Output; // 0xe0

    };

    struct FMathRBFInterpolateQuatQuat_Target //ScriptStruct ControlRig.MathRBFInterpolateQuatQuat_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Target; // 0x0
        struct FQuat Value; // 0x10

    };

    struct FRigUnit_MathRBFInterpolateQuatColor : FRigUnit_MathRBFInterpolateQuatBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateQuatColor
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateQuatColor_Target> Targets; // 0xd0
        struct FLinearColor Output; // 0xe0

    };

    struct FMathRBFInterpolateQuatColor_Target //ScriptStruct ControlRig.MathRBFInterpolateQuatColor_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Target; // 0x0
        struct FLinearColor Value; // 0x10

    };

    struct FRigUnit_MathRBFInterpolateQuatVector : FRigUnit_MathRBFInterpolateQuatBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateQuatVector
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateQuatVector_Target> Targets; // 0xd0
        struct FVector Output; // 0xe0

    };

    struct FMathRBFInterpolateQuatVector_Target //ScriptStruct ControlRig.MathRBFInterpolateQuatVector_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Target; // 0x0
        struct FVector Value; // 0x10

    };

    struct FRigUnit_MathRBFInterpolateQuatFloat : FRigUnit_MathRBFInterpolateQuatBase //ScriptStruct ControlRig.RigUnit_MathRBFInterpolateQuatFloat
    {
    //Children Prop Count (Fields): 2
    public:

        struct TArray<struct FMathRBFInterpolateQuatFloat_Target> Targets; // 0xd0
        float Output; // 0xe0

    };

    struct FMathRBFInterpolateQuatFloat_Target //ScriptStruct ControlRig.MathRBFInterpolateQuatFloat_Target
    {
    //Children Prop Count (Fields): 2
    public:

        struct FQuat Target; // 0x0
        float Value; // 0x10

    };

    struct FRigUnit_MathTransformBase : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_MathTransformBase
    {
    public:


    };

    struct FRigUnit_MathTransformClampSpatially : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformClampSpatially
    {
    //Children Prop Count (Fields): 10
    public:

        struct FTransform Value; // 0x10
        enum class EAxis Axis; // 0x40
        enum class EControlRigClampSpatialMode Type; // 0x41
        float Minimum; // 0x44
        float Maximum; // 0x48
        struct FTransform Space; // 0x50
        bool bDrawDebug; // 0x80
        struct FLinearColor DebugColor; // 0x84
        float DebugThickness; // 0x94
        struct FTransform Result; // 0xa0

    };

    struct FRigUnit_MathTransformFromSRT : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformFromSRT
    {
    //Children Prop Count (Fields): 6
    public:

        struct FVector Location; // 0x8
        struct FVector Rotation; // 0x14
        enum class EControlRigRotationOrder RotationOrder; // 0x20
        struct FVector Scale; // 0x24
        struct FTransform Transform; // 0x30
        struct FEulerTransform EulerTransform; // 0x60

    };

    struct FRigUnit_MathTransformTransformVector : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformTransformVector
    {
    //Children Prop Count (Fields): 3
    public:

        struct FTransform Transform; // 0x10
        struct FVector Location; // 0x40
        struct FVector Result; // 0x4c

    };

    struct FRigUnit_MathTransformRotateVector : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformRotateVector
    {
    //Children Prop Count (Fields): 3
    public:

        struct FTransform Transform; // 0x10
        struct FVector Direction; // 0x40
        struct FVector Result; // 0x4c

    };

    struct FRigUnit_MathTransformSelectBool : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformSelectBool
    {
    //Children Prop Count (Fields): 4
    public:

        bool Condition; // 0x8
        struct FTransform IfTrue; // 0x10
        struct FTransform IfFalse; // 0x40
        struct FTransform Result; // 0x70

    };

    struct FRigUnit_MathTransformLerp : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformLerp
    {
    //Children Prop Count (Fields): 4
    public:

        struct FTransform A; // 0x10
        struct FTransform B; // 0x40
        float T; // 0x70
        struct FTransform Result; // 0x80

    };

    struct FRigUnit_MathTransformUnaryOp : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformUnaryOp
    {
    //Children Prop Count (Fields): 2
    public:

        struct FTransform Value; // 0x10
        struct FTransform Result; // 0x40

    };

    struct FRigUnit_MathTransformInverse : FRigUnit_MathTransformUnaryOp //ScriptStruct ControlRig.RigUnit_MathTransformInverse
    {
    public:


    };

    struct FRigUnit_MathTransformMakeAbsolute : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformMakeAbsolute
    {
    //Children Prop Count (Fields): 3
    public:

        struct FTransform Local; // 0x10
        struct FTransform Parent; // 0x40
        struct FTransform Global; // 0x70

    };

    struct FRigUnit_MathTransformMakeRelative : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformMakeRelative
    {
    //Children Prop Count (Fields): 3
    public:

        struct FTransform Global; // 0x10
        struct FTransform Parent; // 0x40
        struct FTransform Local; // 0x70

    };

    struct FRigUnit_MathTransformBinaryOp : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformBinaryOp
    {
    //Children Prop Count (Fields): 3
    public:

        struct FTransform A; // 0x10
        struct FTransform B; // 0x40
        struct FTransform Result; // 0x70

    };

    struct FRigUnit_MathTransformMul : FRigUnit_MathTransformBinaryOp //ScriptStruct ControlRig.RigUnit_MathTransformMul
    {
    public:


    };

    struct FRigUnit_MathTransformToEulerTransform : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformToEulerTransform
    {
    //Children Prop Count (Fields): 2
    public:

        struct FTransform Value; // 0x10
        struct FEulerTransform Result; // 0x40

    };

    struct FRigUnit_MathTransformFromEulerTransform : FRigUnit_MathTransformBase //ScriptStruct ControlRig.RigUnit_MathTransformFromEulerTransform
    {
    //Children Prop Count (Fields): 2
    public:

        struct FEulerTransform EulerTransform; // 0x8
        struct FTransform Result; // 0x30

    };

    struct FRigUnit_MathVectorBase : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_MathVectorBase
    {
    public:


    };

    struct FRigUnit_MathIntersectPlane : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathIntersectPlane
    {
    //Children Prop Count (Fields): 6
    public:

        struct FVector Start; // 0x8
        struct FVector Direction; // 0x14
        struct FVector PlanePoint; // 0x20
        struct FVector PlaneNormal; // 0x2c
        struct FVector Result; // 0x38
        float Distance; // 0x44

    };

    struct FRigUnit_MathVectorClampSpatially : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorClampSpatially
    {
    //Children Prop Count (Fields): 10
    public:

        struct FVector Value; // 0x8
        enum class EAxis Axis; // 0x14
        enum class EControlRigClampSpatialMode Type; // 0x15
        float Minimum; // 0x18
        float Maximum; // 0x1c
        struct FTransform Space; // 0x20
        bool bDrawDebug; // 0x50
        struct FLinearColor DebugColor; // 0x54
        float DebugThickness; // 0x64
        struct FVector Result; // 0x68

    };

    struct FRigUnit_MathVectorMakeBezierFourPoint : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorMakeBezierFourPoint
    {
    //Children Prop Count (Fields): 1
    public:

        struct FCRFourPointBezier Bezier; // 0x8

    };

    struct FRigUnit_MathVectorBezierFourPoint : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorBezierFourPoint
    {
    //Children Prop Count (Fields): 4
    public:

        struct FCRFourPointBezier Bezier; // 0x8
        float T; // 0x38
        struct FVector Result; // 0x3c
        struct FVector Tangent; // 0x48

    };

    struct FRigUnit_MathVectorOrthogonal : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorOrthogonal
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        bool Result; // 0x20

    };

    struct FRigUnit_MathVectorParallel : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorParallel
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        bool Result; // 0x20

    };

    struct FRigUnit_MathVectorAngle : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorAngle
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        float Result; // 0x20

    };

    struct FRigUnit_MathVectorMirror : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorMirror
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Value; // 0x8
        struct FVector Normal; // 0x14
        struct FVector Result; // 0x20

    };

    struct FRigUnit_MathVectorClampLength : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorClampLength
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector Value; // 0x8
        float MinimumLength; // 0x14
        float MaximumLength; // 0x18
        struct FVector Result; // 0x1c

    };

    struct FRigUnit_MathVectorSetLength : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorSetLength
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Value; // 0x8
        float Length; // 0x14
        struct FVector Result; // 0x18

    };

    struct FRigUnit_MathVectorUnaryOp : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorUnaryOp
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Value; // 0x8
        struct FVector Result; // 0x14

    };

    struct FRigUnit_MathVectorUnit : FRigUnit_MathVectorUnaryOp //ScriptStruct ControlRig.RigUnit_MathVectorUnit
    {
    public:


    };

    struct FRigUnit_MathVectorDot : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorDot
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        float Result; // 0x20

    };

    struct FRigUnit_MathVectorBinaryOp : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorBinaryOp
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        struct FVector Result; // 0x20

    };

    struct FRigUnit_MathVectorCross : FRigUnit_MathVectorBinaryOp //ScriptStruct ControlRig.RigUnit_MathVectorCross
    {
    public:


    };

    struct FRigUnit_MathVectorDistance : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorDistance
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        float Result; // 0x20

    };

    struct FRigUnit_MathVectorLength : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorLength
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Value; // 0x8
        float Result; // 0x14

    };

    struct FRigUnit_MathVectorLengthSquared : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorLengthSquared
    {
    //Children Prop Count (Fields): 2
    public:

        struct FVector Value; // 0x8
        float Result; // 0x14

    };

    struct FRigUnit_MathVectorRad : FRigUnit_MathVectorUnaryOp //ScriptStruct ControlRig.RigUnit_MathVectorRad
    {
    public:


    };

    struct FRigUnit_MathVectorDeg : FRigUnit_MathVectorUnaryOp //ScriptStruct ControlRig.RigUnit_MathVectorDeg
    {
    public:


    };

    struct FRigUnit_MathVectorSelectBool : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorSelectBool
    {
    //Children Prop Count (Fields): 4
    public:

        bool Condition; // 0x8
        struct FVector IfTrue; // 0xc
        struct FVector IfFalse; // 0x18
        struct FVector Result; // 0x24

    };

    struct FRigUnit_MathVectorIsNearlyEqual : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorIsNearlyEqual
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        float Tolerance; // 0x20
        bool Result; // 0x24

    };

    struct FRigUnit_MathVectorIsNearlyZero : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorIsNearlyZero
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Value; // 0x8
        float Tolerance; // 0x14
        bool Result; // 0x18

    };

    struct FRigUnit_MathVectorNotEquals : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorNotEquals
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        bool Result; // 0x20

    };

    struct FRigUnit_MathVectorEquals : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorEquals
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        bool Result; // 0x20

    };

    struct FRigUnit_MathVectorRemap : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorRemap
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector Value; // 0x8
        struct FVector SourceMinimum; // 0x14
        struct FVector SourceMaximum; // 0x20
        struct FVector TargetMinimum; // 0x2c
        struct FVector TargetMaximum; // 0x38
        bool bClamp; // 0x44
        struct FVector Result; // 0x48

    };

    struct FRigUnit_MathVectorLerp : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorLerp
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector A; // 0x8
        struct FVector B; // 0x14
        float T; // 0x20
        struct FVector Result; // 0x24

    };

    struct FRigUnit_MathVectorClamp : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorClamp
    {
    //Children Prop Count (Fields): 4
    public:

        struct FVector Value; // 0x8
        struct FVector Minimum; // 0x14
        struct FVector Maximum; // 0x20
        struct FVector Result; // 0x2c

    };

    struct FRigUnit_MathVectorSign : FRigUnit_MathVectorUnaryOp //ScriptStruct ControlRig.RigUnit_MathVectorSign
    {
    public:


    };

    struct FRigUnit_MathVectorRound : FRigUnit_MathVectorUnaryOp //ScriptStruct ControlRig.RigUnit_MathVectorRound
    {
    public:


    };

    struct FRigUnit_MathVectorCeil : FRigUnit_MathVectorUnaryOp //ScriptStruct ControlRig.RigUnit_MathVectorCeil
    {
    public:


    };

    struct FRigUnit_MathVectorFloor : FRigUnit_MathVectorUnaryOp //ScriptStruct ControlRig.RigUnit_MathVectorFloor
    {
    public:


    };

    struct FRigUnit_MathVectorAbs : FRigUnit_MathVectorUnaryOp //ScriptStruct ControlRig.RigUnit_MathVectorAbs
    {
    public:


    };

    struct FRigUnit_MathVectorNegate : FRigUnit_MathVectorUnaryOp //ScriptStruct ControlRig.RigUnit_MathVectorNegate
    {
    public:


    };

    struct FRigUnit_MathVectorMax : FRigUnit_MathVectorBinaryOp //ScriptStruct ControlRig.RigUnit_MathVectorMax
    {
    public:


    };

    struct FRigUnit_MathVectorMin : FRigUnit_MathVectorBinaryOp //ScriptStruct ControlRig.RigUnit_MathVectorMin
    {
    public:


    };

    struct FRigUnit_MathVectorMod : FRigUnit_MathVectorBinaryOp //ScriptStruct ControlRig.RigUnit_MathVectorMod
    {
    public:


    };

    struct FRigUnit_MathVectorDiv : FRigUnit_MathVectorBinaryOp //ScriptStruct ControlRig.RigUnit_MathVectorDiv
    {
    public:


    };

    struct FRigUnit_MathVectorScale : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorScale
    {
    //Children Prop Count (Fields): 3
    public:

        struct FVector Value; // 0x8
        float Factor; // 0x14
        struct FVector Result; // 0x18

    };

    struct FRigUnit_MathVectorMul : FRigUnit_MathVectorBinaryOp //ScriptStruct ControlRig.RigUnit_MathVectorMul
    {
    public:


    };

    struct FRigUnit_MathVectorSub : FRigUnit_MathVectorBinaryOp //ScriptStruct ControlRig.RigUnit_MathVectorSub
    {
    public:


    };

    struct FRigUnit_MathVectorAdd : FRigUnit_MathVectorBinaryOp //ScriptStruct ControlRig.RigUnit_MathVectorAdd
    {
    public:


    };

    struct FRigUnit_MathVectorFromFloat : FRigUnit_MathVectorBase //ScriptStruct ControlRig.RigUnit_MathVectorFromFloat
    {
    //Children Prop Count (Fields): 2
    public:

        float Value; // 0x8
        struct FVector Result; // 0xc

    };

    struct FRigUnit_ModifyBoneTransforms : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_ModifyBoneTransforms
    {
    //Children Prop Count (Fields): 6
    public:

        struct TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> BoneToModify; // 0x68
        float Weight; // 0x78
        float WeightMinimum; // 0x7c
        float WeightMaximum; // 0x80
        enum class EControlRigModifyBoneMode Mode; // 0x84
        struct FRigUnit_ModifyBoneTransforms_WorkData WorkData; // 0x88

    };

    struct FRigUnit_ModifyTransforms_WorkData //ScriptStruct ControlRig.RigUnit_ModifyTransforms_WorkData
    {
    //Children Prop Count (Fields): 1
    public:

        struct TArray<struct FCachedRigElement> CachedItems; // 0x0

    };

    struct FRigUnit_ModifyBoneTransforms_WorkData : FRigUnit_ModifyTransforms_WorkData //ScriptStruct ControlRig.RigUnit_ModifyBoneTransforms_WorkData
    {
    public:


    };

    struct FRigUnit_ModifyBoneTransforms_PerBone //ScriptStruct ControlRig.RigUnit_ModifyBoneTransforms_PerBone
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Bone; // 0x0
        struct FTransform Transform; // 0x10

    };

    struct FRigUnit_ModifyTransforms : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_ModifyTransforms
    {
    //Children Prop Count (Fields): 6
    public:

        struct TArray<struct FRigUnit_ModifyTransforms_PerItem> ItemToModify; // 0x68
        float Weight; // 0x78
        float WeightMinimum; // 0x7c
        float WeightMaximum; // 0x80
        enum class EControlRigModifyBoneMode Mode; // 0x84
        struct FRigUnit_ModifyTransforms_WorkData WorkData; // 0x88

    };

    struct FRigUnit_ModifyTransforms_PerItem //ScriptStruct ControlRig.RigUnit_ModifyTransforms_PerItem
    {
    //Children Prop Count (Fields): 2
    public:

        struct FRigElementKey item; // 0x0
        struct FTransform Transform; // 0x10

    };

    struct FRigUnit_MultiFABRIK : FRigUnit_HighlevelBaseMutable //ScriptStruct ControlRig.RigUnit_MultiFABRIK
    {
    //Children Prop Count (Fields): 6
    public:

        struct FName RootBone; // 0x68
        struct TArray<struct FRigUnit_MultiFABRIK_EndEffector> Effectors; // 0x70
        float Precision; // 0x80
        bool bPropagateToChildren; // 0x84
        int32_t MaxIterations; // 0x88
        struct FRigUnit_MultiFABRIK_WorkData WorkData; // 0x90

    };

    struct FRigUnit_MultiFABRIK_WorkData //ScriptStruct ControlRig.RigUnit_MultiFABRIK_WorkData
    {
    public:


    };

    struct FRigUnit_MultiFABRIK_EndEffector //ScriptStruct ControlRig.RigUnit_MultiFABRIK_EndEffector
    {
    //Children Prop Count (Fields): 2
    public:

        struct FName Bone; // 0x0
        struct FVector Location; // 0x8

    };

    struct FRigUnit_NameBase : FRigUnit //ScriptStruct ControlRig.RigUnit_NameBase
    {
    public:


    };

    struct FRigUnit_Contains : FRigUnit_NameBase //ScriptStruct ControlRig.RigUnit_Contains
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName Name; // 0x8
        struct FName Search; // 0x10
        bool Result; // 0x18

    };

    struct FRigUnit_StartsWith : FRigUnit_NameBase //ScriptStruct ControlRig.RigUnit_StartsWith
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName Name; // 0x8
        struct FName Start; // 0x10
        bool Result; // 0x18

    };

    struct FRigUnit_EndsWith : FRigUnit_NameBase //ScriptStruct ControlRig.RigUnit_EndsWith
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName Name; // 0x8
        struct FName Ending; // 0x10
        bool Result; // 0x18

    };

    struct FRigUnit_NameReplace : FRigUnit_NameBase //ScriptStruct ControlRig.RigUnit_NameReplace
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName Name; // 0x8
        struct FName Old; // 0x10
        struct FName New; // 0x18
        struct FName Result; // 0x20

    };

    struct FRigUnit_NameTruncate : FRigUnit_NameBase //ScriptStruct ControlRig.RigUnit_NameTruncate
    {
    //Children Prop Count (Fields): 5
    public:

        struct FName Name; // 0x8
        int32_t Count; // 0x10
        bool FromEnd; // 0x14
        struct FName Remainder; // 0x18
        struct FName Chopped; // 0x20

    };

    struct FRigUnit_NameConcat : FRigUnit_NameBase //ScriptStruct ControlRig.RigUnit_NameConcat
    {
    //Children Prop Count (Fields): 3
    public:

        struct FName A; // 0x8
        struct FName B; // 0x10
        struct FName Result; // 0x18

    };

    struct FRigUnit_NoiseVector : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_NoiseVector
    {
    //Children Prop Count (Fields): 7
    public:

        struct FVector position; // 0x8
        struct FVector Speed; // 0x14
        struct FVector Frequency; // 0x20
        float Minimum; // 0x2c
        float Maximum; // 0x30
        struct FVector Result; // 0x34
        struct FVector Time; // 0x40

    };

    struct FRigUnit_NoiseFloat : FRigUnit_MathBase //ScriptStruct ControlRig.RigUnit_NoiseFloat
    {
    //Children Prop Count (Fields): 7
    public:

        float Value; // 0x8
        float Speed; // 0xc
        float Frequency; // 0x10
        float Minimum; // 0x14
        float Maximum; // 0x18
        float Result; // 0x1c
        float Time; // 0x20

    };

    struct FRigUnit_OffsetTransformForItem : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_OffsetTransformForItem
    {
    //Children Prop Count (Fields): 5
    public:

        struct FRigElementKey item; // 0x68
        struct FTransform OffsetTransform; // 0x80
        float Weight; // 0xb0
        bool bPropagateToChildren; // 0xb4
        struct FCachedRigElement CachedIndex; // 0xb8

    };

    struct FRigUnit_ParentSwitchConstraint : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_ParentSwitchConstraint
    {
    //Children Prop Count (Fields): 10
    public:

        struct FRigElementKey Subject; // 0x68
        int32_t ParentIndex; // 0x74
        struct FRigElementKeyCollection Parents; // 0x78
        struct FTransform InitialGlobalTransform; // 0x90
        float Weight; // 0xc0
        struct FTransform Transform; // 0xd0
        bool Switched; // 0x100
        struct FCachedRigElement CachedSubject; // 0x104
        struct FCachedRigElement CachedParent; // 0x118
        struct FTransform RelativeOffset; // 0x130

    };

    struct FRigUnit_SimBaseMutable : FRigUnitMutable //ScriptStruct ControlRig.RigUnit_SimBaseMutable
    {
    public:


    };

    struct FRigUnit_PointSimulation : FRigUnit_SimBaseMutable //ScriptStruct ControlRig.RigUnit_PointSimulation
    {
    //Children Prop Count (Fields): 15
    public:

        struct TArray<struct FCRSimPoint> Points; // 0x68
        struct TArray<struct FCRSimLinearSpring> Links; // 0x78
        struct TArray<struct FCRSimPointForce> Forces; // 0x88
        struct TArray<struct FCRSimSoftCollision> CollisionVolumes; // 0x98
        float SimulatedStepsPerSecond; // 0xa8
        enum class ECRSimPointIntegrateType IntegratorType; // 0xac
        float VerletBlend; // 0xb0
        struct TArray<struct FRigUnit_PointSimulation_BoneTarget> BoneTargets; // 0xb8
        bool bLimitLocalPosition; // 0xc8
        bool bPropagateToChildren; // 0xc9
        struct FVector PrimaryAimAxis; // 0xcc
        struct FVector SecondaryAimAxis; // 0xd8
        struct FRigUnit_PointSimulation_DebugSettings DebugSettings; // 0xf0
        struct FCRFourPointBezier Bezier; // 0x140
        struct FRigUnit_PointSimulation_WorkData WorkData; // 0x170

    };

    struct FRigUnit_PointSimulation_WorkData //ScriptStruct ControlRig.RigUnit_PointSimulation_WorkData
    {
    //Children Prop Count (Fields): 2
    public:

        struct FCRSimPointContainer Simulation; // 0x0
        struct TArray<struct FCachedRigElement> BoneIndices; // 0x78

    };

    struct FRigUnit_PointSimulation_DebugSettings //ScriptStruct ControlRig.RigUnit_PointSimulation_DebugSettings
    {
    //Children Prop Count (Fields): 6
    public:

        bool bEnabled; // 0x0
        float Scale; // 0x4
        float CollisionScale; // 0x8
        bool bDrawPointsAsSpheres; // 0xc
        struct FLinearColor Color; // 0x10
        struct FTransform WorldOffset; // 0x20

    };

    struct FRigUnit_PointSimulation_BoneTarget //ScriptStruct ControlRig.RigUnit_PointSimulation_BoneTarget
    {
    //Children Prop Count (Fields): 4
    public:

        struct FName Bone; // 0x0
        int32_t TranslationPoint; // 0x8
        int32_t PrimaryAimPoint; // 0xc
        int32_t SecondaryAimPoint; // 0x10

    };

    struct FRigUnit_PrepareForExecution : FRigUnit //ScriptStruct ControlRig.RigUnit_PrepareForExecution
    {
    //Children Prop Count (Fields): 1
    public:

        struct FControlRigExecuteContext ExecuteContext; // 0x8

    };

    struct FRigUnit_EndProfilingTimer : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_EndProfilingTimer
    {
    //Children Prop Count (Fields): 4
    public:

        int32_t NumberOfMeasurements; // 0x68
        struct FString Prefix; // 0x70
        float AccumulatedTime; // 0x80
        int32_t MeasurementsLeft; // 0x84

    };

    struct FRigUnit_StartProfilingTimer : FRigUnit_DebugBaseMutable //ScriptStruct ControlRig.RigUnit_StartProfilingTimer
    {
    public:


    };

    struct FRigUnit_ProjectTransformToNewParent : FRigUnit //ScriptStruct ControlRig.RigUnit_ProjectTransformToNewParent
    {
    //Children Prop Count (Fields): 10
